TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:03 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    3110                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3111                            .dwattr $C$DW$200, DW_AT_decl_line(0x5e6)
    3112                            .dwattr $C$DW$200, DW_AT_decl_column(0x05)
    3113                    
    3114                    $C$DW$201       .dwtag  DW_TAG_enumerator
    3115                            .dwattr $C$DW$201, DW_AT_name("RF_AllowDelayAny")
    3116                            .dwattr $C$DW$201, DW_AT_const_value(-1)
    3117                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3118                            .dwattr $C$DW$201, DW_AT_decl_line(0x5e7)
    3119                            .dwattr $C$DW$201, DW_AT_decl_column(0x05)
    3120                    
    3121                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    3122                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x5e5)
    3123                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x0e)
    3124                            .dwendtag $C$DW$T$1061
    3125                    
    3126                    $C$DW$T$1062    .dwtag  DW_TAG_typedef
    3127                            .dwattr $C$DW$T$1062, DW_AT_name("RF_AllowDelay")
    3128                            .dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
    3129                            .dwattr $C$DW$T$1062, DW_AT_language(DW_LANG_C)
    3130                            .dwattr $C$DW$T$1062, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    3131                            .dwattr $C$DW$T$1062, DW_AT_decl_line(0x5e8)
    3132                            .dwattr $C$DW$T$1062, DW_AT_decl_column(0x03)
    3133                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   58

    3134                    
    3135                    $C$DW$T$1063    .dwtag  DW_TAG_enumeration_type
    3136                            .dwattr $C$DW$T$1063, DW_AT_byte_size(0x01)
    3137                    $C$DW$202       .dwtag  DW_TAG_enumerator
    3138                            .dwattr $C$DW$202, DW_AT_name("RF_RatChannelAny")
    3139                            .dwattr $C$DW$202, DW_AT_const_value(-1)
    3140                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3141                            .dwattr $C$DW$202, DW_AT_decl_line(0x608)
    3142                            .dwattr $C$DW$202, DW_AT_decl_column(0x05)
    3143                    
    3144                    $C$DW$203       .dwtag  DW_TAG_enumerator
    3145                            .dwattr $C$DW$203, DW_AT_name("RF_RatChannel0")
    3146                            .dwattr $C$DW$203, DW_AT_const_value(0x00)
    3147                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3148                            .dwattr $C$DW$203, DW_AT_decl_line(0x609)
    3149                            .dwattr $C$DW$203, DW_AT_decl_column(0x05)
    3150                    
    3151                    $C$DW$204       .dwtag  DW_TAG_enumerator
    3152                            .dwattr $C$DW$204, DW_AT_name("RF_RatChannel1")
    3153                            .dwattr $C$DW$204, DW_AT_const_value(0x01)
    3154                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3155                            .dwattr $C$DW$204, DW_AT_decl_line(0x60a)
    3156                            .dwattr $C$DW$204, DW_AT_decl_column(0x05)
    3157                    
    3158                    $C$DW$205       .dwtag  DW_TAG_enumerator
    3159                            .dwattr $C$DW$205, DW_AT_name("RF_RatChannel2")
    3160                            .dwattr $C$DW$205, DW_AT_const_value(0x02)
    3161                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3162                            .dwattr $C$DW$205, DW_AT_decl_line(0x60b)
    3163                            .dwattr $C$DW$205, DW_AT_decl_column(0x05)
    3164                    
    3165                            .dwattr $C$DW$T$1063, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    3166                            .dwattr $C$DW$T$1063, DW_AT_decl_line(0x607)
    3167                            .dwattr $C$DW$T$1063, DW_AT_decl_column(0x0e)
    3168                            .dwendtag $C$DW$T$1063
    3169                    
    3170                    $C$DW$T$1064    .dwtag  DW_TAG_typedef
    3171                            .dwattr $C$DW$T$1064, DW_AT_name("RF_RatSelectChannel")
    3172                            .dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$1063)
    3173                            .dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
    3174                            .dwattr $C$DW$T$1064, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    3175                            .dwattr $C$DW$T$1064, DW_AT_decl_line(0x60c)
    3176                            .dwattr $C$DW$T$1064, DW_AT_decl_column(0x03)
    3177                    
    3178                    
    3179                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3180                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    3181                    $C$DW$206       .dwtag  DW_TAG_member
    3182                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    3183                            .dwattr $C$DW$206, DW_AT_name("rfMode")
    3184                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("rfMode")
    3185                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3186                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3187                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3188                            .dwattr $C$DW$206, DW_AT_decl_line(0x41e)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   59

    3189                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    3190                    
    3191                    $C$DW$207       .dwtag  DW_TAG_member
    3192                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    3193                            .dwattr $C$DW$207, DW_AT_name("cpePatchFxn")
    3194                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("cpePatchFxn")
    3195                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3196                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3197                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3198                            .dwattr $C$DW$207, DW_AT_decl_line(0x41f)
    3199                            .dwattr $C$DW$207, DW_AT_decl_column(0x0c)
    3200                    
    3201                    $C$DW$208       .dwtag  DW_TAG_member
    3202                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    3203                            .dwattr $C$DW$208, DW_AT_name("mcePatchFxn")
    3204                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("mcePatchFxn")
    3205                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3206                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3207                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3208                            .dwattr $C$DW$208, DW_AT_decl_line(0x420)
    3209                            .dwattr $C$DW$208, DW_AT_decl_column(0x0c)
    3210                    
    3211                    $C$DW$209       .dwtag  DW_TAG_member
    3212                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$24)
    3213                            .dwattr $C$DW$209, DW_AT_name("rfePatchFxn")
    3214                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("rfePatchFxn")
    3215                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3216                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3217                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    3218                            .dwattr $C$DW$209, DW_AT_decl_line(0x421)
    3219                            .dwattr $C$DW$209, DW_AT_decl_column(0x0c)
    3220                    
    3221                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    3222                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x41d)
    3223                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3224                            .dwendtag $C$DW$T$25
    3225                    
    3226                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    3227                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    3228                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    3229                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3230                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    3231                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x422)
    3232                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    3233                    
    3234                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3235                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3236                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3237                    
    3238                    
    3239                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3240                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3241                    $C$DW$210       .dwtag  DW_TAG_member
    3242                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    3243                            .dwattr $C$DW$210, DW_AT_name("triggerType")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   60

    3244                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("triggerType")
    3245                            .dwattr $C$DW$210, DW_AT_bit_offset(0x04)
    3246                            .dwattr $C$DW$210, DW_AT_bit_size(0x04)
    3247                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3248                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3249                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3250                            .dwattr $C$DW$210, DW_AT_decl_line(0x7d)
    3251                            .dwattr $C$DW$210, DW_AT_decl_column(0x0f)
    3252                    
    3253                    $C$DW$211       .dwtag  DW_TAG_member
    3254                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    3255                            .dwattr $C$DW$211, DW_AT_name("bEnaCmd")
    3256                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("bEnaCmd")
    3257                            .dwattr $C$DW$211, DW_AT_bit_offset(0x03)
    3258                            .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    3259                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3260                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3261                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3262                            .dwattr $C$DW$211, DW_AT_decl_line(0x7e)
    3263                            .dwattr $C$DW$211, DW_AT_decl_column(0x0f)
    3264                    
    3265                    $C$DW$212       .dwtag  DW_TAG_member
    3266                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    3267                            .dwattr $C$DW$212, DW_AT_name("triggerNo")
    3268                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("triggerNo")
    3269                            .dwattr $C$DW$212, DW_AT_bit_offset(0x01)
    3270                            .dwattr $C$DW$212, DW_AT_bit_size(0x02)
    3271                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3272                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3274                            .dwattr $C$DW$212, DW_AT_decl_line(0x80)
    3275                            .dwattr $C$DW$212, DW_AT_decl_column(0x0f)
    3276                    
    3277                    $C$DW$213       .dwtag  DW_TAG_member
    3278                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    3279                            .dwattr $C$DW$213, DW_AT_name("pastTrig")
    3280                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pastTrig")
    3281                            .dwattr $C$DW$213, DW_AT_bit_offset(0x00)
    3282                            .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    3283                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3284                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3285                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3286                            .dwattr $C$DW$213, DW_AT_decl_line(0x81)
    3287                            .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    3288                    
    3289                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3290                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    3291                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3292                            .dwendtag $C$DW$T$26
    3293                    
    3294                    
    3295                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3296                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3297                    $C$DW$214       .dwtag  DW_TAG_member
    3298                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   61

    3299                            .dwattr $C$DW$214, DW_AT_name("rule")
    3300                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("rule")
    3301                            .dwattr $C$DW$214, DW_AT_bit_offset(0x04)
    3302                            .dwattr $C$DW$214, DW_AT_bit_size(0x04)
    3303                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3304                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3305                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3306                            .dwattr $C$DW$214, DW_AT_decl_line(0x85)
    3307                            .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    3308                    
    3309                    $C$DW$215       .dwtag  DW_TAG_member
    3310                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    3311                            .dwattr $C$DW$215, DW_AT_name("nSkip")
    3312                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("nSkip")
    3313                            .dwattr $C$DW$215, DW_AT_bit_offset(0x00)
    3314                            .dwattr $C$DW$215, DW_AT_bit_size(0x04)
    3315                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3316                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3317                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3318                            .dwattr $C$DW$215, DW_AT_decl_line(0x86)
    3319                            .dwattr $C$DW$215, DW_AT_decl_column(0x0f)
    3320                    
    3321                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3322                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    3323                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    3324                            .dwendtag $C$DW$T$27
    3325                    
    3326                    
    3327                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3328                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    3329                    $C$DW$216       .dwtag  DW_TAG_member
    3330                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    3331                            .dwattr $C$DW$216, DW_AT_name("triggerType")
    3332                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("triggerType")
    3333                            .dwattr $C$DW$216, DW_AT_bit_offset(0x04)
    3334                            .dwattr $C$DW$216, DW_AT_bit_size(0x04)
    3335                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3336                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3337                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3338                            .dwattr $C$DW$216, DW_AT_decl_line(0xb3)
    3339                            .dwattr $C$DW$216, DW_AT_decl_column(0x0f)
    3340                    
    3341                    $C$DW$217       .dwtag  DW_TAG_member
    3342                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    3343                            .dwattr $C$DW$217, DW_AT_name("bEnaCmd")
    3344                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("bEnaCmd")
    3345                            .dwattr $C$DW$217, DW_AT_bit_offset(0x03)
    3346                            .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    3347                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3349                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3350                            .dwattr $C$DW$217, DW_AT_decl_line(0xb4)
    3351                            .dwattr $C$DW$217, DW_AT_decl_column(0x0f)
    3352                    
    3353                    $C$DW$218       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   62

    3354                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    3355                            .dwattr $C$DW$218, DW_AT_name("triggerNo")
    3356                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("triggerNo")
    3357                            .dwattr $C$DW$218, DW_AT_bit_offset(0x01)
    3358                            .dwattr $C$DW$218, DW_AT_bit_size(0x02)
    3359                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3360                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3361                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3362                            .dwattr $C$DW$218, DW_AT_decl_line(0xb6)
    3363                            .dwattr $C$DW$218, DW_AT_decl_column(0x0f)
    3364                    
    3365                    $C$DW$219       .dwtag  DW_TAG_member
    3366                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    3367                            .dwattr $C$DW$219, DW_AT_name("pastTrig")
    3368                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("pastTrig")
    3369                            .dwattr $C$DW$219, DW_AT_bit_offset(0x00)
    3370                            .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3371                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3372                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3374                            .dwattr $C$DW$219, DW_AT_decl_line(0xb7)
    3375                            .dwattr $C$DW$219, DW_AT_decl_column(0x0f)
    3376                    
    3377                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3378                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    3379                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    3380                            .dwendtag $C$DW$T$28
    3381                    
    3382                    
    3383                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3384                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3385                    $C$DW$220       .dwtag  DW_TAG_member
    3386                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    3387                            .dwattr $C$DW$220, DW_AT_name("rule")
    3388                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("rule")
    3389                            .dwattr $C$DW$220, DW_AT_bit_offset(0x04)
    3390                            .dwattr $C$DW$220, DW_AT_bit_size(0x04)
    3391                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3392                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3393                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3394                            .dwattr $C$DW$220, DW_AT_decl_line(0xbb)
    3395                            .dwattr $C$DW$220, DW_AT_decl_column(0x0f)
    3396                    
    3397                    $C$DW$221       .dwtag  DW_TAG_member
    3398                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    3399                            .dwattr $C$DW$221, DW_AT_name("nSkip")
    3400                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("nSkip")
    3401                            .dwattr $C$DW$221, DW_AT_bit_offset(0x00)
    3402                            .dwattr $C$DW$221, DW_AT_bit_size(0x04)
    3403                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3404                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3405                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3406                            .dwattr $C$DW$221, DW_AT_decl_line(0xbc)
    3407                            .dwattr $C$DW$221, DW_AT_decl_column(0x0f)
    3408                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   63

    3409                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3410                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    3411                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3412                            .dwendtag $C$DW$T$29
    3413                    
    3414                    
    3415                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3416                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3417                    $C$DW$222       .dwtag  DW_TAG_member
    3418                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    3419                            .dwattr $C$DW$222, DW_AT_name("frontEndMode")
    3420                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("frontEndMode")
    3421                            .dwattr $C$DW$222, DW_AT_bit_offset(0x0d)
    3422                            .dwattr $C$DW$222, DW_AT_bit_size(0x03)
    3423                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3424                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3425                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3426                            .dwattr $C$DW$222, DW_AT_decl_line(0xc9)
    3427                            .dwattr $C$DW$222, DW_AT_decl_column(0x10)
    3428                    
    3429                    $C$DW$223       .dwtag  DW_TAG_member
    3430                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
    3431                            .dwattr $C$DW$223, DW_AT_name("biasMode")
    3432                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("biasMode")
    3433                            .dwattr $C$DW$223, DW_AT_bit_offset(0x0c)
    3434                            .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3435                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3436                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3437                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3438                            .dwattr $C$DW$223, DW_AT_decl_line(0xcf)
    3439                            .dwattr $C$DW$223, DW_AT_decl_column(0x10)
    3440                    
    3441                    $C$DW$224       .dwtag  DW_TAG_member
    3442                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    3443                            .dwattr $C$DW$224, DW_AT_name("analogCfgMode")
    3444                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("analogCfgMode")
    3445                            .dwattr $C$DW$224, DW_AT_bit_offset(0x06)
    3446                            .dwattr $C$DW$224, DW_AT_bit_size(0x06)
    3447                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3448                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3449                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3450                            .dwattr $C$DW$224, DW_AT_decl_line(0xd1)
    3451                            .dwattr $C$DW$224, DW_AT_decl_column(0x10)
    3452                    
    3453                    $C$DW$225       .dwtag  DW_TAG_member
    3454                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
    3455                            .dwattr $C$DW$225, DW_AT_name("bNoFsPowerUp")
    3456                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3457                            .dwattr $C$DW$225, DW_AT_bit_offset(0x05)
    3458                            .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3459                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3460                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3461                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3462                            .dwattr $C$DW$225, DW_AT_decl_line(0xd8)
    3463                            .dwattr $C$DW$225, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   64

    3464                    
    3465                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3466                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    3467                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    3468                            .dwendtag $C$DW$T$32
    3469                    
    3470                    
    3471                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3472                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3473                    $C$DW$226       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    3475                            .dwattr $C$DW$226, DW_AT_name("triggerType")
    3476                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("triggerType")
    3477                            .dwattr $C$DW$226, DW_AT_bit_offset(0x04)
    3478                            .dwattr $C$DW$226, DW_AT_bit_size(0x04)
    3479                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3480                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3481                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3482                            .dwattr $C$DW$226, DW_AT_decl_line(0x1cf)
    3483                            .dwattr $C$DW$226, DW_AT_decl_column(0x0f)
    3484                    
    3485                    $C$DW$227       .dwtag  DW_TAG_member
    3486                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    3487                            .dwattr $C$DW$227, DW_AT_name("bEnaCmd")
    3488                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("bEnaCmd")
    3489                            .dwattr $C$DW$227, DW_AT_bit_offset(0x03)
    3490                            .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    3491                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3492                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3493                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3494                            .dwattr $C$DW$227, DW_AT_decl_line(0x1d0)
    3495                            .dwattr $C$DW$227, DW_AT_decl_column(0x0f)
    3496                    
    3497                    $C$DW$228       .dwtag  DW_TAG_member
    3498                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$22)
    3499                            .dwattr $C$DW$228, DW_AT_name("triggerNo")
    3500                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("triggerNo")
    3501                            .dwattr $C$DW$228, DW_AT_bit_offset(0x01)
    3502                            .dwattr $C$DW$228, DW_AT_bit_size(0x02)
    3503                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3504                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3505                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3506                            .dwattr $C$DW$228, DW_AT_decl_line(0x1d2)
    3507                            .dwattr $C$DW$228, DW_AT_decl_column(0x0f)
    3508                    
    3509                    $C$DW$229       .dwtag  DW_TAG_member
    3510                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$22)
    3511                            .dwattr $C$DW$229, DW_AT_name("pastTrig")
    3512                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pastTrig")
    3513                            .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    3514                            .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    3515                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3516                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3517                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3518                            .dwattr $C$DW$229, DW_AT_decl_line(0x1d3)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   65

    3519                            .dwattr $C$DW$229, DW_AT_decl_column(0x0f)
    3520                    
    3521                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3522                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    3523                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    3524                            .dwendtag $C$DW$T$33
    3525                    
    3526                    
    3527                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3528                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3529                    $C$DW$230       .dwtag  DW_TAG_member
    3530                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$22)
    3531                            .dwattr $C$DW$230, DW_AT_name("rule")
    3532                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("rule")
    3533                            .dwattr $C$DW$230, DW_AT_bit_offset(0x04)
    3534                            .dwattr $C$DW$230, DW_AT_bit_size(0x04)
    3535                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3536                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3537                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3538                            .dwattr $C$DW$230, DW_AT_decl_line(0x1d7)
    3539                            .dwattr $C$DW$230, DW_AT_decl_column(0x0f)
    3540                    
    3541                    $C$DW$231       .dwtag  DW_TAG_member
    3542                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
    3543                            .dwattr $C$DW$231, DW_AT_name("nSkip")
    3544                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("nSkip")
    3545                            .dwattr $C$DW$231, DW_AT_bit_offset(0x00)
    3546                            .dwattr $C$DW$231, DW_AT_bit_size(0x04)
    3547                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3548                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3549                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3550                            .dwattr $C$DW$231, DW_AT_decl_line(0x1d8)
    3551                            .dwattr $C$DW$231, DW_AT_decl_column(0x0f)
    3552                    
    3553                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3554                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    3555                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3556                            .dwendtag $C$DW$T$34
    3557                    
    3558                    
    3559                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3560                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3561                    $C$DW$232       .dwtag  DW_TAG_member
    3562                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
    3563                            .dwattr $C$DW$232, DW_AT_name("modType")
    3564                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("modType")
    3565                            .dwattr $C$DW$232, DW_AT_bit_offset(0x0d)
    3566                            .dwattr $C$DW$232, DW_AT_bit_size(0x03)
    3567                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3568                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3569                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3570                            .dwattr $C$DW$232, DW_AT_decl_line(0x1db)
    3571                            .dwattr $C$DW$232, DW_AT_decl_column(0x10)
    3572                    
    3573                    $C$DW$233       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   66

    3574                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    3575                            .dwattr $C$DW$233, DW_AT_name("deviation")
    3576                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("deviation")
    3577                            .dwattr $C$DW$233, DW_AT_bit_offset(0x00)
    3578                            .dwattr $C$DW$233, DW_AT_bit_size(0x0d)
    3579                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3580                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3581                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3582                            .dwattr $C$DW$233, DW_AT_decl_line(0x1de)
    3583                            .dwattr $C$DW$233, DW_AT_decl_column(0x10)
    3584                    
    3585                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3586                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    3587                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3588                            .dwendtag $C$DW$T$35
    3589                    
    3590                    
    3591                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3592                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    3593                    $C$DW$234       .dwtag  DW_TAG_member
    3594                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$37)
    3595                            .dwattr $C$DW$234, DW_AT_name("preScale")
    3596                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("preScale")
    3597                            .dwattr $C$DW$234, DW_AT_bit_offset(0x1c)
    3598                            .dwattr $C$DW$234, DW_AT_bit_size(0x04)
    3599                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3600                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3601                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3602                            .dwattr $C$DW$234, DW_AT_decl_line(0x1e1)
    3603                            .dwattr $C$DW$234, DW_AT_decl_column(0x10)
    3604                    
    3605                    $C$DW$235       .dwtag  DW_TAG_member
    3606                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$37)
    3607                            .dwattr $C$DW$235, DW_AT_name("rateWord")
    3608                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("rateWord")
    3609                            .dwattr $C$DW$235, DW_AT_bit_offset(0x03)
    3610                            .dwattr $C$DW$235, DW_AT_bit_size(0x15)
    3611                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3612                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3613                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3614                            .dwattr $C$DW$235, DW_AT_decl_line(0x1e3)
    3615                            .dwattr $C$DW$235, DW_AT_decl_column(0x10)
    3616                    
    3617                    $C$DW$236       .dwtag  DW_TAG_member
    3618                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$37)
    3619                            .dwattr $C$DW$236, DW_AT_name("decimMode")
    3620                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("decimMode")
    3621                            .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    3622                            .dwattr $C$DW$236, DW_AT_bit_size(0x03)
    3623                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3624                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3625                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3626                            .dwattr $C$DW$236, DW_AT_decl_line(0x1e4)
    3627                            .dwattr $C$DW$236, DW_AT_decl_column(0x10)
    3628                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   67

    3629                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3630                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    3631                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    3632                            .dwendtag $C$DW$T$38
    3633                    
    3634                    
    3635                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3636                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3637                    $C$DW$237       .dwtag  DW_TAG_member
    3638                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
    3639                            .dwattr $C$DW$237, DW_AT_name("nPreamBytes")
    3640                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("nPreamBytes")
    3641                            .dwattr $C$DW$237, DW_AT_bit_offset(0x02)
    3642                            .dwattr $C$DW$237, DW_AT_bit_size(0x06)
    3643                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3644                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3645                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3646                            .dwattr $C$DW$237, DW_AT_decl_line(0x1ec)
    3647                            .dwattr $C$DW$237, DW_AT_decl_column(0x0f)
    3648                    
    3649                    $C$DW$238       .dwtag  DW_TAG_member
    3650                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$22)
    3651                            .dwattr $C$DW$238, DW_AT_name("preamMode")
    3652                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("preamMode")
    3653                            .dwattr $C$DW$238, DW_AT_bit_offset(0x00)
    3654                            .dwattr $C$DW$238, DW_AT_bit_size(0x02)
    3655                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3656                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3657                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3658                            .dwattr $C$DW$238, DW_AT_decl_line(0x1f2)
    3659                            .dwattr $C$DW$238, DW_AT_decl_column(0x0f)
    3660                    
    3661                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3662                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    3663                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    3664                            .dwendtag $C$DW$T$39
    3665                    
    3666                    
    3667                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3668                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    3669                    $C$DW$239       .dwtag  DW_TAG_member
    3670                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    3671                            .dwattr $C$DW$239, DW_AT_name("nSwBits")
    3672                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("nSwBits")
    3673                            .dwattr $C$DW$239, DW_AT_bit_offset(0x0a)
    3674                            .dwattr $C$DW$239, DW_AT_bit_size(0x06)
    3675                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3676                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3677                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3678                            .dwattr $C$DW$239, DW_AT_decl_line(0x1f8)
    3679                            .dwattr $C$DW$239, DW_AT_decl_column(0x10)
    3680                    
    3681                    $C$DW$240       .dwtag  DW_TAG_member
    3682                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    3683                            .dwattr $C$DW$240, DW_AT_name("bBitReversal")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   68

    3684                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("bBitReversal")
    3685                            .dwattr $C$DW$240, DW_AT_bit_offset(0x09)
    3686                            .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3687                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3688                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3689                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3690                            .dwattr $C$DW$240, DW_AT_decl_line(0x1f9)
    3691                            .dwattr $C$DW$240, DW_AT_decl_column(0x10)
    3692                    
    3693                    $C$DW$241       .dwtag  DW_TAG_member
    3694                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    3695                            .dwattr $C$DW$241, DW_AT_name("bMsbFirst")
    3696                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("bMsbFirst")
    3697                            .dwattr $C$DW$241, DW_AT_bit_offset(0x08)
    3698                            .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    3699                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3700                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3701                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3702                            .dwattr $C$DW$241, DW_AT_decl_line(0x1fb)
    3703                            .dwattr $C$DW$241, DW_AT_decl_column(0x10)
    3704                    
    3705                    $C$DW$242       .dwtag  DW_TAG_member
    3706                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    3707                            .dwattr $C$DW$242, DW_AT_name("fecMode")
    3708                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("fecMode")
    3709                            .dwattr $C$DW$242, DW_AT_bit_offset(0x04)
    3710                            .dwattr $C$DW$242, DW_AT_bit_size(0x04)
    3711                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3712                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3713                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3714                            .dwattr $C$DW$242, DW_AT_decl_line(0x1fd)
    3715                            .dwattr $C$DW$242, DW_AT_decl_column(0x10)
    3716                    
    3717                    $C$DW$243       .dwtag  DW_TAG_member
    3718                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    3719                            .dwattr $C$DW$243, DW_AT_name("whitenMode")
    3720                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("whitenMode")
    3721                            .dwattr $C$DW$243, DW_AT_bit_offset(0x00)
    3722                            .dwattr $C$DW$243, DW_AT_bit_size(0x03)
    3723                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3724                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3725                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3726                            .dwattr $C$DW$243, DW_AT_decl_line(0x203)
    3727                            .dwattr $C$DW$243, DW_AT_decl_column(0x10)
    3728                    
    3729                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3730                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
    3731                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    3732                            .dwendtag $C$DW$T$40
    3733                    
    3734                    
    3735                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3736                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3737                    $C$DW$244       .dwtag  DW_TAG_member
    3738                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   69

    3739                            .dwattr $C$DW$244, DW_AT_name("frontEndMode")
    3740                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("frontEndMode")
    3741                            .dwattr $C$DW$244, DW_AT_bit_offset(0x0d)
    3742                            .dwattr $C$DW$244, DW_AT_bit_size(0x03)
    3743                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3744                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3745                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3746                            .dwattr $C$DW$244, DW_AT_decl_line(0x20d)
    3747                            .dwattr $C$DW$244, DW_AT_decl_column(0x10)
    3748                    
    3749                    $C$DW$245       .dwtag  DW_TAG_member
    3750                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
    3751                            .dwattr $C$DW$245, DW_AT_name("biasMode")
    3752                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("biasMode")
    3753                            .dwattr $C$DW$245, DW_AT_bit_offset(0x0c)
    3754                            .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3755                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3757                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3758                            .dwattr $C$DW$245, DW_AT_decl_line(0x213)
    3759                            .dwattr $C$DW$245, DW_AT_decl_column(0x10)
    3760                    
    3761                    $C$DW$246       .dwtag  DW_TAG_member
    3762                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$31)
    3763                            .dwattr $C$DW$246, DW_AT_name("analogCfgMode")
    3764                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("analogCfgMode")
    3765                            .dwattr $C$DW$246, DW_AT_bit_offset(0x06)
    3766                            .dwattr $C$DW$246, DW_AT_bit_size(0x06)
    3767                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3768                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3769                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3770                            .dwattr $C$DW$246, DW_AT_decl_line(0x215)
    3771                            .dwattr $C$DW$246, DW_AT_decl_column(0x10)
    3772                    
    3773                    $C$DW$247       .dwtag  DW_TAG_member
    3774                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
    3775                            .dwattr $C$DW$247, DW_AT_name("bNoFsPowerUp")
    3776                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3777                            .dwattr $C$DW$247, DW_AT_bit_offset(0x05)
    3778                            .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    3779                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3780                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3781                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3782                            .dwattr $C$DW$247, DW_AT_decl_line(0x21c)
    3783                            .dwattr $C$DW$247, DW_AT_decl_column(0x10)
    3784                    
    3785                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3786                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    3787                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    3788                            .dwendtag $C$DW$T$41
    3789                    
    3790                    
    3791                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3792                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3793                    $C$DW$248       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   70

    3794                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    3795                            .dwattr $C$DW$248, DW_AT_name("triggerType")
    3796                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("triggerType")
    3797                            .dwattr $C$DW$248, DW_AT_bit_offset(0x04)
    3798                            .dwattr $C$DW$248, DW_AT_bit_size(0x04)
    3799                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3800                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3801                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3802                            .dwattr $C$DW$248, DW_AT_decl_line(0x232)
    3803                            .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    3804                    
    3805                    $C$DW$249       .dwtag  DW_TAG_member
    3806                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    3807                            .dwattr $C$DW$249, DW_AT_name("bEnaCmd")
    3808                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("bEnaCmd")
    3809                            .dwattr $C$DW$249, DW_AT_bit_offset(0x03)
    3810                            .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    3811                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3812                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3813                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3814                            .dwattr $C$DW$249, DW_AT_decl_line(0x233)
    3815                            .dwattr $C$DW$249, DW_AT_decl_column(0x0f)
    3816                    
    3817                    $C$DW$250       .dwtag  DW_TAG_member
    3818                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    3819                            .dwattr $C$DW$250, DW_AT_name("triggerNo")
    3820                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("triggerNo")
    3821                            .dwattr $C$DW$250, DW_AT_bit_offset(0x01)
    3822                            .dwattr $C$DW$250, DW_AT_bit_size(0x02)
    3823                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3824                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3825                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3826                            .dwattr $C$DW$250, DW_AT_decl_line(0x235)
    3827                            .dwattr $C$DW$250, DW_AT_decl_column(0x0f)
    3828                    
    3829                    $C$DW$251       .dwtag  DW_TAG_member
    3830                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    3831                            .dwattr $C$DW$251, DW_AT_name("pastTrig")
    3832                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("pastTrig")
    3833                            .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3834                            .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    3835                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3836                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3837                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3838                            .dwattr $C$DW$251, DW_AT_decl_line(0x236)
    3839                            .dwattr $C$DW$251, DW_AT_decl_column(0x0f)
    3840                    
    3841                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3842                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    3843                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3844                            .dwendtag $C$DW$T$42
    3845                    
    3846                    
    3847                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3848                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   71

    3849                    $C$DW$252       .dwtag  DW_TAG_member
    3850                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    3851                            .dwattr $C$DW$252, DW_AT_name("rule")
    3852                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("rule")
    3853                            .dwattr $C$DW$252, DW_AT_bit_offset(0x04)
    3854                            .dwattr $C$DW$252, DW_AT_bit_size(0x04)
    3855                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3856                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3857                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3858                            .dwattr $C$DW$252, DW_AT_decl_line(0x23a)
    3859                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    3860                    
    3861                    $C$DW$253       .dwtag  DW_TAG_member
    3862                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    3863                            .dwattr $C$DW$253, DW_AT_name("nSkip")
    3864                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("nSkip")
    3865                            .dwattr $C$DW$253, DW_AT_bit_offset(0x00)
    3866                            .dwattr $C$DW$253, DW_AT_bit_size(0x04)
    3867                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3868                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3869                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3870                            .dwattr $C$DW$253, DW_AT_decl_line(0x23b)
    3871                            .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    3872                    
    3873                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3874                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    3875                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    3876                            .dwendtag $C$DW$T$43
    3877                    
    3878                    
    3879                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3880                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3881                    $C$DW$254       .dwtag  DW_TAG_member
    3882                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$31)
    3883                            .dwattr $C$DW$254, DW_AT_name("modType")
    3884                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("modType")
    3885                            .dwattr $C$DW$254, DW_AT_bit_offset(0x0d)
    3886                            .dwattr $C$DW$254, DW_AT_bit_size(0x03)
    3887                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3888                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3890                            .dwattr $C$DW$254, DW_AT_decl_line(0x23e)
    3891                            .dwattr $C$DW$254, DW_AT_decl_column(0x10)
    3892                    
    3893                    $C$DW$255       .dwtag  DW_TAG_member
    3894                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$31)
    3895                            .dwattr $C$DW$255, DW_AT_name("deviation")
    3896                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("deviation")
    3897                            .dwattr $C$DW$255, DW_AT_bit_offset(0x00)
    3898                            .dwattr $C$DW$255, DW_AT_bit_size(0x0d)
    3899                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3900                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3901                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3902                            .dwattr $C$DW$255, DW_AT_decl_line(0x241)
    3903                            .dwattr $C$DW$255, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   72

    3904                    
    3905                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3906                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    3907                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    3908                            .dwendtag $C$DW$T$44
    3909                    
    3910                    
    3911                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3912                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    3913                    $C$DW$256       .dwtag  DW_TAG_member
    3914                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$37)
    3915                            .dwattr $C$DW$256, DW_AT_name("preScale")
    3916                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("preScale")
    3917                            .dwattr $C$DW$256, DW_AT_bit_offset(0x1c)
    3918                            .dwattr $C$DW$256, DW_AT_bit_size(0x04)
    3919                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3920                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3921                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3922                            .dwattr $C$DW$256, DW_AT_decl_line(0x244)
    3923                            .dwattr $C$DW$256, DW_AT_decl_column(0x10)
    3924                    
    3925                    $C$DW$257       .dwtag  DW_TAG_member
    3926                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$37)
    3927                            .dwattr $C$DW$257, DW_AT_name("rateWord")
    3928                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("rateWord")
    3929                            .dwattr $C$DW$257, DW_AT_bit_offset(0x03)
    3930                            .dwattr $C$DW$257, DW_AT_bit_size(0x15)
    3931                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3932                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3933                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3934                            .dwattr $C$DW$257, DW_AT_decl_line(0x246)
    3935                            .dwattr $C$DW$257, DW_AT_decl_column(0x10)
    3936                    
    3937                    $C$DW$258       .dwtag  DW_TAG_member
    3938                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$37)
    3939                            .dwattr $C$DW$258, DW_AT_name("decimMode")
    3940                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("decimMode")
    3941                            .dwattr $C$DW$258, DW_AT_bit_offset(0x00)
    3942                            .dwattr $C$DW$258, DW_AT_bit_size(0x03)
    3943                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3944                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3945                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3946                            .dwattr $C$DW$258, DW_AT_decl_line(0x247)
    3947                            .dwattr $C$DW$258, DW_AT_decl_column(0x10)
    3948                    
    3949                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3950                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
    3951                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    3952                            .dwendtag $C$DW$T$45
    3953                    
    3954                    
    3955                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3956                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    3957                    $C$DW$259       .dwtag  DW_TAG_member
    3958                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   73

    3959                            .dwattr $C$DW$259, DW_AT_name("nPreamBytes")
    3960                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("nPreamBytes")
    3961                            .dwattr $C$DW$259, DW_AT_bit_offset(0x02)
    3962                            .dwattr $C$DW$259, DW_AT_bit_size(0x06)
    3963                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3964                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3965                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3966                            .dwattr $C$DW$259, DW_AT_decl_line(0x24f)
    3967                            .dwattr $C$DW$259, DW_AT_decl_column(0x0f)
    3968                    
    3969                    $C$DW$260       .dwtag  DW_TAG_member
    3970                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$22)
    3971                            .dwattr $C$DW$260, DW_AT_name("preamMode")
    3972                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("preamMode")
    3973                            .dwattr $C$DW$260, DW_AT_bit_offset(0x00)
    3974                            .dwattr $C$DW$260, DW_AT_bit_size(0x02)
    3975                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3976                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3977                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3978                            .dwattr $C$DW$260, DW_AT_decl_line(0x255)
    3979                            .dwattr $C$DW$260, DW_AT_decl_column(0x0f)
    3980                    
    3981                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    3982                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    3983                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    3984                            .dwendtag $C$DW$T$46
    3985                    
    3986                    
    3987                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3988                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3989                    $C$DW$261       .dwtag  DW_TAG_member
    3990                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
    3991                            .dwattr $C$DW$261, DW_AT_name("nSwBits")
    3992                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("nSwBits")
    3993                            .dwattr $C$DW$261, DW_AT_bit_offset(0x0a)
    3994                            .dwattr $C$DW$261, DW_AT_bit_size(0x06)
    3995                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3996                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3997                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    3998                            .dwattr $C$DW$261, DW_AT_decl_line(0x25b)
    3999                            .dwattr $C$DW$261, DW_AT_decl_column(0x10)
    4000                    
    4001                    $C$DW$262       .dwtag  DW_TAG_member
    4002                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
    4003                            .dwattr $C$DW$262, DW_AT_name("bBitReversal")
    4004                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("bBitReversal")
    4005                            .dwattr $C$DW$262, DW_AT_bit_offset(0x09)
    4006                            .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    4007                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4008                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4009                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4010                            .dwattr $C$DW$262, DW_AT_decl_line(0x25c)
    4011                            .dwattr $C$DW$262, DW_AT_decl_column(0x10)
    4012                    
    4013                    $C$DW$263       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   74

    4014                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
    4015                            .dwattr $C$DW$263, DW_AT_name("bMsbFirst")
    4016                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("bMsbFirst")
    4017                            .dwattr $C$DW$263, DW_AT_bit_offset(0x08)
    4018                            .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    4019                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4020                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4021                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4022                            .dwattr $C$DW$263, DW_AT_decl_line(0x25e)
    4023                            .dwattr $C$DW$263, DW_AT_decl_column(0x10)
    4024                    
    4025                    $C$DW$264       .dwtag  DW_TAG_member
    4026                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
    4027                            .dwattr $C$DW$264, DW_AT_name("fecMode")
    4028                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("fecMode")
    4029                            .dwattr $C$DW$264, DW_AT_bit_offset(0x04)
    4030                            .dwattr $C$DW$264, DW_AT_bit_size(0x04)
    4031                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4032                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4033                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4034                            .dwattr $C$DW$264, DW_AT_decl_line(0x260)
    4035                            .dwattr $C$DW$264, DW_AT_decl_column(0x10)
    4036                    
    4037                    $C$DW$265       .dwtag  DW_TAG_member
    4038                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$31)
    4039                            .dwattr $C$DW$265, DW_AT_name("whitenMode")
    4040                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("whitenMode")
    4041                            .dwattr $C$DW$265, DW_AT_bit_offset(0x00)
    4042                            .dwattr $C$DW$265, DW_AT_bit_size(0x03)
    4043                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4044                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4045                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4046                            .dwattr $C$DW$265, DW_AT_decl_line(0x266)
    4047                            .dwattr $C$DW$265, DW_AT_decl_column(0x10)
    4048                    
    4049                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    4050                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    4051                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    4052                            .dwendtag $C$DW$T$47
    4053                    
    4054                    
    4055                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4056                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    4057                    $C$DW$266       .dwtag  DW_TAG_member
    4058                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$31)
    4059                            .dwattr $C$DW$266, DW_AT_name("frontEndMode")
    4060                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("frontEndMode")
    4061                            .dwattr $C$DW$266, DW_AT_bit_offset(0x0d)
    4062                            .dwattr $C$DW$266, DW_AT_bit_size(0x03)
    4063                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4064                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4065                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4066                            .dwattr $C$DW$266, DW_AT_decl_line(0x270)
    4067                            .dwattr $C$DW$266, DW_AT_decl_column(0x10)
    4068                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   75

    4069                    $C$DW$267       .dwtag  DW_TAG_member
    4070                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$31)
    4071                            .dwattr $C$DW$267, DW_AT_name("biasMode")
    4072                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("biasMode")
    4073                            .dwattr $C$DW$267, DW_AT_bit_offset(0x0c)
    4074                            .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    4075                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4076                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4077                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4078                            .dwattr $C$DW$267, DW_AT_decl_line(0x276)
    4079                            .dwattr $C$DW$267, DW_AT_decl_column(0x10)
    4080                    
    4081                    $C$DW$268       .dwtag  DW_TAG_member
    4082                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$31)
    4083                            .dwattr $C$DW$268, DW_AT_name("analogCfgMode")
    4084                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("analogCfgMode")
    4085                            .dwattr $C$DW$268, DW_AT_bit_offset(0x06)
    4086                            .dwattr $C$DW$268, DW_AT_bit_size(0x06)
    4087                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4088                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4089                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4090                            .dwattr $C$DW$268, DW_AT_decl_line(0x278)
    4091                            .dwattr $C$DW$268, DW_AT_decl_column(0x10)
    4092                    
    4093                    $C$DW$269       .dwtag  DW_TAG_member
    4094                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$31)
    4095                            .dwattr $C$DW$269, DW_AT_name("bNoFsPowerUp")
    4096                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("bNoFsPowerUp")
    4097                            .dwattr $C$DW$269, DW_AT_bit_offset(0x05)
    4098                            .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    4099                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4100                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4101                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4102                            .dwattr $C$DW$269, DW_AT_decl_line(0x27f)
    4103                            .dwattr $C$DW$269, DW_AT_decl_column(0x10)
    4104                    
    4105                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    4106                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    4107                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    4108                            .dwendtag $C$DW$T$48
    4109                    
    4110                    
    4111                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4112                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    4113                    $C$DW$270       .dwtag  DW_TAG_member
    4114                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$37)
    4115                            .dwattr $C$DW$270, DW_AT_name("nInactivityTimeout")
    4116                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("nInactivityTimeout")
    4117                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4118                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4119                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4120                            .dwattr $C$DW$270, DW_AT_decl_line(0x50e)
    4121                            .dwattr $C$DW$270, DW_AT_decl_column(0x1d)
    4122                    
    4123                    $C$DW$271       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   76

    4124                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$50)
    4125                            .dwattr $C$DW$271, DW_AT_name("pRfMode")
    4126                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("pRfMode")
    4127                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4128                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4129                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4130                            .dwattr $C$DW$271, DW_AT_decl_line(0x50f)
    4131                            .dwattr $C$DW$271, DW_AT_decl_column(0x1d)
    4132                    
    4133                    $C$DW$272       .dwtag  DW_TAG_member
    4134                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$52)
    4135                            .dwattr $C$DW$272, DW_AT_name("pOpSetup")
    4136                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("pOpSetup")
    4137                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4138                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4139                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4140                            .dwattr $C$DW$272, DW_AT_decl_line(0x510)
    4141                            .dwattr $C$DW$272, DW_AT_decl_column(0x1d)
    4142                    
    4143                    $C$DW$273       .dwtag  DW_TAG_member
    4144                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$37)
    4145                            .dwattr $C$DW$273, DW_AT_name("nPowerUpDuration")
    4146                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("nPowerUpDuration")
    4147                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4148                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4149                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4150                            .dwattr $C$DW$273, DW_AT_decl_line(0x511)
    4151                            .dwattr $C$DW$273, DW_AT_decl_column(0x1d)
    4152                    
    4153                    $C$DW$274       .dwtag  DW_TAG_member
    4154                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$53)
    4155                            .dwattr $C$DW$274, DW_AT_name("bMeasurePowerUpDuration")
    4156                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    4157                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4158                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4159                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4160                            .dwattr $C$DW$274, DW_AT_decl_line(0x512)
    4161                            .dwattr $C$DW$274, DW_AT_decl_column(0x1d)
    4162                    
    4163                    $C$DW$275       .dwtag  DW_TAG_member
    4164                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$53)
    4165                            .dwattr $C$DW$275, DW_AT_name("bUpdateSetup")
    4166                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("bUpdateSetup")
    4167                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4168                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4169                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4170                            .dwattr $C$DW$275, DW_AT_decl_line(0x513)
    4171                            .dwattr $C$DW$275, DW_AT_decl_column(0x1d)
    4172                    
    4173                    $C$DW$276       .dwtag  DW_TAG_member
    4174                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$31)
    4175                            .dwattr $C$DW$276, DW_AT_name("nPowerUpDurationMargin")
    4176                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    4177                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4178                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   77

    4179                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4180                            .dwattr $C$DW$276, DW_AT_decl_line(0x514)
    4181                            .dwattr $C$DW$276, DW_AT_decl_column(0x1d)
    4182                    
    4183                    $C$DW$277       .dwtag  DW_TAG_member
    4184                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$3)
    4185                            .dwattr $C$DW$277, DW_AT_name("pPowerCb")
    4186                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pPowerCb")
    4187                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4188                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4189                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4190                            .dwattr $C$DW$277, DW_AT_decl_line(0x515)
    4191                            .dwattr $C$DW$277, DW_AT_decl_column(0x1d)
    4192                    
    4193                    $C$DW$278       .dwtag  DW_TAG_member
    4194                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$3)
    4195                            .dwattr $C$DW$278, DW_AT_name("pErrCb")
    4196                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("pErrCb")
    4197                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4198                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4199                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4200                            .dwattr $C$DW$278, DW_AT_decl_line(0x516)
    4201                            .dwattr $C$DW$278, DW_AT_decl_column(0x1d)
    4202                    
    4203                    $C$DW$279       .dwtag  DW_TAG_member
    4204                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$3)
    4205                            .dwattr $C$DW$279, DW_AT_name("pClientEventCb")
    4206                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("pClientEventCb")
    4207                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4208                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4209                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4210                            .dwattr $C$DW$279, DW_AT_decl_line(0x517)
    4211                            .dwattr $C$DW$279, DW_AT_decl_column(0x1d)
    4212                    
    4213                    $C$DW$280       .dwtag  DW_TAG_member
    4214                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$54)
    4215                            .dwattr $C$DW$280, DW_AT_name("nClientEventMask")
    4216                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("nClientEventMask")
    4217                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4218                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4219                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4220                            .dwattr $C$DW$280, DW_AT_decl_line(0x518)
    4221                            .dwattr $C$DW$280, DW_AT_decl_column(0x1d)
    4222                    
    4223                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4224                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x50d)
    4225                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
    4226                            .dwendtag $C$DW$T$55
    4227                    
    4228                    
    4229                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4230                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    4231                    $C$DW$281       .dwtag  DW_TAG_member
    4232                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
    4233                            .dwattr $C$DW$281, DW_AT_name("triggerType")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{A6F92F7E-DD41-45F3-814E-9C6B0A6E96A4} PAGE   78

    4234                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("triggerType")
    4235                            .dwattr $C$DW$281, DW_AT_bit_offset(0x04)
    4236                            .dwattr $C$DW$281, DW_AT_bit_size(0x04)
    4237                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4238                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4239                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4240                            .dwattr $C$DW$281, DW_AT_decl_line(0xee)
    4241                            .dwattr $C$DW$281, DW_AT_decl_column(0x0f)
    4242                    
    4243                    $C$DW$282       .dwtag  DW_TAG_member
    4244                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    4245                            .dwattr $C$DW$282, DW_AT_name("bEnaCmd")
    4246                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("bEnaCmd")
    4247                            .dwattr $C$DW$282, DW_AT_bit_offset(0x03)
    4248                            .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    4249                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4250                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4251                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4252                            .dwattr $C$DW$282, DW_AT_decl_line(0xef)
    4253                            .dwattr $C$DW$282, DW_AT_decl_column(0x0f)
    4254                    
    4255                    $C$DW$283       .dwtag  DW_TAG_member
    4256                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$22)
    4257                            .dwattr $C$DW$283, DW_AT_name("triggerNo")
    4258                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("triggerNo")
    4259                            .dwattr $C$DW$283, DW_AT_bit_offset(0x01)
    4260                            .dwattr $C$DW$283, DW_AT_bit_size(0x02)
    4261                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4262                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4263                            .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4264                            .dwattr $C$DW$283, DW_AT_decl_line(0xf1)
    4265                            .dwattr $C$DW$283, DW_AT_decl_column(0x0f)
    4266                    
    4267                    $C$DW$284       .dwtag  DW_TAG_member
    4268                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
    4269                            .dwattr $C$DW$284, DW_AT_name("pastTrig")
    4270                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("pastTrig")
    4271                            .dwattr $C$DW$284, DW_AT_bit_offset(0x00)
    4272                            .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    4273                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4274                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4275                            .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4276                            .dwattr $C$DW$284, DW_AT_decl_line(0xf2)
    4277                            .dwattr $C$DW$284, DW_AT_decl_column(0x0f)
    4278                    
    4279                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    4280                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
    4281                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    4282                            .dwendtag $C$DW$T$56
    4283                    
    4284                    
    4285                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4286                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    4287                    $C$DW$285       .dwtag  DW_TAG_member
    4288                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
