TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:18 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/hmac_global.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                            .global macBeaconCoordAction1
      14                            .common macBeaconCoordAction1,8,4

    5936                            .dwattr $C$DW$497, DW_AT_decl_column(0x05)
    5937                    
    5938                    $C$DW$498       .dwtag  DW_TAG_enumerator
    5939                            .dwattr $C$DW$498, DW_AT_name("RF_AllowDelayAny")
    5940                            .dwattr $C$DW$498, DW_AT_const_value(-1)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  109

    5941                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5942                            .dwattr $C$DW$498, DW_AT_decl_line(0x5e7)
    5943                            .dwattr $C$DW$498, DW_AT_decl_column(0x05)
    5944                    
    5945                            .dwattr $C$DW$T$1115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    5946                            .dwattr $C$DW$T$1115, DW_AT_decl_line(0x5e5)
    5947                            .dwattr $C$DW$T$1115, DW_AT_decl_column(0x0e)
    5948                            .dwendtag $C$DW$T$1115
    5949                    
    5950                    $C$DW$T$1116    .dwtag  DW_TAG_typedef
    5951                            .dwattr $C$DW$T$1116, DW_AT_name("RF_AllowDelay")
    5952                            .dwattr $C$DW$T$1116, DW_AT_type(*$C$DW$T$1115)
    5953                            .dwattr $C$DW$T$1116, DW_AT_language(DW_LANG_C)
    5954                            .dwattr $C$DW$T$1116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    5955                            .dwattr $C$DW$T$1116, DW_AT_decl_line(0x5e8)
    5956                            .dwattr $C$DW$T$1116, DW_AT_decl_column(0x03)
    5957                    
    5958                    
    5959                    $C$DW$T$1117    .dwtag  DW_TAG_enumeration_type
    5960                            .dwattr $C$DW$T$1117, DW_AT_byte_size(0x01)
    5961                    $C$DW$499       .dwtag  DW_TAG_enumerator
    5962                            .dwattr $C$DW$499, DW_AT_name("RF_RatChannelAny")
    5963                            .dwattr $C$DW$499, DW_AT_const_value(-1)
    5964                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5965                            .dwattr $C$DW$499, DW_AT_decl_line(0x608)
    5966                            .dwattr $C$DW$499, DW_AT_decl_column(0x05)
    5967                    
    5968                    $C$DW$500       .dwtag  DW_TAG_enumerator
    5969                            .dwattr $C$DW$500, DW_AT_name("RF_RatChannel0")
    5970                            .dwattr $C$DW$500, DW_AT_const_value(0x00)
    5971                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5972                            .dwattr $C$DW$500, DW_AT_decl_line(0x609)
    5973                            .dwattr $C$DW$500, DW_AT_decl_column(0x05)
    5974                    
    5975                    $C$DW$501       .dwtag  DW_TAG_enumerator
    5976                            .dwattr $C$DW$501, DW_AT_name("RF_RatChannel1")
    5977                            .dwattr $C$DW$501, DW_AT_const_value(0x01)
    5978                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5979                            .dwattr $C$DW$501, DW_AT_decl_line(0x60a)
    5980                            .dwattr $C$DW$501, DW_AT_decl_column(0x05)
    5981                    
    5982                    $C$DW$502       .dwtag  DW_TAG_enumerator
    5983                            .dwattr $C$DW$502, DW_AT_name("RF_RatChannel2")
    5984                            .dwattr $C$DW$502, DW_AT_const_value(0x02)
    5985                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5986                            .dwattr $C$DW$502, DW_AT_decl_line(0x60b)
    5987                            .dwattr $C$DW$502, DW_AT_decl_column(0x05)
    5988                    
    5989                            .dwattr $C$DW$T$1117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    5990                            .dwattr $C$DW$T$1117, DW_AT_decl_line(0x607)
    5991                            .dwattr $C$DW$T$1117, DW_AT_decl_column(0x0e)
    5992                            .dwendtag $C$DW$T$1117
    5993                    
    5994                    $C$DW$T$1118    .dwtag  DW_TAG_typedef
    5995                            .dwattr $C$DW$T$1118, DW_AT_name("RF_RatSelectChannel")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  110

    5996                            .dwattr $C$DW$T$1118, DW_AT_type(*$C$DW$T$1117)
    5997                            .dwattr $C$DW$T$1118, DW_AT_language(DW_LANG_C)
    5998                            .dwattr $C$DW$T$1118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/driver
    5999                            .dwattr $C$DW$T$1118, DW_AT_decl_line(0x60c)
    6000                            .dwattr $C$DW$T$1118, DW_AT_decl_column(0x03)
    6001                    
    6002                    
    6003                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6004                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    6005                    $C$DW$503       .dwtag  DW_TAG_member
    6006                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$21)
    6007                            .dwattr $C$DW$503, DW_AT_name("event")
    6008                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("event")
    6009                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6010                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6011                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6012                            .dwattr $C$DW$503, DW_AT_decl_line(0x2b6)
    6013                            .dwattr $C$DW$503, DW_AT_decl_column(0x0b)
    6014                    
    6015                    $C$DW$504       .dwtag  DW_TAG_member
    6016                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
    6017                            .dwattr $C$DW$504, DW_AT_name("status")
    6018                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("status")
    6019                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6020                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6021                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6022                            .dwattr $C$DW$504, DW_AT_decl_line(0x2b7)
    6023                            .dwattr $C$DW$504, DW_AT_decl_column(0x0b)
    6024                    
    6025                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6026                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b5)
    6027                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    6028                            .dwendtag $C$DW$T$22
    6029                    
    6030                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    6031                            .dwattr $C$DW$T$38, DW_AT_name("macEventHdr_t")
    6032                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
    6033                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6034                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6035                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2b8)
    6036                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    6037                    
    6038                    
    6039                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6040                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    6041                    $C$DW$505       .dwtag  DW_TAG_member
    6042                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$474)
    6043                            .dwattr $C$DW$505, DW_AT_name("addr")
    6044                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("addr")
    6045                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6046                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6047                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    6048                            .dwattr $C$DW$505, DW_AT_decl_line(0x4db)
    6049                            .dwattr $C$DW$505, DW_AT_decl_column(0x07)
    6050                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  111

    6051                    $C$DW$506       .dwtag  DW_TAG_member
    6052                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$24)
    6053                            .dwattr $C$DW$506, DW_AT_name("addrMode")
    6054                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("addrMode")
    6055                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6056                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6057                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    6058                            .dwattr $C$DW$506, DW_AT_decl_line(0x4de)
    6059                            .dwattr $C$DW$506, DW_AT_decl_column(0x17)
    6060                    
    6061                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    6062                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4d0)
    6063                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6064                            .dwendtag $C$DW$T$25
    6065                    
    6066                    $C$DW$T$705     .dwtag  DW_TAG_typedef
    6067                            .dwattr $C$DW$T$705, DW_AT_name("ApiMac_sAddr_t")
    6068                            .dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$25)
    6069                            .dwattr $C$DW$T$705, DW_AT_language(DW_LANG_C)
    6070                            .dwattr $C$DW$T$705, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    6071                            .dwattr $C$DW$T$705, DW_AT_decl_line(0x4df)
    6072                            .dwattr $C$DW$T$705, DW_AT_decl_column(0x03)
    6073                    
    6074                    
    6075                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6076                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    6077                    $C$DW$507       .dwtag  DW_TAG_member
    6078                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$475)
    6079                            .dwattr $C$DW$507, DW_AT_name("addr")
    6080                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("addr")
    6081                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6082                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6083                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sadd
    6084                            .dwattr $C$DW$507, DW_AT_decl_line(0x55)
    6085                            .dwattr $C$DW$507, DW_AT_decl_column(0x05)
    6086                    
    6087                    $C$DW$508       .dwtag  DW_TAG_member
    6088                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$27)
    6089                            .dwattr $C$DW$508, DW_AT_name("addrMode")
    6090                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("addrMode")
    6091                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6092                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6093                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sadd
    6094                            .dwattr $C$DW$508, DW_AT_decl_line(0x56)
    6095                            .dwattr $C$DW$508, DW_AT_decl_column(0x13)
    6096                    
    6097                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sad
    6098                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x50)
    6099                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    6100                            .dwendtag $C$DW$T$28
    6101                    
    6102                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    6103                            .dwattr $C$DW$T$29, DW_AT_name("sAddr_t")
    6104                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    6105                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  112

    6106                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sad
    6107                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x57)
    6108                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    6109                    
    6110                    
    6111                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6112                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x24)
    6113                    $C$DW$509       .dwtag  DW_TAG_member
    6114                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$29)
    6115                            .dwattr $C$DW$509, DW_AT_name("coordAddress")
    6116                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("coordAddress")
    6117                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6118                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6119                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6120                            .dwattr $C$DW$509, DW_AT_decl_line(0x3e1)
    6121                            .dwattr $C$DW$509, DW_AT_decl_column(0x11)
    6122                    
    6123                    $C$DW$510       .dwtag  DW_TAG_member
    6124                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$30)
    6125                            .dwattr $C$DW$510, DW_AT_name("coordPanId")
    6126                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("coordPanId")
    6127                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6128                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6129                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6130                            .dwattr $C$DW$510, DW_AT_decl_line(0x3e2)
    6131                            .dwattr $C$DW$510, DW_AT_decl_column(0x11)
    6132                    
    6133                    $C$DW$511       .dwtag  DW_TAG_member
    6134                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$30)
    6135                            .dwattr $C$DW$511, DW_AT_name("superframeSpec")
    6136                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("superframeSpec")
    6137                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6138                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6139                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6140                            .dwattr $C$DW$511, DW_AT_decl_line(0x3e3)
    6141                            .dwattr $C$DW$511, DW_AT_decl_column(0x11)
    6142                    
    6143                    $C$DW$512       .dwtag  DW_TAG_member
    6144                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$21)
    6145                            .dwattr $C$DW$512, DW_AT_name("logicalChannel")
    6146                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("logicalChannel")
    6147                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6148                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6149                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6150                            .dwattr $C$DW$512, DW_AT_decl_line(0x3e4)
    6151                            .dwattr $C$DW$512, DW_AT_decl_column(0x11)
    6152                    
    6153                    $C$DW$513       .dwtag  DW_TAG_member
    6154                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$21)
    6155                            .dwattr $C$DW$513, DW_AT_name("channelPage")
    6156                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("channelPage")
    6157                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6158                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6159                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6160                            .dwattr $C$DW$513, DW_AT_decl_line(0x3e5)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  113

    6161                            .dwattr $C$DW$513, DW_AT_decl_column(0x11)
    6162                    
    6163                    $C$DW$514       .dwtag  DW_TAG_member
    6164                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$31)
    6165                            .dwattr $C$DW$514, DW_AT_name("gtsPermit")
    6166                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("gtsPermit")
    6167                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6168                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6169                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6170                            .dwattr $C$DW$514, DW_AT_decl_line(0x3e6)
    6171                            .dwattr $C$DW$514, DW_AT_decl_column(0x11)
    6172                    
    6173                    $C$DW$515       .dwtag  DW_TAG_member
    6174                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$21)
    6175                            .dwattr $C$DW$515, DW_AT_name("linkQuality")
    6176                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("linkQuality")
    6177                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6178                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6179                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6180                            .dwattr $C$DW$515, DW_AT_decl_line(0x3e7)
    6181                            .dwattr $C$DW$515, DW_AT_decl_column(0x11)
    6182                    
    6183                    $C$DW$516       .dwtag  DW_TAG_member
    6184                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$32)
    6185                            .dwattr $C$DW$516, DW_AT_name("timestamp")
    6186                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("timestamp")
    6187                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6188                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6189                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6190                            .dwattr $C$DW$516, DW_AT_decl_line(0x3e8)
    6191                            .dwattr $C$DW$516, DW_AT_decl_column(0x11)
    6192                    
    6193                    $C$DW$517       .dwtag  DW_TAG_member
    6194                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$31)
    6195                            .dwattr $C$DW$517, DW_AT_name("securityFailure")
    6196                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("securityFailure")
    6197                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6198                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6199                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6200                            .dwattr $C$DW$517, DW_AT_decl_line(0x3e9)
    6201                            .dwattr $C$DW$517, DW_AT_decl_column(0x11)
    6202                    
    6203                    $C$DW$518       .dwtag  DW_TAG_member
    6204                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$33)
    6205                            .dwattr $C$DW$518, DW_AT_name("sec")
    6206                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("sec")
    6207                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6208                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6209                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6210                            .dwattr $C$DW$518, DW_AT_decl_line(0x3ea)
    6211                            .dwattr $C$DW$518, DW_AT_decl_column(0x11)
    6212                    
    6213                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6214                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e0)
    6215                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  114

    6216                            .dwendtag $C$DW$T$34
    6217                    
    6218                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    6219                            .dwattr $C$DW$T$76, DW_AT_name("macPanDesc_t")
    6220                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$34)
    6221                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6222                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6223                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3eb)
    6224                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6225                    
    6226                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    6227                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    6228                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    6229                    
    6230                    
    6231                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6232                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x2c)
    6233                    $C$DW$519       .dwtag  DW_TAG_member
    6234                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$35)
    6235                            .dwattr $C$DW$519, DW_AT_name("scanChannels")
    6236                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("scanChannels")
    6237                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6238                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6239                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6240                            .dwattr $C$DW$519, DW_AT_decl_line(0x421)
    6241                            .dwattr $C$DW$519, DW_AT_decl_column(0x14)
    6242                    
    6243                    $C$DW$520       .dwtag  DW_TAG_member
    6244                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$21)
    6245                            .dwattr $C$DW$520, DW_AT_name("scanType")
    6246                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("scanType")
    6247                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6248                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6249                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6250                            .dwattr $C$DW$520, DW_AT_decl_line(0x422)
    6251                            .dwattr $C$DW$520, DW_AT_decl_column(0x14)
    6252                    
    6253                    $C$DW$521       .dwtag  DW_TAG_member
    6254                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$21)
    6255                            .dwattr $C$DW$521, DW_AT_name("scanDuration")
    6256                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("scanDuration")
    6257                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6258                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6259                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6260                            .dwattr $C$DW$521, DW_AT_decl_line(0x423)
    6261                            .dwattr $C$DW$521, DW_AT_decl_column(0x14)
    6262                    
    6263                    $C$DW$522       .dwtag  DW_TAG_member
    6264                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$21)
    6265                            .dwattr $C$DW$522, DW_AT_name("channelPage")
    6266                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("channelPage")
    6267                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6268                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6269                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6270                            .dwattr $C$DW$522, DW_AT_decl_line(0x424)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  115

    6271                            .dwattr $C$DW$522, DW_AT_decl_column(0x14)
    6272                    
    6273                    $C$DW$523       .dwtag  DW_TAG_member
    6274                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$21)
    6275                            .dwattr $C$DW$523, DW_AT_name("phyID")
    6276                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("phyID")
    6277                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6278                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6279                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6280                            .dwattr $C$DW$523, DW_AT_decl_line(0x425)
    6281                            .dwattr $C$DW$523, DW_AT_decl_column(0x14)
    6282                    
    6283                    $C$DW$524       .dwtag  DW_TAG_member
    6284                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$21)
    6285                            .dwattr $C$DW$524, DW_AT_name("maxResults")
    6286                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("maxResults")
    6287                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6288                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6289                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6290                            .dwattr $C$DW$524, DW_AT_decl_line(0x426)
    6291                            .dwattr $C$DW$524, DW_AT_decl_column(0x14)
    6292                    
    6293                    $C$DW$525       .dwtag  DW_TAG_member
    6294                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$31)
    6295                            .dwattr $C$DW$525, DW_AT_name("permitJoining")
    6296                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("permitJoining")
    6297                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6298                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6299                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6300                            .dwattr $C$DW$525, DW_AT_decl_line(0x427)
    6301                            .dwattr $C$DW$525, DW_AT_decl_column(0x14)
    6302                    
    6303                    $C$DW$526       .dwtag  DW_TAG_member
    6304                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$21)
    6305                            .dwattr $C$DW$526, DW_AT_name("linkQuality")
    6306                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("linkQuality")
    6307                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6308                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6309                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6310                            .dwattr $C$DW$526, DW_AT_decl_line(0x429)
    6311                            .dwattr $C$DW$526, DW_AT_decl_column(0x14)
    6312                    
    6313                    $C$DW$527       .dwtag  DW_TAG_member
    6314                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$21)
    6315                            .dwattr $C$DW$527, DW_AT_name("percentFilter")
    6316                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("percentFilter")
    6317                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6318                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6319                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6320                            .dwattr $C$DW$527, DW_AT_decl_line(0x42b)
    6321                            .dwattr $C$DW$527, DW_AT_decl_column(0x14)
    6322                    
    6323                    $C$DW$528       .dwtag  DW_TAG_member
    6324                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$33)
    6325                            .dwattr $C$DW$528, DW_AT_name("sec")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  116

    6326                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("sec")
    6327                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6328                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6329                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6330                            .dwattr $C$DW$528, DW_AT_decl_line(0x42e)
    6331                            .dwattr $C$DW$528, DW_AT_decl_column(0x14)
    6332                    
    6333                    $C$DW$529       .dwtag  DW_TAG_member
    6334                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$31)
    6335                            .dwattr $C$DW$529, DW_AT_name("MPMScan")
    6336                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("MPMScan")
    6337                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6338                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6339                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6340                            .dwattr $C$DW$529, DW_AT_decl_line(0x42f)
    6341                            .dwattr $C$DW$529, DW_AT_decl_column(0x14)
    6342                    
    6343                    $C$DW$530       .dwtag  DW_TAG_member
    6344                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$21)
    6345                            .dwattr $C$DW$530, DW_AT_name("MPMScanType")
    6346                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("MPMScanType")
    6347                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6348                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6349                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6350                            .dwattr $C$DW$530, DW_AT_decl_line(0x431)
    6351                            .dwattr $C$DW$530, DW_AT_decl_column(0x14)
    6352                    
    6353                    $C$DW$531       .dwtag  DW_TAG_member
    6354                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$30)
    6355                            .dwattr $C$DW$531, DW_AT_name("MPMScanDuration")
    6356                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("MPMScanDuration")
    6357                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6358                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6359                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6360                            .dwattr $C$DW$531, DW_AT_decl_line(0x432)
    6361                            .dwattr $C$DW$531, DW_AT_decl_column(0x14)
    6362                    
    6363                    $C$DW$532       .dwtag  DW_TAG_member
    6364                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$476)
    6365                            .dwattr $C$DW$532, DW_AT_name("result")
    6366                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("result")
    6367                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6368                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6369                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6370                            .dwattr $C$DW$532, DW_AT_decl_line(0x440)
    6371                            .dwattr $C$DW$532, DW_AT_decl_column(0x05)
    6372                    
    6373                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6374                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x420)
    6375                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6376                            .dwendtag $C$DW$T$36
    6377                    
    6378                    $C$DW$T$478     .dwtag  DW_TAG_typedef
    6379                            .dwattr $C$DW$T$478, DW_AT_name("macMlmeScanReq_t")
    6380                            .dwattr $C$DW$T$478, DW_AT_type(*$C$DW$T$36)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  117

    6381                            .dwattr $C$DW$T$478, DW_AT_language(DW_LANG_C)
    6382                            .dwattr $C$DW$T$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    6383                            .dwattr $C$DW$T$478, DW_AT_decl_line(0x441)
    6384                            .dwattr $C$DW$T$478, DW_AT_decl_column(0x03)
    6385                    
    6386                    
    6387                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6388                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6389                    $C$DW$533       .dwtag  DW_TAG_member
    6390                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$21)
    6391                            .dwattr $C$DW$533, DW_AT_name("msduHandle")
    6392                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("msduHandle")
    6393                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6394                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6395                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6396                            .dwattr $C$DW$533, DW_AT_decl_line(0x160)
    6397                            .dwattr $C$DW$533, DW_AT_decl_column(0x1f)
    6398                    
    6399                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6400                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x15f)
    6401                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6402                            .dwendtag $C$DW$T$37
    6403                    
    6404                    $C$DW$T$481     .dwtag  DW_TAG_typedef
    6405                            .dwattr $C$DW$T$481, DW_AT_name("macMcpsPurgeReq_t")
    6406                            .dwattr $C$DW$T$481, DW_AT_type(*$C$DW$T$37)
    6407                            .dwattr $C$DW$T$481, DW_AT_language(DW_LANG_C)
    6408                            .dwattr $C$DW$T$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    6409                            .dwattr $C$DW$T$481, DW_AT_decl_line(0x161)
    6410                            .dwattr $C$DW$T$481, DW_AT_decl_column(0x03)
    6411                    
    6412                    
    6413                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6414                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x38)
    6415                    $C$DW$534       .dwtag  DW_TAG_member
    6416                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$38)
    6417                            .dwattr $C$DW$534, DW_AT_name("hdr")
    6418                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("hdr")
    6419                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6420                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6421                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6422                            .dwattr $C$DW$534, DW_AT_decl_line(0x167)
    6423                            .dwattr $C$DW$534, DW_AT_decl_column(0x1f)
    6424                    
    6425                    $C$DW$535       .dwtag  DW_TAG_member
    6426                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$482)
    6427                            .dwattr $C$DW$535, DW_AT_name("mac")
    6428                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("mac")
    6429                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6430                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6431                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6432                            .dwattr $C$DW$535, DW_AT_decl_line(0x170)
    6433                            .dwattr $C$DW$535, DW_AT_decl_column(0x05)
    6434                    
    6435                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  118

    6436                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x166)
    6437                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    6438                            .dwendtag $C$DW$T$39
    6439                    
    6440                    $C$DW$T$494     .dwtag  DW_TAG_typedef
    6441                            .dwattr $C$DW$T$494, DW_AT_name("macApiEvent_t")
    6442                            .dwattr $C$DW$T$494, DW_AT_type(*$C$DW$T$39)
    6443                            .dwattr $C$DW$T$494, DW_AT_language(DW_LANG_C)
    6444                            .dwattr $C$DW$T$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    6445                            .dwattr $C$DW$T$494, DW_AT_decl_line(0x171)
    6446                            .dwattr $C$DW$T$494, DW_AT_decl_column(0x03)
    6447                    
    6448                    
    6449                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6450                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6451                    $C$DW$536       .dwtag  DW_TAG_member
    6452                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$40)
    6453                            .dwattr $C$DW$536, DW_AT_name("p")
    6454                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("p")
    6455                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6456                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6457                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sdat
    6458                            .dwattr $C$DW$536, DW_AT_decl_line(0x3d)
    6459                            .dwattr $C$DW$536, DW_AT_decl_column(0x0e)
    6460                    
    6461                    $C$DW$537       .dwtag  DW_TAG_member
    6462                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$30)
    6463                            .dwattr $C$DW$537, DW_AT_name("len")
    6464                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("len")
    6465                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6466                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6467                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sdat
    6468                            .dwattr $C$DW$537, DW_AT_decl_line(0x3e)
    6469                            .dwattr $C$DW$537, DW_AT_decl_column(0x0e)
    6470                    
    6471                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sda
    6472                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x3c)
    6473                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6474                            .dwendtag $C$DW$T$41
    6475                    
    6476                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    6477                            .dwattr $C$DW$T$62, DW_AT_name("sData_t")
    6478                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
    6479                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6480                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sda
    6481                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x3f)
    6482                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6483                    
    6484                    
    6485                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6486                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    6487                    $C$DW$538       .dwtag  DW_TAG_member
    6488                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$42)
    6489                            .dwattr $C$DW$538, DW_AT_name("lookupData")
    6490                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("lookupData")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  119

    6491                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6492                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6493                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6494                            .dwattr $C$DW$538, DW_AT_decl_line(0x2c6)
    6495                            .dwattr $C$DW$538, DW_AT_decl_column(0x16)
    6496                    
    6497                    $C$DW$539       .dwtag  DW_TAG_member
    6498                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$21)
    6499                            .dwattr $C$DW$539, DW_AT_name("lookupDataSize")
    6500                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("lookupDataSize")
    6501                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6502                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6503                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6504                            .dwattr $C$DW$539, DW_AT_decl_line(0x2c7)
    6505                            .dwattr $C$DW$539, DW_AT_decl_column(0x16)
    6506                    
    6507                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6508                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c5)
    6509                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6510                            .dwendtag $C$DW$T$43
    6511                    
    6512                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    6513                            .dwattr $C$DW$T$46, DW_AT_name("keyIdLookupDescriptor_t")
    6514                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    6515                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6516                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6517                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c8)
    6518                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    6519                    
    6520                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    6521                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6522                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    6523                    
    6524                    
    6525                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6526                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    6527                    $C$DW$540       .dwtag  DW_TAG_member
    6528                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$30)
    6529                            .dwattr $C$DW$540, DW_AT_name("deviceDescriptorHandle")
    6530                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    6531                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6532                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6533                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6534                            .dwattr $C$DW$540, DW_AT_decl_line(0x2cd)
    6535                            .dwattr $C$DW$540, DW_AT_decl_column(0x16)
    6536                    
    6537                    $C$DW$541       .dwtag  DW_TAG_member
    6538                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$31)
    6539                            .dwattr $C$DW$541, DW_AT_name("uniqueDevice")
    6540                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("uniqueDevice")
    6541                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6542                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6543                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6544                            .dwattr $C$DW$541, DW_AT_decl_line(0x2ce)
    6545                            .dwattr $C$DW$541, DW_AT_decl_column(0x16)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  120

    6546                    
    6547                    $C$DW$542       .dwtag  DW_TAG_member
    6548                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$31)
    6549                            .dwattr $C$DW$542, DW_AT_name("blackListed")
    6550                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("blackListed")
    6551                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6552                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6553                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6554                            .dwattr $C$DW$542, DW_AT_decl_line(0x2cf)
    6555                            .dwattr $C$DW$542, DW_AT_decl_column(0x16)
    6556                    
    6557                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6558                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2cc)
    6559                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    6560                            .dwendtag $C$DW$T$44
    6561                    
    6562                    $C$DW$T$48      .dwtag  DW_TAG_typedef
    6563                            .dwattr $C$DW$T$48, DW_AT_name("keyDeviceDescriptor_t")
    6564                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$44)
    6565                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6566                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6567                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d0)
    6568                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    6569                    
    6570                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    6571                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6572                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    6573                    
    6574                    
    6575                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6576                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    6577                    $C$DW$543       .dwtag  DW_TAG_member
    6578                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$21)
    6579                            .dwattr $C$DW$543, DW_AT_name("frameType")
    6580                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("frameType")
    6581                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6582                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6583                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6584                            .dwattr $C$DW$543, DW_AT_decl_line(0x2d5)
    6585                            .dwattr $C$DW$543, DW_AT_decl_column(0x16)
    6586                    
    6587                    $C$DW$544       .dwtag  DW_TAG_member
    6588                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$21)
    6589                            .dwattr $C$DW$544, DW_AT_name("cmdFrameId")
    6590                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("cmdFrameId")
    6591                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6592                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6593                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6594                            .dwattr $C$DW$544, DW_AT_decl_line(0x2d6)
    6595                            .dwattr $C$DW$544, DW_AT_decl_column(0x16)
    6596                    
    6597                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6598                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2d4)
    6599                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    6600                            .dwendtag $C$DW$T$45
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  121

    6601                    
    6602                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    6603                            .dwattr $C$DW$T$50, DW_AT_name("keyUsageDescriptor_t")
    6604                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$45)
    6605                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6606                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6607                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2d7)
    6608                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    6609                    
    6610                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    6611                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    6612                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    6613                    
    6614                    
    6615                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    6616                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x2c)
    6617                    $C$DW$545       .dwtag  DW_TAG_member
    6618                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$47)
    6619                            .dwattr $C$DW$545, DW_AT_name("keyIdLookupList")
    6620                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("keyIdLookupList")
    6621                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6622                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6623                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6624                            .dwattr $C$DW$545, DW_AT_decl_line(0x2dc)
    6625                            .dwattr $C$DW$545, DW_AT_decl_column(0x1d)
    6626                    
    6627                    $C$DW$546       .dwtag  DW_TAG_member
    6628                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$21)
    6629                            .dwattr $C$DW$546, DW_AT_name("keyIdLookupEntries")
    6630                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("keyIdLookupEntries")
    6631                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6632                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6633                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6634                            .dwattr $C$DW$546, DW_AT_decl_line(0x2dd)
    6635                            .dwattr $C$DW$546, DW_AT_decl_column(0x1c)
    6636                    
    6637                    $C$DW$547       .dwtag  DW_TAG_member
    6638                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$49)
    6639                            .dwattr $C$DW$547, DW_AT_name("keyDeviceList")
    6640                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("keyDeviceList")
    6641                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6642                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6643                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6644                            .dwattr $C$DW$547, DW_AT_decl_line(0x2df)
    6645                            .dwattr $C$DW$547, DW_AT_decl_column(0x1d)
    6646                    
    6647                    $C$DW$548       .dwtag  DW_TAG_member
    6648                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$30)
    6649                            .dwattr $C$DW$548, DW_AT_name("keyDeviceListEntries")
    6650                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("keyDeviceListEntries")
    6651                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6652                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6653                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6654                            .dwattr $C$DW$548, DW_AT_decl_line(0x2e2)
    6655                            .dwattr $C$DW$548, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  122

    6656                    
    6657                    $C$DW$549       .dwtag  DW_TAG_member
    6658                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$51)
    6659                            .dwattr $C$DW$549, DW_AT_name("keyUsageList")
    6660                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("keyUsageList")
    6661                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6662                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6663                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6664                            .dwattr $C$DW$549, DW_AT_decl_line(0x2e4)
    6665                            .dwattr $C$DW$549, DW_AT_decl_column(0x1d)
    6666                    
    6667                    $C$DW$550       .dwtag  DW_TAG_member
    6668                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$21)
    6669                            .dwattr $C$DW$550, DW_AT_name("keyUsageListEntries")
    6670                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("keyUsageListEntries")
    6671                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6672                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6673                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6674                            .dwattr $C$DW$550, DW_AT_decl_line(0x2e6)
    6675                            .dwattr $C$DW$550, DW_AT_decl_column(0x1c)
    6676                    
    6677                    $C$DW$551       .dwtag  DW_TAG_member
    6678                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$52)
    6679                            .dwattr $C$DW$551, DW_AT_name("key")
    6680                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("key")
    6681                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6682                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6683                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6684                            .dwattr $C$DW$551, DW_AT_decl_line(0x2e8)
    6685                            .dwattr $C$DW$551, DW_AT_decl_column(0x1c)
    6686                    
    6687                    $C$DW$552       .dwtag  DW_TAG_member
    6688                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$32)
    6689                            .dwattr $C$DW$552, DW_AT_name("frameCounter")
    6690                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("frameCounter")
    6691                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6692                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6693                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6694                            .dwattr $C$DW$552, DW_AT_decl_line(0x2e9)
    6695                            .dwattr $C$DW$552, DW_AT_decl_column(0x1c)
    6696                    
    6697                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6698                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2db)
    6699                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    6700                            .dwendtag $C$DW$T$53
    6701                    
    6702                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    6703                            .dwattr $C$DW$T$55, DW_AT_name("keyDescriptor_t")
    6704                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    6705                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6706                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    6707                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2ec)
    6708                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    6709                    
    6710                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  123

    6711                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    6712                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    6713                    
    6714                    
    6715                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6716                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x78)
    6717                    $C$DW$553       .dwtag  DW_TAG_member
    6718                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$32)
    6719                            .dwattr $C$DW$553, DW_AT_name("timestamp")
    6720                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("timestamp")
    6721                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6722                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6723                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6724                            .dwattr $C$DW$553, DW_AT_decl_line(0x356)
    6725                            .dwattr $C$DW$553, DW_AT_decl_column(0x19)
    6726                    
    6727                    $C$DW$554       .dwtag  DW_TAG_member
    6728                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$30)
    6729                            .dwattr $C$DW$554, DW_AT_name("timestamp2")
    6730                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("timestamp2")
    6731                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6732                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6733                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6734                            .dwattr $C$DW$554, DW_AT_decl_line(0x357)
    6735                            .dwattr $C$DW$554, DW_AT_decl_column(0x19)
    6736                    
    6737                    $C$DW$555       .dwtag  DW_TAG_member
    6738                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$30)
    6739                            .dwattr $C$DW$555, DW_AT_name("timeToLive")
    6740                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("timeToLive")
    6741                            .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6742                            .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6743                            .dwattr $C$DW$555, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6744                            .dwattr $C$DW$555, DW_AT_decl_line(0x358)
    6745                            .dwattr $C$DW$555, DW_AT_decl_column(0x19)
    6746                    
    6747                    $C$DW$556       .dwtag  DW_TAG_member
    6748                            .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$21)
    6749                            .dwattr $C$DW$556, DW_AT_name("frameType")
    6750                            .dwattr $C$DW$556, DW_AT_TI_symbol_name("frameType")
    6751                            .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6752                            .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6753                            .dwattr $C$DW$556, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6754                            .dwattr $C$DW$556, DW_AT_decl_line(0x359)
    6755                            .dwattr $C$DW$556, DW_AT_decl_column(0x19)
    6756                    
    6757                    $C$DW$557       .dwtag  DW_TAG_member
    6758                            .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$30)
    6759                            .dwattr $C$DW$557, DW_AT_name("txOptions")
    6760                            .dwattr $C$DW$557, DW_AT_TI_symbol_name("txOptions")
    6761                            .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6762                            .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6763                            .dwattr $C$DW$557, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6764                            .dwattr $C$DW$557, DW_AT_decl_line(0x35a)
    6765                            .dwattr $C$DW$557, DW_AT_decl_column(0x19)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  124

    6766                    
    6767                    $C$DW$558       .dwtag  DW_TAG_member
    6768                            .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$21)
    6769                            .dwattr $C$DW$558, DW_AT_name("txMode")
    6770                            .dwattr $C$DW$558, DW_AT_TI_symbol_name("txMode")
    6771                            .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6772                            .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    6773                            .dwattr $C$DW$558, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6774                            .dwattr $C$DW$558, DW_AT_decl_line(0x35b)
    6775                            .dwattr $C$DW$558, DW_AT_decl_column(0x19)
    6776                    
    6777                    $C$DW$559       .dwtag  DW_TAG_member
    6778                            .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$21)
    6779                            .dwattr $C$DW$559, DW_AT_name("txSched")
    6780                            .dwattr $C$DW$559, DW_AT_TI_symbol_name("txSched")
    6781                            .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6782                            .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6783                            .dwattr $C$DW$559, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6784                            .dwattr $C$DW$559, DW_AT_decl_line(0x35c)
    6785                            .dwattr $C$DW$559, DW_AT_decl_column(0x19)
    6786                    
    6787                    $C$DW$560       .dwtag  DW_TAG_member
    6788                            .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
    6789                            .dwattr $C$DW$560, DW_AT_name("retries")
    6790                            .dwattr $C$DW$560, DW_AT_TI_symbol_name("retries")
    6791                            .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6792                            .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6793                            .dwattr $C$DW$560, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6794                            .dwattr $C$DW$560, DW_AT_decl_line(0x35d)
    6795                            .dwattr $C$DW$560, DW_AT_decl_column(0x19)
    6796                    
    6797                    $C$DW$561       .dwtag  DW_TAG_member
    6798                            .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$21)
    6799                            .dwattr $C$DW$561, DW_AT_name("channel")
    6800                            .dwattr $C$DW$561, DW_AT_TI_symbol_name("channel")
    6801                            .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6802                            .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6803                            .dwattr $C$DW$561, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6804                            .dwattr $C$DW$561, DW_AT_decl_line(0x35e)
    6805                            .dwattr $C$DW$561, DW_AT_decl_column(0x19)
    6806                    
    6807                    $C$DW$562       .dwtag  DW_TAG_member
    6808                            .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$21)
    6809                            .dwattr $C$DW$562, DW_AT_name("power")
    6810                            .dwattr $C$DW$562, DW_AT_TI_symbol_name("power")
    6811                            .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6812                            .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6813                            .dwattr $C$DW$562, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6814                            .dwattr $C$DW$562, DW_AT_decl_line(0x35f)
    6815                            .dwattr $C$DW$562, DW_AT_decl_column(0x19)
    6816                    
    6817                    $C$DW$563       .dwtag  DW_TAG_member
    6818                            .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$21)
    6819                            .dwattr $C$DW$563, DW_AT_name("mpduLinkQuality")
    6820                            .dwattr $C$DW$563, DW_AT_TI_symbol_name("mpduLinkQuality")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  125

    6821                            .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6822                            .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6823                            .dwattr $C$DW$563, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6824                            .dwattr $C$DW$563, DW_AT_decl_line(0x360)
    6825                            .dwattr $C$DW$563, DW_AT_decl_column(0x19)
    6826                    
    6827                    $C$DW$564       .dwtag  DW_TAG_member
    6828                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$21)
    6829                            .dwattr $C$DW$564, DW_AT_name("correlation")
    6830                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("correlation")
    6831                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6832                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6833                            .dwattr $C$DW$564, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6834                            .dwattr $C$DW$564, DW_AT_decl_line(0x361)
    6835                            .dwattr $C$DW$564, DW_AT_decl_column(0x19)
    6836                    
    6837                    $C$DW$565       .dwtag  DW_TAG_member
    6838                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$54)
    6839                            .dwattr $C$DW$565, DW_AT_name("rssi")
    6840                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("rssi")
    6841                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6842                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6843                            .dwattr $C$DW$565, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6844                            .dwattr $C$DW$565, DW_AT_decl_line(0x362)
    6845                            .dwattr $C$DW$565, DW_AT_decl_column(0x19)
    6846                    
    6847                    $C$DW$566       .dwtag  DW_TAG_member
    6848                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$40)
    6849                            .dwattr $C$DW$566, DW_AT_name("ptrMData")
    6850                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("ptrMData")
    6851                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6852                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6853                            .dwattr $C$DW$566, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6854                            .dwattr $C$DW$566, DW_AT_decl_line(0x364)
    6855                            .dwattr $C$DW$566, DW_AT_decl_column(0x19)
    6856                    
    6857                    $C$DW$567       .dwtag  DW_TAG_member
    6858                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$56)
    6859                            .dwattr $C$DW$567, DW_AT_name("pKeyDesc")
    6860                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("pKeyDesc")
    6861                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6862                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6863                            .dwattr $C$DW$567, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6864                            .dwattr $C$DW$567, DW_AT_decl_line(0x365)
    6865                            .dwattr $C$DW$567, DW_AT_decl_column(0x19)
    6866                    
    6867                    $C$DW$568       .dwtag  DW_TAG_member
    6868                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$32)
    6869                            .dwattr $C$DW$568, DW_AT_name("frameCntr")
    6870                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("frameCntr")
    6871                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6872                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6873                            .dwattr $C$DW$568, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6874                            .dwattr $C$DW$568, DW_AT_decl_line(0x366)
    6875                            .dwattr $C$DW$568, DW_AT_decl_column(0x19)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  126

    6876                    
    6877                    $C$DW$569       .dwtag  DW_TAG_member
    6878                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$58)
    6879                            .dwattr $C$DW$569, DW_AT_name("payloadIeInfo")
    6880                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("payloadIeInfo")
    6881                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6882                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    6883                            .dwattr $C$DW$569, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6884                            .dwattr $C$DW$569, DW_AT_decl_line(0x368)
    6885                            .dwattr $C$DW$569, DW_AT_decl_column(0x19)
    6886                    
    6887                    $C$DW$570       .dwtag  DW_TAG_member
    6888                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$60)
    6889                            .dwattr $C$DW$570, DW_AT_name("headerIeInfo")
    6890                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("headerIeInfo")
    6891                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6892                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6893                            .dwattr $C$DW$570, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6894                            .dwattr $C$DW$570, DW_AT_decl_line(0x369)
    6895                            .dwattr $C$DW$570, DW_AT_decl_column(0x19)
    6896                    
    6897                    $C$DW$571       .dwtag  DW_TAG_member
    6898                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$30)
    6899                            .dwattr $C$DW$571, DW_AT_name("totalLen")
    6900                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("totalLen")
    6901                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6902                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6903                            .dwattr $C$DW$571, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6904                            .dwattr $C$DW$571, DW_AT_decl_line(0x36a)
    6905                            .dwattr $C$DW$571, DW_AT_decl_column(0x19)
    6906                    
    6907                    $C$DW$572       .dwtag  DW_TAG_member
    6908                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$40)
    6909                            .dwattr $C$DW$572, DW_AT_name("ptrHeaderIE")
    6910                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("ptrHeaderIE")
    6911                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6912                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6913                            .dwattr $C$DW$572, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6914                            .dwattr $C$DW$572, DW_AT_decl_line(0x36b)
    6915                            .dwattr $C$DW$572, DW_AT_decl_column(0x19)
    6916                    
    6917                    $C$DW$573       .dwtag  DW_TAG_member
    6918                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$30)
    6919                            .dwattr $C$DW$573, DW_AT_name("headerIesLen")
    6920                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("headerIesLen")
    6921                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6922                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6923                            .dwattr $C$DW$573, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6924                            .dwattr $C$DW$573, DW_AT_decl_line(0x36c)
    6925                            .dwattr $C$DW$573, DW_AT_decl_column(0x19)
    6926                    
    6927                    $C$DW$574       .dwtag  DW_TAG_member
    6928                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$40)
    6929                            .dwattr $C$DW$574, DW_AT_name("ptrPayloadIE")
    6930                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("ptrPayloadIE")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  127

    6931                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6932                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6933                            .dwattr $C$DW$574, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6934                            .dwattr $C$DW$574, DW_AT_decl_line(0x36d)
    6935                            .dwattr $C$DW$574, DW_AT_decl_column(0x19)
    6936                    
    6937                    $C$DW$575       .dwtag  DW_TAG_member
    6938                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$40)
    6939                            .dwattr $C$DW$575, DW_AT_name("ptrUTIE")
    6940                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("ptrUTIE")
    6941                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6942                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6943                            .dwattr $C$DW$575, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6944                            .dwattr $C$DW$575, DW_AT_decl_line(0x36e)
    6945                            .dwattr $C$DW$575, DW_AT_decl_column(0x19)
    6946                    
    6947                    $C$DW$576       .dwtag  DW_TAG_member
    6948                            .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$40)
    6949                            .dwattr $C$DW$576, DW_AT_name("ptrBTIE")
    6950                            .dwattr $C$DW$576, DW_AT_TI_symbol_name("ptrBTIE")
    6951                            .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6952                            .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6953                            .dwattr $C$DW$576, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6954                            .dwattr $C$DW$576, DW_AT_decl_line(0x36f)
    6955                            .dwattr $C$DW$576, DW_AT_decl_column(0x19)
    6956                    
    6957                    $C$DW$577       .dwtag  DW_TAG_member
    6958                            .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$40)
    6959                            .dwattr $C$DW$577, DW_AT_name("ptrFrameCnt")
    6960                            .dwattr $C$DW$577, DW_AT_TI_symbol_name("ptrFrameCnt")
    6961                            .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6962                            .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6963                            .dwattr $C$DW$577, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6964                            .dwattr $C$DW$577, DW_AT_decl_line(0x370)
    6965                            .dwattr $C$DW$577, DW_AT_decl_column(0x19)
    6966                    
    6967                    $C$DW$578       .dwtag  DW_TAG_member
    6968                            .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$21)
    6969                            .dwattr $C$DW$578, DW_AT_name("rsl")
    6970                            .dwattr $C$DW$578, DW_AT_TI_symbol_name("rsl")
    6971                            .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6972                            .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6973                            .dwattr $C$DW$578, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6974                            .dwattr $C$DW$578, DW_AT_decl_line(0x371)
    6975                            .dwattr $C$DW$578, DW_AT_decl_column(0x19)
    6976                    
    6977                    $C$DW$579       .dwtag  DW_TAG_member
    6978                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$21)
    6979                            .dwattr $C$DW$579, DW_AT_name("nb")
    6980                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("nb")
    6981                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    6982                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6983                            .dwattr $C$DW$579, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6984                            .dwattr $C$DW$579, DW_AT_decl_line(0x372)
    6985                            .dwattr $C$DW$579, DW_AT_decl_column(0x19)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  128

    6986                    
    6987                    $C$DW$580       .dwtag  DW_TAG_member
    6988                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$21)
    6989                            .dwattr $C$DW$580, DW_AT_name("be")
    6990                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("be")
    6991                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6992                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6993                            .dwattr $C$DW$580, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    6994                            .dwattr $C$DW$580, DW_AT_decl_line(0x373)
    6995                            .dwattr $C$DW$580, DW_AT_decl_column(0x19)
    6996                    
    6997                    $C$DW$581       .dwtag  DW_TAG_member
    6998                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$21)
    6999                            .dwattr $C$DW$581, DW_AT_name("fhFrameType")
    7000                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("fhFrameType")
    7001                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    7002                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    7003                            .dwattr $C$DW$581, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7004                            .dwattr $C$DW$581, DW_AT_decl_line(0x374)
    7005                            .dwattr $C$DW$581, DW_AT_decl_column(0x19)
    7006                    
    7007                    $C$DW$582       .dwtag  DW_TAG_member
    7008                            .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$21)
    7009                            .dwattr $C$DW$582, DW_AT_name("gpDuration")
    7010                            .dwattr $C$DW$582, DW_AT_TI_symbol_name("gpDuration")
    7011                            .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7012                            .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    7013                            .dwattr $C$DW$582, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7014                            .dwattr $C$DW$582, DW_AT_decl_line(0x375)
    7015                            .dwattr $C$DW$582, DW_AT_decl_column(0x19)
    7016                    
    7017                    $C$DW$583       .dwtag  DW_TAG_member
    7018                            .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$21)
    7019                            .dwattr $C$DW$583, DW_AT_name("gpNumOfTx")
    7020                            .dwattr $C$DW$583, DW_AT_TI_symbol_name("gpNumOfTx")
    7021                            .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    7022                            .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    7023                            .dwattr $C$DW$583, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7024                            .dwattr $C$DW$583, DW_AT_decl_line(0x376)
    7025                            .dwattr $C$DW$583, DW_AT_decl_column(0x19)
    7026                    
    7027                    $C$DW$584       .dwtag  DW_TAG_member
    7028                            .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$21)
    7029                            .dwattr $C$DW$584, DW_AT_name("gpInterframeDelay")
    7030                            .dwattr $C$DW$584, DW_AT_TI_symbol_name("gpInterframeDelay")
    7031                            .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7032                            .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    7033                            .dwattr $C$DW$584, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7034                            .dwattr $C$DW$584, DW_AT_decl_line(0x377)
    7035                            .dwattr $C$DW$584, DW_AT_decl_column(0x19)
    7036                    
    7037                    $C$DW$585       .dwtag  DW_TAG_member
    7038                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$485)
    7039                            .dwattr $C$DW$585, DW_AT_name("dest")
    7040                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("dest")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  129

    7041                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    7042                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    7043                            .dwattr $C$DW$585, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7044                            .dwattr $C$DW$585, DW_AT_decl_line(0x37d)
    7045                            .dwattr $C$DW$585, DW_AT_decl_column(0x05)
    7046                    
    7047                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7048                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x355)
    7049                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    7050                            .dwendtag $C$DW$T$61
    7051                    
    7052                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    7053                            .dwattr $C$DW$T$63, DW_AT_name("macTxIntData_t")
    7054                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$61)
    7055                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7056                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7057                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x37e)
    7058                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    7059                    
    7060                    
    7061                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7062                            .dwattr $C$DW$T$64, DW_AT_byte_size(0xa4)
    7063                    $C$DW$586       .dwtag  DW_TAG_member
    7064                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$38)
    7065                            .dwattr $C$DW$586, DW_AT_name("hdr")
    7066                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("hdr")
    7067                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7068                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    7069                            .dwattr $C$DW$586, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7070                            .dwattr $C$DW$586, DW_AT_decl_line(0x150)
    7071                            .dwattr $C$DW$586, DW_AT_decl_column(0x1f)
    7072                    
    7073                    $C$DW$587       .dwtag  DW_TAG_member
    7074                            .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$62)
    7075                            .dwattr $C$DW$587, DW_AT_name("mpdu")
    7076                            .dwattr $C$DW$587, DW_AT_TI_symbol_name("mpdu")
    7077                            .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7078                            .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    7079                            .dwattr $C$DW$587, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7080                            .dwattr $C$DW$587, DW_AT_decl_line(0x151)
    7081                            .dwattr $C$DW$587, DW_AT_decl_column(0x1f)
    7082                    
    7083                    $C$DW$588       .dwtag  DW_TAG_member
    7084                            .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$63)
    7085                            .dwattr $C$DW$588, DW_AT_name("internal")
    7086                            .dwattr $C$DW$588, DW_AT_TI_symbol_name("internal")
    7087                            .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7088                            .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    7089                            .dwattr $C$DW$588, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7090                            .dwattr $C$DW$588, DW_AT_decl_line(0x152)
    7091                            .dwattr $C$DW$588, DW_AT_decl_column(0x1f)
    7092                    
    7093                    $C$DW$589       .dwtag  DW_TAG_member
    7094                            .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$490)
    7095                            .dwattr $C$DW$589, DW_AT_name("mac")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{AEAD3209-64D5-491A-9309-43F2947C9210} PAGE  130

    7096                            .dwattr $C$DW$589, DW_AT_TI_symbol_name("mac")
    7097                            .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7098                            .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    7099                            .dwattr $C$DW$589, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
