TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:01 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/ICall/icall_cc2650.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1661                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1662                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1663                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1664                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1665                    
    1666                    ;******************************************************************************
    1667                    ;* TYPE INFORMATION                                                           *
    1668                    ;******************************************************************************
    1669                    
    1670                    $C$DW$T$169     .dwtag  DW_TAG_enumeration_type
    1671                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
    1672                    $C$DW$111       .dwtag  DW_TAG_enumerator
    1673                            .dwattr $C$DW$111, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1674                            .dwattr $C$DW$111, DW_AT_const_value(0xe0)
    1675                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1676                            .dwattr $C$DW$111, DW_AT_decl_line(0x3de)
    1677                            .dwattr $C$DW$111, DW_AT_decl_column(0x04)
    1678                    
    1679                    $C$DW$112       .dwtag  DW_TAG_enumerator
    1680                            .dwattr $C$DW$112, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1681                            .dwattr $C$DW$112, DW_AT_const_value(0xe1)
    1682                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1683                            .dwattr $C$DW$112, DW_AT_decl_line(0x3e0)
    1684                            .dwattr $C$DW$112, DW_AT_decl_column(0x04)
    1685                    
    1686                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1687                            .dwattr $C$DW$113, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1688                            .dwattr $C$DW$113, DW_AT_const_value(0xe2)
    1689                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1690                            .dwattr $C$DW$113, DW_AT_decl_line(0x3e2)
    1691                            .dwattr $C$DW$113, DW_AT_decl_column(0x04)
    1692                    
    1693                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1694                            .dwattr $C$DW$114, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1695                            .dwattr $C$DW$114, DW_AT_const_value(0xe3)
    1696                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1697                            .dwattr $C$DW$114, DW_AT_decl_line(0x3e4)
    1698                            .dwattr $C$DW$114, DW_AT_decl_column(0x04)
    1699                    
    1700                    $C$DW$115       .dwtag  DW_TAG_enumerator
    1701                            .dwattr $C$DW$115, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1702                            .dwattr $C$DW$115, DW_AT_const_value(0xe4)
    1703                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1704                            .dwattr $C$DW$115, DW_AT_decl_line(0x3e6)
    1705                            .dwattr $C$DW$115, DW_AT_decl_column(0x04)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   32

    1706                    
    1707                    $C$DW$116       .dwtag  DW_TAG_enumerator
    1708                            .dwattr $C$DW$116, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1709                            .dwattr $C$DW$116, DW_AT_const_value(0xe5)
    1710                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1711                            .dwattr $C$DW$116, DW_AT_decl_line(0x3e8)
    1712                            .dwattr $C$DW$116, DW_AT_decl_column(0x04)
    1713                    
    1714                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154st
    1715                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x3dc)
    1716                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x01)
    1717                            .dwendtag $C$DW$T$169
    1718                    
    1719                    $C$DW$T$170     .dwtag  DW_TAG_typedef
    1720                            .dwattr $C$DW$T$170, DW_AT_name("ICall_RemotiCmdEvent_t")
    1721                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
    1722                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    1723                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154st
    1724                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x3e9)
    1725                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x02)
    1726                    
    1727                    
    1728                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1729                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1730                    $C$DW$117       .dwtag  DW_TAG_member
    1731                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$14)
    1732                            .dwattr $C$DW$117, DW_AT_name("__max_align1")
    1733                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("__max_align1")
    1734                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1736                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1737                            .dwattr $C$DW$117, DW_AT_decl_line(0x70)
    1738                            .dwattr $C$DW$117, DW_AT_decl_column(0x0c)
    1739                    
    1740                    $C$DW$118       .dwtag  DW_TAG_member
    1741                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$18)
    1742                            .dwattr $C$DW$118, DW_AT_name("__max_align2")
    1743                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("__max_align2")
    1744                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1745                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1746                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1747                            .dwattr $C$DW$118, DW_AT_decl_line(0x71)
    1748                            .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1749                    
    1750                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1751                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x6f)
    1752                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1753                            .dwendtag $C$DW$T$21
    1754                    
    1755                    $C$DW$T$171     .dwtag  DW_TAG_typedef
    1756                            .dwattr $C$DW$T$171, DW_AT_name("__max_align_t")
    1757                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$21)
    1758                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    1759                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1760                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x72)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   33

    1761                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x03)
    1762                    
    1763                    
    1764                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1765                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    1766                    $C$DW$119       .dwtag  DW_TAG_member
    1767                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$10)
    1768                            .dwattr $C$DW$119, DW_AT_name("quot")
    1769                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("quot")
    1770                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1772                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1773                            .dwattr $C$DW$119, DW_AT_decl_line(0x49)
    1774                            .dwattr $C$DW$119, DW_AT_decl_column(0x16)
    1775                    
    1776                    $C$DW$120       .dwtag  DW_TAG_member
    1777                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$10)
    1778                            .dwattr $C$DW$120, DW_AT_name("rem")
    1779                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rem")
    1780                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1781                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1782                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1783                            .dwattr $C$DW$120, DW_AT_decl_line(0x49)
    1784                            .dwattr $C$DW$120, DW_AT_decl_column(0x1c)
    1785                    
    1786                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1787                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x49)
    1788                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    1789                            .dwendtag $C$DW$T$22
    1790                    
    1791                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1792                            .dwattr $C$DW$T$172, DW_AT_name("div_t")
    1793                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$22)
    1794                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1795                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1796                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x49)
    1797                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x23)
    1798                    
    1799                    
    1800                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1801                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1802                    $C$DW$121       .dwtag  DW_TAG_member
    1803                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$10)
    1804                            .dwattr $C$DW$121, DW_AT_name("quot")
    1805                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("quot")
    1806                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1808                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1809                            .dwattr $C$DW$121, DW_AT_decl_line(0x4e)
    1810                            .dwattr $C$DW$121, DW_AT_decl_column(0x16)
    1811                    
    1812                    $C$DW$122       .dwtag  DW_TAG_member
    1813                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$10)
    1814                            .dwattr $C$DW$122, DW_AT_name("rem")
    1815                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rem")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   34

    1816                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1817                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1818                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1819                            .dwattr $C$DW$122, DW_AT_decl_line(0x4e)
    1820                            .dwattr $C$DW$122, DW_AT_decl_column(0x1c)
    1821                    
    1822                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1823                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4e)
    1824                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    1825                            .dwendtag $C$DW$T$23
    1826                    
    1827                    $C$DW$T$173     .dwtag  DW_TAG_typedef
    1828                            .dwattr $C$DW$T$173, DW_AT_name("ldiv_t")
    1829                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$23)
    1830                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    1831                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1832                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x4e)
    1833                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x23)
    1834                    
    1835                    
    1836                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1837                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1838                    $C$DW$123       .dwtag  DW_TAG_member
    1839                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$14)
    1840                            .dwattr $C$DW$123, DW_AT_name("quot")
    1841                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("quot")
    1842                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1844                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1845                            .dwattr $C$DW$123, DW_AT_decl_line(0x56)
    1846                            .dwattr $C$DW$123, DW_AT_decl_column(0x1c)
    1847                    
    1848                    $C$DW$124       .dwtag  DW_TAG_member
    1849                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$14)
    1850                            .dwattr $C$DW$124, DW_AT_name("rem")
    1851                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rem")
    1852                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1853                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1854                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1855                            .dwattr $C$DW$124, DW_AT_decl_line(0x56)
    1856                            .dwattr $C$DW$124, DW_AT_decl_column(0x22)
    1857                    
    1858                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1859                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x56)
    1860                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1861                            .dwendtag $C$DW$T$24
    1862                    
    1863                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1864                            .dwattr $C$DW$T$174, DW_AT_name("lldiv_t")
    1865                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$24)
    1866                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1867                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1868                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x56)
    1869                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x29)
    1870                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   35

    1871                    
    1872                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1873                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1874                    $C$DW$125       .dwtag  DW_TAG_member
    1875                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$28)
    1876                            .dwattr $C$DW$125, DW_AT_name("pointerStack")
    1877                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pointerStack")
    1878                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1880                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1881                            .dwattr $C$DW$125, DW_AT_decl_line(0x3f5)
    1882                            .dwattr $C$DW$125, DW_AT_decl_column(0x16)
    1883                    
    1884                    $C$DW$126       .dwtag  DW_TAG_member
    1885                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1886                            .dwattr $C$DW$126, DW_AT_name("directAPI")
    1887                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("directAPI")
    1888                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1889                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1890                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1891                            .dwattr $C$DW$126, DW_AT_decl_line(0x3f6)
    1892                            .dwattr $C$DW$126, DW_AT_decl_column(0x15)
    1893                    
    1894                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154sta
    1895                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f4)
    1896                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1897                            .dwendtag $C$DW$T$30
    1898                    
    1899                    $C$DW$T$32      .dwtag  DW_TAG_typedef
    1900                            .dwattr $C$DW$T$32, DW_AT_name("icall_directAPIMsg_t")
    1901                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$30)
    1902                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1903                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154sta
    1904                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f7)
    1905                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1906                    
    1907                    
    1908                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1909                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    1910                    $C$DW$127       .dwtag  DW_TAG_member
    1911                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$31)
    1912                            .dwattr $C$DW$127, DW_AT_name("hdr")
    1913                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("hdr")
    1914                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1916                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1917                            .dwattr $C$DW$127, DW_AT_decl_line(0x3fb)
    1918                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    1919                    
    1920                    $C$DW$128       .dwtag  DW_TAG_member
    1921                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
    1922                            .dwattr $C$DW$128, DW_AT_name("msg")
    1923                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("msg")
    1924                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1925                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   36

    1926                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1927                            .dwattr $C$DW$128, DW_AT_decl_line(0x3fc)
    1928                            .dwattr $C$DW$128, DW_AT_decl_column(0x1a)
    1929                    
    1930                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154sta
    1931                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3fa)
    1932                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1933                            .dwendtag $C$DW$T$33
    1934                    
    1935                    $C$DW$T$175     .dwtag  DW_TAG_typedef
    1936                            .dwattr $C$DW$T$175, DW_AT_name("icallLiteMsg_t")
    1937                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$33)
    1938                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    1939                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154st
    1940                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x3fd)
    1941                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x03)
    1942                    
    1943                    
    1944                    $C$DW$T$42      .dwtag  DW_TAG_union_type
    1945                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1946                    $C$DW$129       .dwtag  DW_TAG_member
    1947                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$37)
    1948                            .dwattr $C$DW$129, DW_AT_name("entityId")
    1949                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    1950                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1952                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1953                            .dwattr $C$DW$129, DW_AT_decl_line(0x1fe)
    1954                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    1955                    
    1956                    $C$DW$130       .dwtag  DW_TAG_member
    1957                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$41)
    1958                            .dwattr $C$DW$130, DW_AT_name("servId")
    1959                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("servId")
    1960                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1962                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1963                            .dwattr $C$DW$130, DW_AT_decl_line(0x200)
    1964                            .dwattr $C$DW$130, DW_AT_decl_column(0x17)
    1965                    
    1966                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154sta
    1967                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x1fc)
    1968                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    1969                            .dwendtag $C$DW$T$42
    1970                    
    1971                    
    1972                    $C$DW$T$43      .dwtag  DW_TAG_union_type
    1973                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1974                    $C$DW$131       .dwtag  DW_TAG_member
    1975                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$41)
    1976                            .dwattr $C$DW$131, DW_AT_name("servId")
    1977                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("servId")
    1978                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1979                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1980                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   37

    1981                            .dwattr $C$DW$131, DW_AT_decl_line(0x211)
    1982                            .dwattr $C$DW$131, DW_AT_decl_column(0x17)
    1983                    
    1984                    $C$DW$132       .dwtag  DW_TAG_member
    1985                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
    1986                            .dwattr $C$DW$132, DW_AT_name("entityId")
    1987                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("entityId")
    1988                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1990                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154stac
    1991                            .dwattr $C$DW$132, DW_AT_decl_line(0x213)
    1992                            .dwattr $C$DW$132, DW_AT_decl_column(0x14)
    1993                    
    1994                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\ti154sta
    1995                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x20f)
    1996                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    1997                            .dwendtag $C$DW$T$43
    1998                    
    1999                    
    2000                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2001                            .dwattr $C$DW$T$44, DW_AT_name(".ggroup1")
    2002                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    2003                    $C$DW$133       .dwtag  DW_TAG_member
    2004                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$6)
    2005                            .dwattr $C$DW$133, DW_AT_name("ICallPlatform_pwrActivityCount")
    2006                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ICallPlatform_pwrActivityCount")
    2007                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2009                    
    2010                    $C$DW$134       .dwtag  DW_TAG_member
    2011                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2012                            .dwattr $C$DW$134, DW_AT_name("ICallPlatform_pwrCfgACAction")
    2013                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ICallPlatform_pwrCfgACAction")
    2014                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2015                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2016                    
    2017                            .dwendtag $C$DW$T$44
    2018                    
    2019                    
    2020                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2021                            .dwattr $C$DW$T$46, DW_AT_name("ClockP_FreqHz")
    2022                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x08)
    2023                    $C$DW$135       .dwtag  DW_TAG_member
    2024                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$45)
    2025                            .dwattr $C$DW$135, DW_AT_name("hi")
    2026                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("hi")
    2027                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2029                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2030                            .dwattr $C$DW$135, DW_AT_decl_line(0x5c)
    2031                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2032                    
    2033                    $C$DW$136       .dwtag  DW_TAG_member
    2034                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$45)
    2035                            .dwattr $C$DW$136, DW_AT_name("lo")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   38

    2036                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("lo")
    2037                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2038                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2039                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2040                            .dwattr $C$DW$136, DW_AT_decl_line(0x5d)
    2041                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2042                    
    2043                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2044                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2045                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2046                            .dwendtag $C$DW$T$46
    2047                    
    2048                    $C$DW$T$177     .dwtag  DW_TAG_typedef
    2049                            .dwattr $C$DW$T$177, DW_AT_name("ClockP_FreqHz")
    2050                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$46)
    2051                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    2052                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2053                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x5e)
    2054                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    2055                    
    2056                    
    2057                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2058                            .dwattr $C$DW$T$50, DW_AT_name("ClockP_Params")
    2059                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    2060                    $C$DW$137       .dwtag  DW_TAG_member
    2061                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$47)
    2062                            .dwattr $C$DW$137, DW_AT_name("startFlag")
    2063                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("startFlag")
    2064                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2066                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2067                            .dwattr $C$DW$137, DW_AT_decl_line(0x8d)
    2068                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2069                    
    2070                    $C$DW$138       .dwtag  DW_TAG_member
    2071                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$45)
    2072                            .dwattr $C$DW$138, DW_AT_name("period")
    2073                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("period")
    2074                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2075                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2076                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2077                            .dwattr $C$DW$138, DW_AT_decl_line(0x8e)
    2078                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2079                    
    2080                    $C$DW$139       .dwtag  DW_TAG_member
    2081                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$49)
    2082                            .dwattr $C$DW$139, DW_AT_name("arg")
    2083                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("arg")
    2084                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2085                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2086                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2087                            .dwattr $C$DW$139, DW_AT_decl_line(0x8f)
    2088                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2089                    
    2090                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   39

    2091                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x8c)
    2092                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    2093                            .dwendtag $C$DW$T$50
    2094                    
    2095                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    2096                            .dwattr $C$DW$T$178, DW_AT_name("ClockP_Params")
    2097                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$50)
    2098                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    2099                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2100                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x90)
    2101                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x03)
    2102                    
    2103                    
    2104                    $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    2105                            .dwattr $C$DW$T$179, DW_AT_name("ClockP_Status")
    2106                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2107                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2108                            .dwattr $C$DW$140, DW_AT_name("ClockP_OK")
    2109                            .dwattr $C$DW$140, DW_AT_const_value(0x00)
    2110                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2111                            .dwattr $C$DW$140, DW_AT_decl_line(0x64)
    2112                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2113                    
    2114                    $C$DW$141       .dwtag  DW_TAG_enumerator
    2115                            .dwattr $C$DW$141, DW_AT_name("ClockP_FAILURE")
    2116                            .dwattr $C$DW$141, DW_AT_const_value(-1)
    2117                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2118                            .dwattr $C$DW$141, DW_AT_decl_line(0x65)
    2119                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2120                    
    2121                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2122                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x63)
    2123                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x0e)
    2124                            .dwendtag $C$DW$T$179
    2125                    
    2126                    $C$DW$T$180     .dwtag  DW_TAG_typedef
    2127                            .dwattr $C$DW$T$180, DW_AT_name("ClockP_Status")
    2128                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    2129                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    2130                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2131                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x66)
    2132                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x03)
    2133                    
    2134                    
    2135                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2136                            .dwattr $C$DW$T$53, DW_AT_name("ClockP_Struct")
    2137                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x24)
    2138                    $C$DW$142       .dwtag  DW_TAG_member
    2139                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$45)
    2140                            .dwattr $C$DW$142, DW_AT_name("dummy")
    2141                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("dummy")
    2142                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2143                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2144                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2145                            .dwattr $C$DW$142, DW_AT_decl_line(0x54)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   40

    2146                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2147                    
    2148                    $C$DW$143       .dwtag  DW_TAG_member
    2149                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$52)
    2150                            .dwattr $C$DW$143, DW_AT_name("data")
    2151                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("data")
    2152                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2154                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2155                            .dwattr $C$DW$143, DW_AT_decl_line(0x55)
    2156                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2157                    
    2158                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2159                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x53)
    2160                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x0f)
    2161                            .dwendtag $C$DW$T$53
    2162                    
    2163                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    2164                            .dwattr $C$DW$T$71, DW_AT_name("ClockP_Struct")
    2165                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$53)
    2166                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2167                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2168                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x56)
    2169                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    2170                    
    2171                    
    2172                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2173                            .dwattr $C$DW$T$54, DW_AT_name("HwiP_Params")
    2174                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
    2175                    $C$DW$144       .dwtag  DW_TAG_member
    2176                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$49)
    2177                            .dwattr $C$DW$144, DW_AT_name("arg")
    2178                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("arg")
    2179                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2181                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2182                            .dwattr $C$DW$144, DW_AT_decl_line(0x72)
    2183                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    2184                    
    2185                    $C$DW$145       .dwtag  DW_TAG_member
    2186                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$45)
    2187                            .dwattr $C$DW$145, DW_AT_name("priority")
    2188                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("priority")
    2189                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2190                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2191                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2192                            .dwattr $C$DW$145, DW_AT_decl_line(0x73)
    2193                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    2194                    
    2195                    $C$DW$146       .dwtag  DW_TAG_member
    2196                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$47)
    2197                            .dwattr $C$DW$146, DW_AT_name("enableInt")
    2198                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("enableInt")
    2199                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2200                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   41

    2201                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2202                            .dwattr $C$DW$146, DW_AT_decl_line(0x74)
    2203                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2204                    
    2205                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2206                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x71)
    2207                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
    2208                            .dwendtag $C$DW$T$54
    2209                    
    2210                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    2211                            .dwattr $C$DW$T$181, DW_AT_name("HwiP_Params")
    2212                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$54)
    2213                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    2214                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2215                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x75)
    2216                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    2217                    
    2218                    
    2219                    $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    2220                            .dwattr $C$DW$T$182, DW_AT_name("HwiP_Status")
    2221                            .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    2222                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2223                            .dwattr $C$DW$147, DW_AT_name("HwiP_OK")
    2224                            .dwattr $C$DW$147, DW_AT_const_value(0x00)
    2225                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2226                            .dwattr $C$DW$147, DW_AT_decl_line(0x5c)
    2227                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2228                    
    2229                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2230                            .dwattr $C$DW$148, DW_AT_name("HwiP_FAILURE")
    2231                            .dwattr $C$DW$148, DW_AT_const_value(-1)
    2232                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2233                            .dwattr $C$DW$148, DW_AT_decl_line(0x5d)
    2234                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2235                    
    2236                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2237                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x5b)
    2238                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x0e)
    2239                            .dwendtag $C$DW$T$182
    2240                    
    2241                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    2242                            .dwattr $C$DW$T$183, DW_AT_name("HwiP_Status")
    2243                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    2244                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    2245                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2246                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x5e)
    2247                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    2248                    
    2249                    
    2250                    $C$DW$T$56      .dwtag  DW_TAG_union_type
    2251                            .dwattr $C$DW$T$56, DW_AT_name("HwiP_Struct")
    2252                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x1c)
    2253                    $C$DW$149       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$45)
    2255                            .dwattr $C$DW$149, DW_AT_name("dummy")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   42

    2256                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("dummy")
    2257                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2260                            .dwattr $C$DW$149, DW_AT_decl_line(0x4d)
    2261                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2262                    
    2263                    $C$DW$150       .dwtag  DW_TAG_member
    2264                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$55)
    2265                            .dwattr $C$DW$150, DW_AT_name("data")
    2266                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("data")
    2267                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2269                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/d
    2270                            .dwattr $C$DW$150, DW_AT_decl_line(0x4e)
    2271                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2272                    
    2273                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2274                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x4c)
    2275                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0f)
    2276                            .dwendtag $C$DW$T$56
    2277                    
    2278                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    2279                            .dwattr $C$DW$T$72, DW_AT_name("HwiP_Struct")
    2280                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$56)
    2281                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2282                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2283                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x4f)
    2284                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2285                    
    2286                    
    2287                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    2288                            .dwattr $C$DW$T$58, DW_AT_name("List_Elem")
    2289                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    2290                    $C$DW$151       .dwtag  DW_TAG_member
    2291                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$57)
    2292                            .dwattr $C$DW$151, DW_AT_name("next")
    2293                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("next")
    2294                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2296                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/u
    2297                            .dwattr $C$DW$151, DW_AT_decl_line(0x7f)
    2298                            .dwattr $C$DW$151, DW_AT_decl_column(0x17)
    2299                    
    2300                    $C$DW$152       .dwtag  DW_TAG_member
    2301                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$57)
    2302                            .dwattr $C$DW$152, DW_AT_name("prev")
    2303                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("prev")
    2304                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2305                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2306                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/u
    2307                            .dwattr $C$DW$152, DW_AT_decl_line(0x80)
    2308                            .dwattr $C$DW$152, DW_AT_decl_column(0x17)
    2309                    
    2310                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   43

    2311                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x7e)
    2312                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    2313                            .dwendtag $C$DW$T$58
    2314                    
    2315                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2316                            .dwattr $C$DW$T$59, DW_AT_name("List_Elem")
    2317                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2318                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2319                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2320                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x81)
    2321                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    2322                    
    2323                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2324                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2325                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2326                    
    2327                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    2328                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$58)
    2329                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    2330                    
    2331                    
    2332                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    2333                            .dwattr $C$DW$T$61, DW_AT_name("List_List")
    2334                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
    2335                    $C$DW$153       .dwtag  DW_TAG_member
    2336                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$60)
    2337                            .dwattr $C$DW$153, DW_AT_name("head")
    2338                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("head")
    2339                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2341                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/u
    2342                            .dwattr $C$DW$153, DW_AT_decl_line(0x84)
    2343                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    2344                    
    2345                    $C$DW$154       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$60)
    2347                            .dwattr $C$DW$154, DW_AT_name("tail")
    2348                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("tail")
    2349                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2350                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/u
    2352                            .dwattr $C$DW$154, DW_AT_decl_line(0x85)
    2353                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2354                    
    2355                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2356                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x83)
    2357                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    2358                            .dwendtag $C$DW$T$61
    2359                    
    2360                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    2361                            .dwattr $C$DW$T$70, DW_AT_name("List_List")
    2362                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$61)
    2363                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2364                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2365                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x86)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   44

    2366                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    2367                    
    2368                    
    2369                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    2370                            .dwattr $C$DW$T$69, DW_AT_name("PowerCC26XX_Config")
    2371                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x18)
    2372                    $C$DW$155       .dwtag  DW_TAG_member
    2373                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$64)
    2374                            .dwattr $C$DW$155, DW_AT_name("policyInitFxn")
    2375                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("policyInitFxn")
    2376                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2378                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2379                            .dwattr $C$DW$155, DW_AT_decl_line(0x147)
    2380                            .dwattr $C$DW$155, DW_AT_decl_column(0x19)
    2381                    
    2382                    $C$DW$156       .dwtag  DW_TAG_member
    2383                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$65)
    2384                            .dwattr $C$DW$156, DW_AT_name("policyFxn")
    2385                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("policyFxn")
    2386                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2387                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2388                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2389                            .dwattr $C$DW$156, DW_AT_decl_line(0x15d)
    2390                            .dwattr $C$DW$156, DW_AT_decl_column(0x15)
    2391                    
    2392                    $C$DW$157       .dwtag  DW_TAG_member
    2393                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$67)
    2394                            .dwattr $C$DW$157, DW_AT_name("calibrateFxn")
    2395                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("calibrateFxn")
    2396                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2397                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2398                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2399                            .dwattr $C$DW$157, DW_AT_decl_line(0x169)
    2400                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2401                    
    2402                    $C$DW$158       .dwtag  DW_TAG_member
    2403                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$45)
    2404                            .dwattr $C$DW$158, DW_AT_name("maxStandbyDuration")
    2405                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("maxStandbyDuration")
    2406                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2407                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2408                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2409                            .dwattr $C$DW$158, DW_AT_decl_line(0x184)
    2410                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2411                    
    2412                    $C$DW$159       .dwtag  DW_TAG_member
    2413                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$68)
    2414                            .dwattr $C$DW$159, DW_AT_name("vddrRechargeMargin")
    2415                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("vddrRechargeMargin")
    2416                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2417                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2418                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2419                            .dwattr $C$DW$159, DW_AT_decl_line(0x195)
    2420                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   45

    2421                    
    2422                    $C$DW$160       .dwtag  DW_TAG_member
    2423                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$47)
    2424                            .dwattr $C$DW$160, DW_AT_name("enableMaxStandbyDuration")
    2425                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("enableMaxStandbyDuration")
    2426                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2427                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2428                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2429                            .dwattr $C$DW$160, DW_AT_decl_line(0x1a2)
    2430                            .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2431                    
    2432                    $C$DW$161       .dwtag  DW_TAG_member
    2433                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$47)
    2434                            .dwattr $C$DW$161, DW_AT_name("enablePolicy")
    2435                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("enablePolicy")
    2436                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2437                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2438                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2439                            .dwattr $C$DW$161, DW_AT_decl_line(0x1af)
    2440                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2441                    
    2442                    $C$DW$162       .dwtag  DW_TAG_member
    2443                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$47)
    2444                            .dwattr $C$DW$162, DW_AT_name("calibrateRCOSC_LF")
    2445                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("calibrateRCOSC_LF")
    2446                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2447                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2448                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2449                            .dwattr $C$DW$162, DW_AT_decl_line(0x1b8)
    2450                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2451                    
    2452                    $C$DW$163       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$47)
    2454                            .dwattr $C$DW$163, DW_AT_name("calibrateRCOSC_HF")
    2455                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("calibrateRCOSC_HF")
    2456                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2457                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2458                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2459                            .dwattr $C$DW$163, DW_AT_decl_line(0x1c1)
    2460                            .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2461                    
    2462                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2463                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x140)
    2464                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    2465                            .dwendtag $C$DW$T$69
    2466                    
    2467                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    2468                            .dwattr $C$DW$T$184, DW_AT_name("PowerCC26XX_Config")
    2469                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$69)
    2470                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    2471                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2472                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1c2)
    2473                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x03)
    2474                    
    2475                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   46

    2476                    $C$DW$T$81      .dwtag  DW_TAG_structure_type
    2477                            .dwattr $C$DW$T$81, DW_AT_name("PowerCC26XX_ModuleState")
    2478                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x114)
    2479                    $C$DW$164       .dwtag  DW_TAG_member
    2480                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$70)
    2481                            .dwattr $C$DW$164, DW_AT_name("notifyList")
    2482                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("notifyList")
    2483                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2485                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2486                            .dwattr $C$DW$164, DW_AT_decl_line(0x1cb)
    2487                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2488                    
    2489                    $C$DW$165       .dwtag  DW_TAG_member
    2490                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$45)
    2491                            .dwattr $C$DW$165, DW_AT_name("constraintMask")
    2492                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("constraintMask")
    2493                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2494                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2495                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2496                            .dwattr $C$DW$165, DW_AT_decl_line(0x1cc)
    2497                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2498                    
    2499                    $C$DW$166       .dwtag  DW_TAG_member
    2500                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$71)
    2501                            .dwattr $C$DW$166, DW_AT_name("clockObj")
    2502                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockObj")
    2503                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2504                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2505                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2506                            .dwattr $C$DW$166, DW_AT_decl_line(0x1cd)
    2507                            .dwattr $C$DW$166, DW_AT_decl_column(0x13)
    2508                    
    2509                    $C$DW$167       .dwtag  DW_TAG_member
    2510                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$71)
    2511                            .dwattr $C$DW$167, DW_AT_name("xoscClockObj")
    2512                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xoscClockObj")
    2513                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2514                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2515                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2516                            .dwattr $C$DW$167, DW_AT_decl_line(0x1ce)
    2517                            .dwattr $C$DW$167, DW_AT_decl_column(0x13)
    2518                    
    2519                    $C$DW$168       .dwtag  DW_TAG_member
    2520                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$71)
    2521                            .dwattr $C$DW$168, DW_AT_name("lfClockObj")
    2522                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("lfClockObj")
    2523                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2524                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2525                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2526                            .dwattr $C$DW$168, DW_AT_decl_line(0x1cf)
    2527                            .dwattr $C$DW$168, DW_AT_decl_column(0x13)
    2528                    
    2529                    $C$DW$169       .dwtag  DW_TAG_member
    2530                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$71)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   47

    2531                            .dwattr $C$DW$169, DW_AT_name("calClockStruct")
    2532                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("calClockStruct")
    2533                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2534                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2535                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2536                            .dwattr $C$DW$169, DW_AT_decl_line(0x1d0)
    2537                            .dwattr $C$DW$169, DW_AT_decl_column(0x13)
    2538                    
    2539                    $C$DW$170       .dwtag  DW_TAG_member
    2540                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$72)
    2541                            .dwattr $C$DW$170, DW_AT_name("hwiStruct")
    2542                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("hwiStruct")
    2543                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2544                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2545                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2546                            .dwattr $C$DW$170, DW_AT_decl_line(0x1d1)
    2547                            .dwattr $C$DW$170, DW_AT_decl_column(0x11)
    2548                    
    2549                    $C$DW$171       .dwtag  DW_TAG_member
    2550                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$74)
    2551                            .dwattr $C$DW$171, DW_AT_name("nDeltaFreqCurr")
    2552                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nDeltaFreqCurr")
    2553                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2554                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2555                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2556                            .dwattr $C$DW$171, DW_AT_decl_line(0x1d2)
    2557                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2558                    
    2559                    $C$DW$172       .dwtag  DW_TAG_member
    2560                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$74)
    2561                            .dwattr $C$DW$172, DW_AT_name("nCtrimCurr")
    2562                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("nCtrimCurr")
    2563                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2564                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2565                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2566                            .dwattr $C$DW$172, DW_AT_decl_line(0x1d3)
    2567                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2568                    
    2569                    $C$DW$173       .dwtag  DW_TAG_member
    2570                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$74)
    2571                            .dwattr $C$DW$173, DW_AT_name("nCtrimFractCurr")
    2572                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("nCtrimFractCurr")
    2573                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2574                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2575                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2576                            .dwattr $C$DW$173, DW_AT_decl_line(0x1d4)
    2577                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2578                    
    2579                    $C$DW$174       .dwtag  DW_TAG_member
    2580                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$74)
    2581                            .dwattr $C$DW$174, DW_AT_name("nCtrimNew")
    2582                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("nCtrimNew")
    2583                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2584                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   48

    2586                            .dwattr $C$DW$174, DW_AT_decl_line(0x1d5)
    2587                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2588                    
    2589                    $C$DW$175       .dwtag  DW_TAG_member
    2590                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$74)
    2591                            .dwattr $C$DW$175, DW_AT_name("nCtrimFractNew")
    2592                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("nCtrimFractNew")
    2593                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2594                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2595                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2596                            .dwattr $C$DW$175, DW_AT_decl_line(0x1d6)
    2597                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2598                    
    2599                    $C$DW$176       .dwtag  DW_TAG_member
    2600                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$74)
    2601                            .dwattr $C$DW$176, DW_AT_name("nRtrimNew")
    2602                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nRtrimNew")
    2603                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2604                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2605                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2606                            .dwattr $C$DW$176, DW_AT_decl_line(0x1d7)
    2607                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2608                    
    2609                    $C$DW$177       .dwtag  DW_TAG_member
    2610                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$74)
    2611                            .dwattr $C$DW$177, DW_AT_name("nRtrimCurr")
    2612                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nRtrimCurr")
    2613                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2614                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2615                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2616                            .dwattr $C$DW$177, DW_AT_decl_line(0x1d8)
    2617                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2618                    
    2619                    $C$DW$178       .dwtag  DW_TAG_member
    2620                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$74)
    2621                            .dwattr $C$DW$178, DW_AT_name("nDeltaFreqNew")
    2622                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("nDeltaFreqNew")
    2623                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2624                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2625                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2626                            .dwattr $C$DW$178, DW_AT_decl_line(0x1d9)
    2627                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    2628                    
    2629                    $C$DW$179       .dwtag  DW_TAG_member
    2630                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$47)
    2631                            .dwattr $C$DW$179, DW_AT_name("bRefine")
    2632                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bRefine")
    2633                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2634                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2635                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2636                            .dwattr $C$DW$179, DW_AT_decl_line(0x1da)
    2637                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2638                    
    2639                    $C$DW$180       .dwtag  DW_TAG_member
    2640                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   49

    2641                            .dwattr $C$DW$180, DW_AT_name("state")
    2642                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("state")
    2643                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2644                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2645                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2646                            .dwattr $C$DW$180, DW_AT_decl_line(0x1db)
    2647                            .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2648                    
    2649                    $C$DW$181       .dwtag  DW_TAG_member
    2650                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$47)
    2651                            .dwattr $C$DW$181, DW_AT_name("xoscPending")
    2652                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("xoscPending")
    2653                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2654                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2655                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2656                            .dwattr $C$DW$181, DW_AT_decl_line(0x1dc)
    2657                            .dwattr $C$DW$181, DW_AT_decl_column(0x0a)
    2658                    
    2659                    $C$DW$182       .dwtag  DW_TAG_member
    2660                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$47)
    2661                            .dwattr $C$DW$182, DW_AT_name("calLF")
    2662                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("calLF")
    2663                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe1]
    2664                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2665                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2666                            .dwattr $C$DW$182, DW_AT_decl_line(0x1dd)
    2667                            .dwattr $C$DW$182, DW_AT_decl_column(0x0a)
    2668                    
    2669                    $C$DW$183       .dwtag  DW_TAG_member
    2670                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$75)
    2671                            .dwattr $C$DW$183, DW_AT_name("hwiState")
    2672                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("hwiState")
    2673                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2674                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2675                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2676                            .dwattr $C$DW$183, DW_AT_decl_line(0x1de)
    2677                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2678                    
    2679                    $C$DW$184       .dwtag  DW_TAG_member
    2680                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$47)
    2681                            .dwattr $C$DW$184, DW_AT_name("busyCal")
    2682                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("busyCal")
    2683                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe3]
    2684                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2685                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2686                            .dwattr $C$DW$184, DW_AT_decl_line(0x1df)
    2687                            .dwattr $C$DW$184, DW_AT_decl_column(0x0a)
    2688                    
    2689                    $C$DW$185       .dwtag  DW_TAG_member
    2690                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$75)
    2691                            .dwattr $C$DW$185, DW_AT_name("calStep")
    2692                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("calStep")
    2693                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2694                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2695                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   50

    2696                            .dwattr $C$DW$185, DW_AT_decl_line(0x1e0)
    2697                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    2698                    
    2699                    $C$DW$186       .dwtag  DW_TAG_member
    2700                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$47)
    2701                            .dwattr $C$DW$186, DW_AT_name("firstLF")
    2702                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("firstLF")
    2703                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe5]
    2704                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2705                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2706                            .dwattr $C$DW$186, DW_AT_decl_line(0x1e1)
    2707                            .dwattr $C$DW$186, DW_AT_decl_column(0x0a)
    2708                    
    2709                    $C$DW$187       .dwtag  DW_TAG_member
    2710                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$47)
    2711                            .dwattr $C$DW$187, DW_AT_name("enablePolicy")
    2712                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("enablePolicy")
    2713                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2714                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2715                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2716                            .dwattr $C$DW$187, DW_AT_decl_line(0x1e2)
    2717                            .dwattr $C$DW$187, DW_AT_decl_column(0x0a)
    2718                    
    2719                    $C$DW$188       .dwtag  DW_TAG_member
    2720                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$47)
    2721                            .dwattr $C$DW$188, DW_AT_name("initialized")
    2722                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("initialized")
    2723                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe7]
    2724                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2725                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2726                            .dwattr $C$DW$188, DW_AT_decl_line(0x1e3)
    2727                            .dwattr $C$DW$188, DW_AT_decl_column(0x0a)
    2728                    
    2729                    $C$DW$189       .dwtag  DW_TAG_member
    2730                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$76)
    2731                            .dwattr $C$DW$189, DW_AT_name("constraintCounts")
    2732                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("constraintCounts")
    2733                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2734                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2735                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2736                            .dwattr $C$DW$189, DW_AT_decl_line(0x1e7)
    2737                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2738                    
    2739                    $C$DW$190       .dwtag  DW_TAG_member
    2740                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$77)
    2741                            .dwattr $C$DW$190, DW_AT_name("resourceCounts")
    2742                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("resourceCounts")
    2743                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2744                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2745                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2746                            .dwattr $C$DW$190, DW_AT_decl_line(0x1e9)
    2747                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2748                    
    2749                    $C$DW$191       .dwtag  DW_TAG_member
    2750                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$80)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   51

    2751                            .dwattr $C$DW$191, DW_AT_name("resourceHandlers")
    2752                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("resourceHandlers")
    2753                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2754                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2755                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2756                            .dwattr $C$DW$191, DW_AT_decl_line(0x1eb)
    2757                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2758                    
    2759                    $C$DW$192       .dwtag  DW_TAG_member
    2760                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$65)
    2761                            .dwattr $C$DW$192, DW_AT_name("policyFxn")
    2762                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("policyFxn")
    2763                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2764                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2765                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2766                            .dwattr $C$DW$192, DW_AT_decl_line(0x1ed)
    2767                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2768                    
    2769                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2770                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x1ca)
    2771                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
    2772                            .dwendtag $C$DW$T$81
    2773                    
    2774                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    2775                            .dwattr $C$DW$T$185, DW_AT_name("PowerCC26XX_ModuleState")
    2776                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$81)
    2777                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    2778                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2779                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x1ee)
    2780                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x03)
    2781                    
    2782                    
    2783                    $C$DW$T$82      .dwtag  DW_TAG_structure_type
    2784                            .dwattr $C$DW$T$82, DW_AT_name("PowerCC26XX_ResourceRecord")
    2785                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x04)
    2786                    $C$DW$193       .dwtag  DW_TAG_member
    2787                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$75)
    2788                            .dwattr $C$DW$193, DW_AT_name("flags")
    2789                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flags")
    2790                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2792                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2793                            .dwattr $C$DW$193, DW_AT_decl_line(0x13a)
    2794                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2795                    
    2796                    $C$DW$194       .dwtag  DW_TAG_member
    2797                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$68)
    2798                            .dwattr $C$DW$194, DW_AT_name("driverlibID")
    2799                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("driverlibID")
    2800                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2801                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2802                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/p
    2803                            .dwattr $C$DW$194, DW_AT_decl_line(0x13b)
    2804                            .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2805                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EAE5C80A-95F4-4830-8AD5-3F5837318C3E} PAGE   52

    2806                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    2807                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x139)
    2808                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
    2809                            .dwendtag $C$DW$T$82
    2810                    
    2811                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    2812                            .dwattr $C$DW$T$186, DW_AT_name("PowerCC26XX_ResourceRecord")
    2813                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$82)
    2814                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    2815                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers
    2816                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x13c)
    2817                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    2818                    
    2819                    
    2820                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    2821                            .dwattr $C$DW$T$90, DW_AT_name("Power_NotifyObj_")
    2822                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x14)
    2823                    $C$DW$195       .dwtag  DW_TAG_member
    2824                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$59)
    2825                            .dwattr $C$DW$195, DW_AT_name("link")
    2826                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("link")
    2827                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2829                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/P
    2830                            .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    2831                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2832                    
    2833                    $C$DW$196       .dwtag  DW_TAG_member
    2834                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$84)
    2835                            .dwattr $C$DW$196, DW_AT_name("eventTypes")
    2836                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("eventTypes")
    2837                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2838                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
