TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:43 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5430                    $C$DW$465       .dwtag  DW_TAG_enumerator
    5431                            .dwattr $C$DW$465, DW_AT_name("MAC_RADIO_CC1312")
    5432                            .dwattr $C$DW$465, DW_AT_const_value(0x01)
    5433                            .dwattr $C$DW$465, DW_AT_decl_file("..\Application\mac_user_config.h")
    5434                            .dwattr $C$DW$465, DW_AT_decl_line(0x119)
    5435                            .dwattr $C$DW$465, DW_AT_decl_column(0x05)
    5436                    
    5437                    $C$DW$466       .dwtag  DW_TAG_enumerator
    5438                            .dwattr $C$DW$466, DW_AT_name("MAC_RADIO_CC1352P")
    5439                            .dwattr $C$DW$466, DW_AT_const_value(0x02)
    5440                            .dwattr $C$DW$466, DW_AT_decl_file("..\Application\mac_user_config.h")
    5441                            .dwattr $C$DW$466, DW_AT_decl_line(0x11a)
    5442                            .dwattr $C$DW$466, DW_AT_decl_column(0x05)
    5443                    
    5444                    $C$DW$467       .dwtag  DW_TAG_enumerator
    5445                            .dwattr $C$DW$467, DW_AT_name("MAC_RADIO_CCXXX2")
    5446                            .dwattr $C$DW$467, DW_AT_const_value(0x00)
    5447                            .dwattr $C$DW$467, DW_AT_decl_file("..\Application\mac_user_config.h")
    5448                            .dwattr $C$DW$467, DW_AT_decl_line(0x11b)
    5449                            .dwattr $C$DW$467, DW_AT_decl_column(0x05)
    5450                    
    5451                            .dwattr $C$DW$T$776, DW_AT_decl_file("..\Application\mac_user_config.h")
    5452                            .dwattr $C$DW$T$776, DW_AT_decl_line(0x114)
    5453                            .dwattr $C$DW$T$776, DW_AT_decl_column(0x01)
    5454                            .dwendtag $C$DW$T$776
    5455                    
    5456                    $C$DW$T$777     .dwtag  DW_TAG_typedef
    5457                            .dwattr $C$DW$T$777, DW_AT_name("macChipType_t")
    5458                            .dwattr $C$DW$T$777, DW_AT_type(*$C$DW$T$776)
    5459                            .dwattr $C$DW$T$777, DW_AT_language(DW_LANG_C)
    5460                            .dwattr $C$DW$T$777, DW_AT_decl_file("..\Application\mac_user_config.h")
    5461                            .dwattr $C$DW$T$777, DW_AT_decl_line(0x11c)
    5462                            .dwattr $C$DW$T$777, DW_AT_decl_column(0x03)
    5463                    
    5464                    
    5465                    $C$DW$T$778     .dwtag  DW_TAG_enumeration_type
    5466                            .dwattr $C$DW$T$778, DW_AT_byte_size(0x01)
    5467                    $C$DW$468       .dwtag  DW_TAG_enumerator
    5468                            .dwattr $C$DW$468, DW_AT_name("MAC_HW_REV_21")
    5469                            .dwattr $C$DW$468, DW_AT_const_value(0x00)
    5470                            .dwattr $C$DW$468, DW_AT_decl_file("..\Application\mac_user_config.h")
    5471                            .dwattr $C$DW$468, DW_AT_decl_line(0x121)
    5472                            .dwattr $C$DW$468, DW_AT_decl_column(0x05)
    5473                    
    5474                    $C$DW$469       .dwtag  DW_TAG_enumerator
    5475                            .dwattr $C$DW$469, DW_AT_name("MAC_HW_REV_20")
    5476                            .dwattr $C$DW$469, DW_AT_const_value(0x01)
    5477                            .dwattr $C$DW$469, DW_AT_decl_file("..\Application\mac_user_config.h")
    5478                            .dwattr $C$DW$469, DW_AT_decl_line(0x122)
    5479                            .dwattr $C$DW$469, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  102

    5480                    
    5481                    $C$DW$470       .dwtag  DW_TAG_enumerator
    5482                            .dwattr $C$DW$470, DW_AT_name("MAC_HW_MAX_REVS")
    5483                            .dwattr $C$DW$470, DW_AT_const_value(0x02)
    5484                            .dwattr $C$DW$470, DW_AT_decl_file("..\Application\mac_user_config.h")
    5485                            .dwattr $C$DW$470, DW_AT_decl_line(0x123)
    5486                            .dwattr $C$DW$470, DW_AT_decl_column(0x05)
    5487                    
    5488                            .dwattr $C$DW$T$778, DW_AT_decl_file("..\Application\mac_user_config.h")
    5489                            .dwattr $C$DW$T$778, DW_AT_decl_line(0x120)
    5490                            .dwattr $C$DW$T$778, DW_AT_decl_column(0x01)
    5491                            .dwendtag $C$DW$T$778
    5492                    
    5493                    $C$DW$T$779     .dwtag  DW_TAG_typedef
    5494                            .dwattr $C$DW$T$779, DW_AT_name("macHwRevision_t")
    5495                            .dwattr $C$DW$T$779, DW_AT_type(*$C$DW$T$778)
    5496                            .dwattr $C$DW$T$779, DW_AT_language(DW_LANG_C)
    5497                            .dwattr $C$DW$T$779, DW_AT_decl_file("..\Application\mac_user_config.h")
    5498                            .dwattr $C$DW$T$779, DW_AT_decl_line(0x124)
    5499                            .dwattr $C$DW$T$779, DW_AT_decl_column(0x03)
    5500                    
    5501                    
    5502                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5503                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    5504                    $C$DW$471       .dwtag  DW_TAG_member
    5505                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$22)
    5506                            .dwattr $C$DW$471, DW_AT_name("rfMode")
    5507                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("rfMode")
    5508                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5509                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5510                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5511                            .dwattr $C$DW$471, DW_AT_decl_line(0x41e)
    5512                            .dwattr $C$DW$471, DW_AT_decl_column(0x0d)
    5513                    
    5514                    $C$DW$472       .dwtag  DW_TAG_member
    5515                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
    5516                            .dwattr $C$DW$472, DW_AT_name("cpePatchFxn")
    5517                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("cpePatchFxn")
    5518                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5519                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5520                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5521                            .dwattr $C$DW$472, DW_AT_decl_line(0x41f)
    5522                            .dwattr $C$DW$472, DW_AT_decl_column(0x0c)
    5523                    
    5524                    $C$DW$473       .dwtag  DW_TAG_member
    5525                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$24)
    5526                            .dwattr $C$DW$473, DW_AT_name("mcePatchFxn")
    5527                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("mcePatchFxn")
    5528                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5529                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5530                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5531                            .dwattr $C$DW$473, DW_AT_decl_line(0x420)
    5532                            .dwattr $C$DW$473, DW_AT_decl_column(0x0c)
    5533                    
    5534                    $C$DW$474       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  103

    5535                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$24)
    5536                            .dwattr $C$DW$474, DW_AT_name("rfePatchFxn")
    5537                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rfePatchFxn")
    5538                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5539                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5540                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    5541                            .dwattr $C$DW$474, DW_AT_decl_line(0x421)
    5542                            .dwattr $C$DW$474, DW_AT_decl_column(0x0c)
    5543                    
    5544                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    5545                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x41d)
    5546                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5547                            .dwendtag $C$DW$T$25
    5548                    
    5549                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    5550                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    5551                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    5552                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5553                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    5554                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x422)
    5555                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    5556                    
    5557                    $C$DW$T$780     .dwtag  DW_TAG_const_type
    5558                            .dwattr $C$DW$T$780, DW_AT_type(*$C$DW$T$49)
    5559                    
    5560                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    5561                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    5562                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    5563                    
    5564                    
    5565                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5566                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5567                    $C$DW$475       .dwtag  DW_TAG_member
    5568                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
    5569                            .dwattr $C$DW$475, DW_AT_name("triggerType")
    5570                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("triggerType")
    5571                            .dwattr $C$DW$475, DW_AT_bit_offset(0x04)
    5572                            .dwattr $C$DW$475, DW_AT_bit_size(0x04)
    5573                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5574                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5575                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5576                            .dwattr $C$DW$475, DW_AT_decl_line(0x7d)
    5577                            .dwattr $C$DW$475, DW_AT_decl_column(0x0f)
    5578                    
    5579                    $C$DW$476       .dwtag  DW_TAG_member
    5580                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$22)
    5581                            .dwattr $C$DW$476, DW_AT_name("bEnaCmd")
    5582                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("bEnaCmd")
    5583                            .dwattr $C$DW$476, DW_AT_bit_offset(0x03)
    5584                            .dwattr $C$DW$476, DW_AT_bit_size(0x01)
    5585                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5586                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5587                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5588                            .dwattr $C$DW$476, DW_AT_decl_line(0x7e)
    5589                            .dwattr $C$DW$476, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  104

    5590                    
    5591                    $C$DW$477       .dwtag  DW_TAG_member
    5592                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
    5593                            .dwattr $C$DW$477, DW_AT_name("triggerNo")
    5594                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("triggerNo")
    5595                            .dwattr $C$DW$477, DW_AT_bit_offset(0x01)
    5596                            .dwattr $C$DW$477, DW_AT_bit_size(0x02)
    5597                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5598                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5599                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5600                            .dwattr $C$DW$477, DW_AT_decl_line(0x80)
    5601                            .dwattr $C$DW$477, DW_AT_decl_column(0x0f)
    5602                    
    5603                    $C$DW$478       .dwtag  DW_TAG_member
    5604                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    5605                            .dwattr $C$DW$478, DW_AT_name("pastTrig")
    5606                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("pastTrig")
    5607                            .dwattr $C$DW$478, DW_AT_bit_offset(0x00)
    5608                            .dwattr $C$DW$478, DW_AT_bit_size(0x01)
    5609                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5610                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5611                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5612                            .dwattr $C$DW$478, DW_AT_decl_line(0x81)
    5613                            .dwattr $C$DW$478, DW_AT_decl_column(0x0f)
    5614                    
    5615                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5616                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    5617                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    5618                            .dwendtag $C$DW$T$26
    5619                    
    5620                    
    5621                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5622                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5623                    $C$DW$479       .dwtag  DW_TAG_member
    5624                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$22)
    5625                            .dwattr $C$DW$479, DW_AT_name("rule")
    5626                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("rule")
    5627                            .dwattr $C$DW$479, DW_AT_bit_offset(0x04)
    5628                            .dwattr $C$DW$479, DW_AT_bit_size(0x04)
    5629                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5630                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5631                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5632                            .dwattr $C$DW$479, DW_AT_decl_line(0x85)
    5633                            .dwattr $C$DW$479, DW_AT_decl_column(0x0f)
    5634                    
    5635                    $C$DW$480       .dwtag  DW_TAG_member
    5636                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    5637                            .dwattr $C$DW$480, DW_AT_name("nSkip")
    5638                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("nSkip")
    5639                            .dwattr $C$DW$480, DW_AT_bit_offset(0x00)
    5640                            .dwattr $C$DW$480, DW_AT_bit_size(0x04)
    5641                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5642                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5643                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5644                            .dwattr $C$DW$480, DW_AT_decl_line(0x86)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  105

    5645                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    5646                    
    5647                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5648                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    5649                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    5650                            .dwendtag $C$DW$T$27
    5651                    
    5652                    
    5653                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5654                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5655                    $C$DW$481       .dwtag  DW_TAG_member
    5656                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
    5657                            .dwattr $C$DW$481, DW_AT_name("triggerType")
    5658                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("triggerType")
    5659                            .dwattr $C$DW$481, DW_AT_bit_offset(0x04)
    5660                            .dwattr $C$DW$481, DW_AT_bit_size(0x04)
    5661                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5662                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5663                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5664                            .dwattr $C$DW$481, DW_AT_decl_line(0xb3)
    5665                            .dwattr $C$DW$481, DW_AT_decl_column(0x0f)
    5666                    
    5667                    $C$DW$482       .dwtag  DW_TAG_member
    5668                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$22)
    5669                            .dwattr $C$DW$482, DW_AT_name("bEnaCmd")
    5670                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("bEnaCmd")
    5671                            .dwattr $C$DW$482, DW_AT_bit_offset(0x03)
    5672                            .dwattr $C$DW$482, DW_AT_bit_size(0x01)
    5673                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5674                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5675                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5676                            .dwattr $C$DW$482, DW_AT_decl_line(0xb4)
    5677                            .dwattr $C$DW$482, DW_AT_decl_column(0x0f)
    5678                    
    5679                    $C$DW$483       .dwtag  DW_TAG_member
    5680                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
    5681                            .dwattr $C$DW$483, DW_AT_name("triggerNo")
    5682                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("triggerNo")
    5683                            .dwattr $C$DW$483, DW_AT_bit_offset(0x01)
    5684                            .dwattr $C$DW$483, DW_AT_bit_size(0x02)
    5685                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5686                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5687                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5688                            .dwattr $C$DW$483, DW_AT_decl_line(0xb6)
    5689                            .dwattr $C$DW$483, DW_AT_decl_column(0x0f)
    5690                    
    5691                    $C$DW$484       .dwtag  DW_TAG_member
    5692                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$22)
    5693                            .dwattr $C$DW$484, DW_AT_name("pastTrig")
    5694                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("pastTrig")
    5695                            .dwattr $C$DW$484, DW_AT_bit_offset(0x00)
    5696                            .dwattr $C$DW$484, DW_AT_bit_size(0x01)
    5697                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5698                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5699                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  106

    5700                            .dwattr $C$DW$484, DW_AT_decl_line(0xb7)
    5701                            .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    5702                    
    5703                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5704                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    5705                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    5706                            .dwendtag $C$DW$T$28
    5707                    
    5708                    
    5709                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5710                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5711                    $C$DW$485       .dwtag  DW_TAG_member
    5712                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$22)
    5713                            .dwattr $C$DW$485, DW_AT_name("rule")
    5714                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("rule")
    5715                            .dwattr $C$DW$485, DW_AT_bit_offset(0x04)
    5716                            .dwattr $C$DW$485, DW_AT_bit_size(0x04)
    5717                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5718                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5719                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5720                            .dwattr $C$DW$485, DW_AT_decl_line(0xbb)
    5721                            .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    5722                    
    5723                    $C$DW$486       .dwtag  DW_TAG_member
    5724                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
    5725                            .dwattr $C$DW$486, DW_AT_name("nSkip")
    5726                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("nSkip")
    5727                            .dwattr $C$DW$486, DW_AT_bit_offset(0x00)
    5728                            .dwattr $C$DW$486, DW_AT_bit_size(0x04)
    5729                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5730                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5731                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5732                            .dwattr $C$DW$486, DW_AT_decl_line(0xbc)
    5733                            .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    5734                    
    5735                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5736                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    5737                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    5738                            .dwendtag $C$DW$T$29
    5739                    
    5740                    
    5741                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5742                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5743                    $C$DW$487       .dwtag  DW_TAG_member
    5744                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$31)
    5745                            .dwattr $C$DW$487, DW_AT_name("frontEndMode")
    5746                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("frontEndMode")
    5747                            .dwattr $C$DW$487, DW_AT_bit_offset(0x0d)
    5748                            .dwattr $C$DW$487, DW_AT_bit_size(0x03)
    5749                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5750                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5751                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5752                            .dwattr $C$DW$487, DW_AT_decl_line(0xc9)
    5753                            .dwattr $C$DW$487, DW_AT_decl_column(0x10)
    5754                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  107

    5755                    $C$DW$488       .dwtag  DW_TAG_member
    5756                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$31)
    5757                            .dwattr $C$DW$488, DW_AT_name("biasMode")
    5758                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("biasMode")
    5759                            .dwattr $C$DW$488, DW_AT_bit_offset(0x0c)
    5760                            .dwattr $C$DW$488, DW_AT_bit_size(0x01)
    5761                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5762                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5763                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5764                            .dwattr $C$DW$488, DW_AT_decl_line(0xcf)
    5765                            .dwattr $C$DW$488, DW_AT_decl_column(0x10)
    5766                    
    5767                    $C$DW$489       .dwtag  DW_TAG_member
    5768                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$31)
    5769                            .dwattr $C$DW$489, DW_AT_name("analogCfgMode")
    5770                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("analogCfgMode")
    5771                            .dwattr $C$DW$489, DW_AT_bit_offset(0x06)
    5772                            .dwattr $C$DW$489, DW_AT_bit_size(0x06)
    5773                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5774                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5775                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5776                            .dwattr $C$DW$489, DW_AT_decl_line(0xd1)
    5777                            .dwattr $C$DW$489, DW_AT_decl_column(0x10)
    5778                    
    5779                    $C$DW$490       .dwtag  DW_TAG_member
    5780                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$31)
    5781                            .dwattr $C$DW$490, DW_AT_name("bNoFsPowerUp")
    5782                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5783                            .dwattr $C$DW$490, DW_AT_bit_offset(0x05)
    5784                            .dwattr $C$DW$490, DW_AT_bit_size(0x01)
    5785                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5786                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5787                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5788                            .dwattr $C$DW$490, DW_AT_decl_line(0xd8)
    5789                            .dwattr $C$DW$490, DW_AT_decl_column(0x10)
    5790                    
    5791                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5792                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    5793                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    5794                            .dwendtag $C$DW$T$32
    5795                    
    5796                    
    5797                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5798                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5799                    $C$DW$491       .dwtag  DW_TAG_member
    5800                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$22)
    5801                            .dwattr $C$DW$491, DW_AT_name("triggerType")
    5802                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("triggerType")
    5803                            .dwattr $C$DW$491, DW_AT_bit_offset(0x04)
    5804                            .dwattr $C$DW$491, DW_AT_bit_size(0x04)
    5805                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5806                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5807                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5808                            .dwattr $C$DW$491, DW_AT_decl_line(0x1cf)
    5809                            .dwattr $C$DW$491, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  108

    5810                    
    5811                    $C$DW$492       .dwtag  DW_TAG_member
    5812                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
    5813                            .dwattr $C$DW$492, DW_AT_name("bEnaCmd")
    5814                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("bEnaCmd")
    5815                            .dwattr $C$DW$492, DW_AT_bit_offset(0x03)
    5816                            .dwattr $C$DW$492, DW_AT_bit_size(0x01)
    5817                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5818                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5819                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5820                            .dwattr $C$DW$492, DW_AT_decl_line(0x1d0)
    5821                            .dwattr $C$DW$492, DW_AT_decl_column(0x0f)
    5822                    
    5823                    $C$DW$493       .dwtag  DW_TAG_member
    5824                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$22)
    5825                            .dwattr $C$DW$493, DW_AT_name("triggerNo")
    5826                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("triggerNo")
    5827                            .dwattr $C$DW$493, DW_AT_bit_offset(0x01)
    5828                            .dwattr $C$DW$493, DW_AT_bit_size(0x02)
    5829                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5830                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5831                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5832                            .dwattr $C$DW$493, DW_AT_decl_line(0x1d2)
    5833                            .dwattr $C$DW$493, DW_AT_decl_column(0x0f)
    5834                    
    5835                    $C$DW$494       .dwtag  DW_TAG_member
    5836                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$22)
    5837                            .dwattr $C$DW$494, DW_AT_name("pastTrig")
    5838                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("pastTrig")
    5839                            .dwattr $C$DW$494, DW_AT_bit_offset(0x00)
    5840                            .dwattr $C$DW$494, DW_AT_bit_size(0x01)
    5841                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5842                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5843                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5844                            .dwattr $C$DW$494, DW_AT_decl_line(0x1d3)
    5845                            .dwattr $C$DW$494, DW_AT_decl_column(0x0f)
    5846                    
    5847                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5848                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    5849                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    5850                            .dwendtag $C$DW$T$33
    5851                    
    5852                    
    5853                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5854                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5855                    $C$DW$495       .dwtag  DW_TAG_member
    5856                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$22)
    5857                            .dwattr $C$DW$495, DW_AT_name("rule")
    5858                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("rule")
    5859                            .dwattr $C$DW$495, DW_AT_bit_offset(0x04)
    5860                            .dwattr $C$DW$495, DW_AT_bit_size(0x04)
    5861                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5862                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5863                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5864                            .dwattr $C$DW$495, DW_AT_decl_line(0x1d7)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  109

    5865                            .dwattr $C$DW$495, DW_AT_decl_column(0x0f)
    5866                    
    5867                    $C$DW$496       .dwtag  DW_TAG_member
    5868                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    5869                            .dwattr $C$DW$496, DW_AT_name("nSkip")
    5870                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("nSkip")
    5871                            .dwattr $C$DW$496, DW_AT_bit_offset(0x00)
    5872                            .dwattr $C$DW$496, DW_AT_bit_size(0x04)
    5873                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5874                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5875                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5876                            .dwattr $C$DW$496, DW_AT_decl_line(0x1d8)
    5877                            .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    5878                    
    5879                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5880                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    5881                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    5882                            .dwendtag $C$DW$T$34
    5883                    
    5884                    
    5885                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5886                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    5887                    $C$DW$497       .dwtag  DW_TAG_member
    5888                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$31)
    5889                            .dwattr $C$DW$497, DW_AT_name("modType")
    5890                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("modType")
    5891                            .dwattr $C$DW$497, DW_AT_bit_offset(0x0d)
    5892                            .dwattr $C$DW$497, DW_AT_bit_size(0x03)
    5893                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5894                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5895                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5896                            .dwattr $C$DW$497, DW_AT_decl_line(0x1db)
    5897                            .dwattr $C$DW$497, DW_AT_decl_column(0x10)
    5898                    
    5899                    $C$DW$498       .dwtag  DW_TAG_member
    5900                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$31)
    5901                            .dwattr $C$DW$498, DW_AT_name("deviation")
    5902                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("deviation")
    5903                            .dwattr $C$DW$498, DW_AT_bit_offset(0x00)
    5904                            .dwattr $C$DW$498, DW_AT_bit_size(0x0d)
    5905                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5906                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5907                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5908                            .dwattr $C$DW$498, DW_AT_decl_line(0x1de)
    5909                            .dwattr $C$DW$498, DW_AT_decl_column(0x10)
    5910                    
    5911                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5912                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    5913                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    5914                            .dwendtag $C$DW$T$35
    5915                    
    5916                    
    5917                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5918                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    5919                    $C$DW$499       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  110

    5920                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$37)
    5921                            .dwattr $C$DW$499, DW_AT_name("preScale")
    5922                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("preScale")
    5923                            .dwattr $C$DW$499, DW_AT_bit_offset(0x1c)
    5924                            .dwattr $C$DW$499, DW_AT_bit_size(0x04)
    5925                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5926                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5927                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5928                            .dwattr $C$DW$499, DW_AT_decl_line(0x1e1)
    5929                            .dwattr $C$DW$499, DW_AT_decl_column(0x10)
    5930                    
    5931                    $C$DW$500       .dwtag  DW_TAG_member
    5932                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$37)
    5933                            .dwattr $C$DW$500, DW_AT_name("rateWord")
    5934                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("rateWord")
    5935                            .dwattr $C$DW$500, DW_AT_bit_offset(0x03)
    5936                            .dwattr $C$DW$500, DW_AT_bit_size(0x15)
    5937                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5938                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5939                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5940                            .dwattr $C$DW$500, DW_AT_decl_line(0x1e3)
    5941                            .dwattr $C$DW$500, DW_AT_decl_column(0x10)
    5942                    
    5943                    $C$DW$501       .dwtag  DW_TAG_member
    5944                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$37)
    5945                            .dwattr $C$DW$501, DW_AT_name("decimMode")
    5946                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("decimMode")
    5947                            .dwattr $C$DW$501, DW_AT_bit_offset(0x00)
    5948                            .dwattr $C$DW$501, DW_AT_bit_size(0x03)
    5949                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5950                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5951                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5952                            .dwattr $C$DW$501, DW_AT_decl_line(0x1e4)
    5953                            .dwattr $C$DW$501, DW_AT_decl_column(0x10)
    5954                    
    5955                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5956                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    5957                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    5958                            .dwendtag $C$DW$T$38
    5959                    
    5960                    
    5961                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5962                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    5963                    $C$DW$502       .dwtag  DW_TAG_member
    5964                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$22)
    5965                            .dwattr $C$DW$502, DW_AT_name("nPreamBytes")
    5966                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("nPreamBytes")
    5967                            .dwattr $C$DW$502, DW_AT_bit_offset(0x02)
    5968                            .dwattr $C$DW$502, DW_AT_bit_size(0x06)
    5969                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5970                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5971                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5972                            .dwattr $C$DW$502, DW_AT_decl_line(0x1ec)
    5973                            .dwattr $C$DW$502, DW_AT_decl_column(0x0f)
    5974                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  111

    5975                    $C$DW$503       .dwtag  DW_TAG_member
    5976                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$22)
    5977                            .dwattr $C$DW$503, DW_AT_name("preamMode")
    5978                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("preamMode")
    5979                            .dwattr $C$DW$503, DW_AT_bit_offset(0x00)
    5980                            .dwattr $C$DW$503, DW_AT_bit_size(0x02)
    5981                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5982                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5983                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    5984                            .dwattr $C$DW$503, DW_AT_decl_line(0x1f2)
    5985                            .dwattr $C$DW$503, DW_AT_decl_column(0x0f)
    5986                    
    5987                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    5988                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    5989                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    5990                            .dwendtag $C$DW$T$39
    5991                    
    5992                    
    5993                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5994                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    5995                    $C$DW$504       .dwtag  DW_TAG_member
    5996                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$31)
    5997                            .dwattr $C$DW$504, DW_AT_name("nSwBits")
    5998                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("nSwBits")
    5999                            .dwattr $C$DW$504, DW_AT_bit_offset(0x0a)
    6000                            .dwattr $C$DW$504, DW_AT_bit_size(0x06)
    6001                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6002                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6003                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6004                            .dwattr $C$DW$504, DW_AT_decl_line(0x1f8)
    6005                            .dwattr $C$DW$504, DW_AT_decl_column(0x10)
    6006                    
    6007                    $C$DW$505       .dwtag  DW_TAG_member
    6008                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$31)
    6009                            .dwattr $C$DW$505, DW_AT_name("bBitReversal")
    6010                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("bBitReversal")
    6011                            .dwattr $C$DW$505, DW_AT_bit_offset(0x09)
    6012                            .dwattr $C$DW$505, DW_AT_bit_size(0x01)
    6013                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6014                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6015                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6016                            .dwattr $C$DW$505, DW_AT_decl_line(0x1f9)
    6017                            .dwattr $C$DW$505, DW_AT_decl_column(0x10)
    6018                    
    6019                    $C$DW$506       .dwtag  DW_TAG_member
    6020                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$31)
    6021                            .dwattr $C$DW$506, DW_AT_name("bMsbFirst")
    6022                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("bMsbFirst")
    6023                            .dwattr $C$DW$506, DW_AT_bit_offset(0x08)
    6024                            .dwattr $C$DW$506, DW_AT_bit_size(0x01)
    6025                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6026                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6027                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6028                            .dwattr $C$DW$506, DW_AT_decl_line(0x1fb)
    6029                            .dwattr $C$DW$506, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  112

    6030                    
    6031                    $C$DW$507       .dwtag  DW_TAG_member
    6032                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$31)
    6033                            .dwattr $C$DW$507, DW_AT_name("fecMode")
    6034                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("fecMode")
    6035                            .dwattr $C$DW$507, DW_AT_bit_offset(0x04)
    6036                            .dwattr $C$DW$507, DW_AT_bit_size(0x04)
    6037                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6038                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6039                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6040                            .dwattr $C$DW$507, DW_AT_decl_line(0x1fd)
    6041                            .dwattr $C$DW$507, DW_AT_decl_column(0x10)
    6042                    
    6043                    $C$DW$508       .dwtag  DW_TAG_member
    6044                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$31)
    6045                            .dwattr $C$DW$508, DW_AT_name("whitenMode")
    6046                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("whitenMode")
    6047                            .dwattr $C$DW$508, DW_AT_bit_offset(0x00)
    6048                            .dwattr $C$DW$508, DW_AT_bit_size(0x03)
    6049                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6050                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6051                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6052                            .dwattr $C$DW$508, DW_AT_decl_line(0x203)
    6053                            .dwattr $C$DW$508, DW_AT_decl_column(0x10)
    6054                    
    6055                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6056                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
    6057                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    6058                            .dwendtag $C$DW$T$40
    6059                    
    6060                    
    6061                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6062                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    6063                    $C$DW$509       .dwtag  DW_TAG_member
    6064                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$31)
    6065                            .dwattr $C$DW$509, DW_AT_name("frontEndMode")
    6066                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("frontEndMode")
    6067                            .dwattr $C$DW$509, DW_AT_bit_offset(0x0d)
    6068                            .dwattr $C$DW$509, DW_AT_bit_size(0x03)
    6069                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6070                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6071                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6072                            .dwattr $C$DW$509, DW_AT_decl_line(0x20d)
    6073                            .dwattr $C$DW$509, DW_AT_decl_column(0x10)
    6074                    
    6075                    $C$DW$510       .dwtag  DW_TAG_member
    6076                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$31)
    6077                            .dwattr $C$DW$510, DW_AT_name("biasMode")
    6078                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("biasMode")
    6079                            .dwattr $C$DW$510, DW_AT_bit_offset(0x0c)
    6080                            .dwattr $C$DW$510, DW_AT_bit_size(0x01)
    6081                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6082                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6083                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6084                            .dwattr $C$DW$510, DW_AT_decl_line(0x213)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  113

    6085                            .dwattr $C$DW$510, DW_AT_decl_column(0x10)
    6086                    
    6087                    $C$DW$511       .dwtag  DW_TAG_member
    6088                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$31)
    6089                            .dwattr $C$DW$511, DW_AT_name("analogCfgMode")
    6090                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("analogCfgMode")
    6091                            .dwattr $C$DW$511, DW_AT_bit_offset(0x06)
    6092                            .dwattr $C$DW$511, DW_AT_bit_size(0x06)
    6093                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6094                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6095                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6096                            .dwattr $C$DW$511, DW_AT_decl_line(0x215)
    6097                            .dwattr $C$DW$511, DW_AT_decl_column(0x10)
    6098                    
    6099                    $C$DW$512       .dwtag  DW_TAG_member
    6100                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$31)
    6101                            .dwattr $C$DW$512, DW_AT_name("bNoFsPowerUp")
    6102                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6103                            .dwattr $C$DW$512, DW_AT_bit_offset(0x05)
    6104                            .dwattr $C$DW$512, DW_AT_bit_size(0x01)
    6105                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6106                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6107                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6108                            .dwattr $C$DW$512, DW_AT_decl_line(0x21c)
    6109                            .dwattr $C$DW$512, DW_AT_decl_column(0x10)
    6110                    
    6111                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6112                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    6113                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    6114                            .dwendtag $C$DW$T$41
    6115                    
    6116                    
    6117                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6118                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    6119                    $C$DW$513       .dwtag  DW_TAG_member
    6120                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$22)
    6121                            .dwattr $C$DW$513, DW_AT_name("triggerType")
    6122                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("triggerType")
    6123                            .dwattr $C$DW$513, DW_AT_bit_offset(0x04)
    6124                            .dwattr $C$DW$513, DW_AT_bit_size(0x04)
    6125                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6126                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6127                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6128                            .dwattr $C$DW$513, DW_AT_decl_line(0x232)
    6129                            .dwattr $C$DW$513, DW_AT_decl_column(0x0f)
    6130                    
    6131                    $C$DW$514       .dwtag  DW_TAG_member
    6132                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$22)
    6133                            .dwattr $C$DW$514, DW_AT_name("bEnaCmd")
    6134                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("bEnaCmd")
    6135                            .dwattr $C$DW$514, DW_AT_bit_offset(0x03)
    6136                            .dwattr $C$DW$514, DW_AT_bit_size(0x01)
    6137                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6138                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6139                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  114

    6140                            .dwattr $C$DW$514, DW_AT_decl_line(0x233)
    6141                            .dwattr $C$DW$514, DW_AT_decl_column(0x0f)
    6142                    
    6143                    $C$DW$515       .dwtag  DW_TAG_member
    6144                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
    6145                            .dwattr $C$DW$515, DW_AT_name("triggerNo")
    6146                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("triggerNo")
    6147                            .dwattr $C$DW$515, DW_AT_bit_offset(0x01)
    6148                            .dwattr $C$DW$515, DW_AT_bit_size(0x02)
    6149                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6150                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6151                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6152                            .dwattr $C$DW$515, DW_AT_decl_line(0x235)
    6153                            .dwattr $C$DW$515, DW_AT_decl_column(0x0f)
    6154                    
    6155                    $C$DW$516       .dwtag  DW_TAG_member
    6156                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$22)
    6157                            .dwattr $C$DW$516, DW_AT_name("pastTrig")
    6158                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("pastTrig")
    6159                            .dwattr $C$DW$516, DW_AT_bit_offset(0x00)
    6160                            .dwattr $C$DW$516, DW_AT_bit_size(0x01)
    6161                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6162                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6163                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6164                            .dwattr $C$DW$516, DW_AT_decl_line(0x236)
    6165                            .dwattr $C$DW$516, DW_AT_decl_column(0x0f)
    6166                    
    6167                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6168                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    6169                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    6170                            .dwendtag $C$DW$T$42
    6171                    
    6172                    
    6173                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6174                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    6175                    $C$DW$517       .dwtag  DW_TAG_member
    6176                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$22)
    6177                            .dwattr $C$DW$517, DW_AT_name("rule")
    6178                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("rule")
    6179                            .dwattr $C$DW$517, DW_AT_bit_offset(0x04)
    6180                            .dwattr $C$DW$517, DW_AT_bit_size(0x04)
    6181                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6182                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6183                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6184                            .dwattr $C$DW$517, DW_AT_decl_line(0x23a)
    6185                            .dwattr $C$DW$517, DW_AT_decl_column(0x0f)
    6186                    
    6187                    $C$DW$518       .dwtag  DW_TAG_member
    6188                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
    6189                            .dwattr $C$DW$518, DW_AT_name("nSkip")
    6190                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("nSkip")
    6191                            .dwattr $C$DW$518, DW_AT_bit_offset(0x00)
    6192                            .dwattr $C$DW$518, DW_AT_bit_size(0x04)
    6193                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6194                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  115

    6195                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6196                            .dwattr $C$DW$518, DW_AT_decl_line(0x23b)
    6197                            .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    6198                    
    6199                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6200                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    6201                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    6202                            .dwendtag $C$DW$T$43
    6203                    
    6204                    
    6205                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6206                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    6207                    $C$DW$519       .dwtag  DW_TAG_member
    6208                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$31)
    6209                            .dwattr $C$DW$519, DW_AT_name("modType")
    6210                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("modType")
    6211                            .dwattr $C$DW$519, DW_AT_bit_offset(0x0d)
    6212                            .dwattr $C$DW$519, DW_AT_bit_size(0x03)
    6213                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6214                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6215                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6216                            .dwattr $C$DW$519, DW_AT_decl_line(0x23e)
    6217                            .dwattr $C$DW$519, DW_AT_decl_column(0x10)
    6218                    
    6219                    $C$DW$520       .dwtag  DW_TAG_member
    6220                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$31)
    6221                            .dwattr $C$DW$520, DW_AT_name("deviation")
    6222                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("deviation")
    6223                            .dwattr $C$DW$520, DW_AT_bit_offset(0x00)
    6224                            .dwattr $C$DW$520, DW_AT_bit_size(0x0d)
    6225                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6226                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6227                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6228                            .dwattr $C$DW$520, DW_AT_decl_line(0x241)
    6229                            .dwattr $C$DW$520, DW_AT_decl_column(0x10)
    6230                    
    6231                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6232                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    6233                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    6234                            .dwendtag $C$DW$T$44
    6235                    
    6236                    
    6237                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6238                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6239                    $C$DW$521       .dwtag  DW_TAG_member
    6240                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$37)
    6241                            .dwattr $C$DW$521, DW_AT_name("preScale")
    6242                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("preScale")
    6243                            .dwattr $C$DW$521, DW_AT_bit_offset(0x1c)
    6244                            .dwattr $C$DW$521, DW_AT_bit_size(0x04)
    6245                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6246                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6247                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6248                            .dwattr $C$DW$521, DW_AT_decl_line(0x244)
    6249                            .dwattr $C$DW$521, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  116

    6250                    
    6251                    $C$DW$522       .dwtag  DW_TAG_member
    6252                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$37)
    6253                            .dwattr $C$DW$522, DW_AT_name("rateWord")
    6254                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("rateWord")
    6255                            .dwattr $C$DW$522, DW_AT_bit_offset(0x03)
    6256                            .dwattr $C$DW$522, DW_AT_bit_size(0x15)
    6257                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6258                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6259                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6260                            .dwattr $C$DW$522, DW_AT_decl_line(0x246)
    6261                            .dwattr $C$DW$522, DW_AT_decl_column(0x10)
    6262                    
    6263                    $C$DW$523       .dwtag  DW_TAG_member
    6264                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$37)
    6265                            .dwattr $C$DW$523, DW_AT_name("decimMode")
    6266                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("decimMode")
    6267                            .dwattr $C$DW$523, DW_AT_bit_offset(0x00)
    6268                            .dwattr $C$DW$523, DW_AT_bit_size(0x03)
    6269                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6270                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6271                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6272                            .dwattr $C$DW$523, DW_AT_decl_line(0x247)
    6273                            .dwattr $C$DW$523, DW_AT_decl_column(0x10)
    6274                    
    6275                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6276                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
    6277                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    6278                            .dwendtag $C$DW$T$45
    6279                    
    6280                    
    6281                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6282                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    6283                    $C$DW$524       .dwtag  DW_TAG_member
    6284                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$22)
    6285                            .dwattr $C$DW$524, DW_AT_name("nPreamBytes")
    6286                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("nPreamBytes")
    6287                            .dwattr $C$DW$524, DW_AT_bit_offset(0x02)
    6288                            .dwattr $C$DW$524, DW_AT_bit_size(0x06)
    6289                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6290                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6291                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6292                            .dwattr $C$DW$524, DW_AT_decl_line(0x24f)
    6293                            .dwattr $C$DW$524, DW_AT_decl_column(0x0f)
    6294                    
    6295                    $C$DW$525       .dwtag  DW_TAG_member
    6296                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$22)
    6297                            .dwattr $C$DW$525, DW_AT_name("preamMode")
    6298                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("preamMode")
    6299                            .dwattr $C$DW$525, DW_AT_bit_offset(0x00)
    6300                            .dwattr $C$DW$525, DW_AT_bit_size(0x02)
    6301                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6302                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6303                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6304                            .dwattr $C$DW$525, DW_AT_decl_line(0x255)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  117

    6305                            .dwattr $C$DW$525, DW_AT_decl_column(0x0f)
    6306                    
    6307                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6308                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    6309                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    6310                            .dwendtag $C$DW$T$46
    6311                    
    6312                    
    6313                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6314                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    6315                    $C$DW$526       .dwtag  DW_TAG_member
    6316                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$31)
    6317                            .dwattr $C$DW$526, DW_AT_name("nSwBits")
    6318                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("nSwBits")
    6319                            .dwattr $C$DW$526, DW_AT_bit_offset(0x0a)
    6320                            .dwattr $C$DW$526, DW_AT_bit_size(0x06)
    6321                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6322                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6323                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6324                            .dwattr $C$DW$526, DW_AT_decl_line(0x25b)
    6325                            .dwattr $C$DW$526, DW_AT_decl_column(0x10)
    6326                    
    6327                    $C$DW$527       .dwtag  DW_TAG_member
    6328                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$31)
    6329                            .dwattr $C$DW$527, DW_AT_name("bBitReversal")
    6330                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("bBitReversal")
    6331                            .dwattr $C$DW$527, DW_AT_bit_offset(0x09)
    6332                            .dwattr $C$DW$527, DW_AT_bit_size(0x01)
    6333                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6334                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6335                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6336                            .dwattr $C$DW$527, DW_AT_decl_line(0x25c)
    6337                            .dwattr $C$DW$527, DW_AT_decl_column(0x10)
    6338                    
    6339                    $C$DW$528       .dwtag  DW_TAG_member
    6340                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$31)
    6341                            .dwattr $C$DW$528, DW_AT_name("bMsbFirst")
    6342                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("bMsbFirst")
    6343                            .dwattr $C$DW$528, DW_AT_bit_offset(0x08)
    6344                            .dwattr $C$DW$528, DW_AT_bit_size(0x01)
    6345                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6346                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6347                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6348                            .dwattr $C$DW$528, DW_AT_decl_line(0x25e)
    6349                            .dwattr $C$DW$528, DW_AT_decl_column(0x10)
    6350                    
    6351                    $C$DW$529       .dwtag  DW_TAG_member
    6352                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$31)
    6353                            .dwattr $C$DW$529, DW_AT_name("fecMode")
    6354                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("fecMode")
    6355                            .dwattr $C$DW$529, DW_AT_bit_offset(0x04)
    6356                            .dwattr $C$DW$529, DW_AT_bit_size(0x04)
    6357                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6358                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6359                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  118

    6360                            .dwattr $C$DW$529, DW_AT_decl_line(0x260)
    6361                            .dwattr $C$DW$529, DW_AT_decl_column(0x10)
    6362                    
    6363                    $C$DW$530       .dwtag  DW_TAG_member
    6364                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$31)
    6365                            .dwattr $C$DW$530, DW_AT_name("whitenMode")
    6366                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("whitenMode")
    6367                            .dwattr $C$DW$530, DW_AT_bit_offset(0x00)
    6368                            .dwattr $C$DW$530, DW_AT_bit_size(0x03)
    6369                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6370                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6371                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6372                            .dwattr $C$DW$530, DW_AT_decl_line(0x266)
    6373                            .dwattr $C$DW$530, DW_AT_decl_column(0x10)
    6374                    
    6375                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6376                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    6377                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    6378                            .dwendtag $C$DW$T$47
    6379                    
    6380                    
    6381                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6382                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    6383                    $C$DW$531       .dwtag  DW_TAG_member
    6384                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$31)
    6385                            .dwattr $C$DW$531, DW_AT_name("frontEndMode")
    6386                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("frontEndMode")
    6387                            .dwattr $C$DW$531, DW_AT_bit_offset(0x0d)
    6388                            .dwattr $C$DW$531, DW_AT_bit_size(0x03)
    6389                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6390                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6391                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6392                            .dwattr $C$DW$531, DW_AT_decl_line(0x270)
    6393                            .dwattr $C$DW$531, DW_AT_decl_column(0x10)
    6394                    
    6395                    $C$DW$532       .dwtag  DW_TAG_member
    6396                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$31)
    6397                            .dwattr $C$DW$532, DW_AT_name("biasMode")
    6398                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("biasMode")
    6399                            .dwattr $C$DW$532, DW_AT_bit_offset(0x0c)
    6400                            .dwattr $C$DW$532, DW_AT_bit_size(0x01)
    6401                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6402                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6403                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6404                            .dwattr $C$DW$532, DW_AT_decl_line(0x276)
    6405                            .dwattr $C$DW$532, DW_AT_decl_column(0x10)
    6406                    
    6407                    $C$DW$533       .dwtag  DW_TAG_member
    6408                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$31)
    6409                            .dwattr $C$DW$533, DW_AT_name("analogCfgMode")
    6410                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("analogCfgMode")
    6411                            .dwattr $C$DW$533, DW_AT_bit_offset(0x06)
    6412                            .dwattr $C$DW$533, DW_AT_bit_size(0x06)
    6413                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6414                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  119

    6415                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6416                            .dwattr $C$DW$533, DW_AT_decl_line(0x278)
    6417                            .dwattr $C$DW$533, DW_AT_decl_column(0x10)
    6418                    
    6419                    $C$DW$534       .dwtag  DW_TAG_member
    6420                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$31)
    6421                            .dwattr $C$DW$534, DW_AT_name("bNoFsPowerUp")
    6422                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6423                            .dwattr $C$DW$534, DW_AT_bit_offset(0x05)
    6424                            .dwattr $C$DW$534, DW_AT_bit_size(0x01)
    6425                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6426                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6427                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6428                            .dwattr $C$DW$534, DW_AT_decl_line(0x27f)
    6429                            .dwattr $C$DW$534, DW_AT_decl_column(0x10)
    6430                    
    6431                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6432                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    6433                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    6434                            .dwendtag $C$DW$T$48
    6435                    
    6436                    
    6437                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    6438                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    6439                    $C$DW$535       .dwtag  DW_TAG_member
    6440                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$37)
    6441                            .dwattr $C$DW$535, DW_AT_name("nInactivityTimeout")
    6442                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("nInactivityTimeout")
    6443                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6444                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6445                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6446                            .dwattr $C$DW$535, DW_AT_decl_line(0x50e)
    6447                            .dwattr $C$DW$535, DW_AT_decl_column(0x1d)
    6448                    
    6449                    $C$DW$536       .dwtag  DW_TAG_member
    6450                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$50)
    6451                            .dwattr $C$DW$536, DW_AT_name("pRfMode")
    6452                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("pRfMode")
    6453                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6454                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6455                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6456                            .dwattr $C$DW$536, DW_AT_decl_line(0x50f)
    6457                            .dwattr $C$DW$536, DW_AT_decl_column(0x1d)
    6458                    
    6459                    $C$DW$537       .dwtag  DW_TAG_member
    6460                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$52)
    6461                            .dwattr $C$DW$537, DW_AT_name("pOpSetup")
    6462                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("pOpSetup")
    6463                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6464                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6465                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6466                            .dwattr $C$DW$537, DW_AT_decl_line(0x510)
    6467                            .dwattr $C$DW$537, DW_AT_decl_column(0x1d)
    6468                    
    6469                    $C$DW$538       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  120

    6470                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$37)
    6471                            .dwattr $C$DW$538, DW_AT_name("nPowerUpDuration")
    6472                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("nPowerUpDuration")
    6473                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6474                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6475                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6476                            .dwattr $C$DW$538, DW_AT_decl_line(0x511)
    6477                            .dwattr $C$DW$538, DW_AT_decl_column(0x1d)
    6478                    
    6479                    $C$DW$539       .dwtag  DW_TAG_member
    6480                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$53)
    6481                            .dwattr $C$DW$539, DW_AT_name("bMeasurePowerUpDuration")
    6482                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    6483                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6484                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6485                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6486                            .dwattr $C$DW$539, DW_AT_decl_line(0x512)
    6487                            .dwattr $C$DW$539, DW_AT_decl_column(0x1d)
    6488                    
    6489                    $C$DW$540       .dwtag  DW_TAG_member
    6490                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$53)
    6491                            .dwattr $C$DW$540, DW_AT_name("bUpdateSetup")
    6492                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("bUpdateSetup")
    6493                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6494                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6495                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6496                            .dwattr $C$DW$540, DW_AT_decl_line(0x513)
    6497                            .dwattr $C$DW$540, DW_AT_decl_column(0x1d)
    6498                    
    6499                    $C$DW$541       .dwtag  DW_TAG_member
    6500                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$31)
    6501                            .dwattr $C$DW$541, DW_AT_name("nPowerUpDurationMargin")
    6502                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    6503                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6504                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6505                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6506                            .dwattr $C$DW$541, DW_AT_decl_line(0x514)
    6507                            .dwattr $C$DW$541, DW_AT_decl_column(0x1d)
    6508                    
    6509                    $C$DW$542       .dwtag  DW_TAG_member
    6510                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$3)
    6511                            .dwattr $C$DW$542, DW_AT_name("pPowerCb")
    6512                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("pPowerCb")
    6513                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6514                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6515                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6516                            .dwattr $C$DW$542, DW_AT_decl_line(0x515)
    6517                            .dwattr $C$DW$542, DW_AT_decl_column(0x1d)
    6518                    
    6519                    $C$DW$543       .dwtag  DW_TAG_member
    6520                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$3)
    6521                            .dwattr $C$DW$543, DW_AT_name("pErrCb")
    6522                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("pErrCb")
    6523                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6524                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  121

    6525                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6526                            .dwattr $C$DW$543, DW_AT_decl_line(0x516)
    6527                            .dwattr $C$DW$543, DW_AT_decl_column(0x1d)
    6528                    
    6529                    $C$DW$544       .dwtag  DW_TAG_member
    6530                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$3)
    6531                            .dwattr $C$DW$544, DW_AT_name("pClientEventCb")
    6532                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("pClientEventCb")
    6533                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6534                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6535                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6536                            .dwattr $C$DW$544, DW_AT_decl_line(0x517)
    6537                            .dwattr $C$DW$544, DW_AT_decl_column(0x1d)
    6538                    
    6539                    $C$DW$545       .dwtag  DW_TAG_member
    6540                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$54)
    6541                            .dwattr $C$DW$545, DW_AT_name("nClientEventMask")
    6542                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("nClientEventMask")
    6543                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6544                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6545                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    6546                            .dwattr $C$DW$545, DW_AT_decl_line(0x518)
    6547                            .dwattr $C$DW$545, DW_AT_decl_column(0x1d)
    6548                    
    6549                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    6550                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x50d)
    6551                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
    6552                            .dwendtag $C$DW$T$55
    6553                    
    6554                    
    6555                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    6556                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    6557                    $C$DW$546       .dwtag  DW_TAG_member
    6558                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    6559                            .dwattr $C$DW$546, DW_AT_name("triggerType")
    6560                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("triggerType")
    6561                            .dwattr $C$DW$546, DW_AT_bit_offset(0x04)
    6562                            .dwattr $C$DW$546, DW_AT_bit_size(0x04)
    6563                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6564                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6565                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6566                            .dwattr $C$DW$546, DW_AT_decl_line(0xee)
    6567                            .dwattr $C$DW$546, DW_AT_decl_column(0x0f)
    6568                    
    6569                    $C$DW$547       .dwtag  DW_TAG_member
    6570                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
    6571                            .dwattr $C$DW$547, DW_AT_name("bEnaCmd")
    6572                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("bEnaCmd")
    6573                            .dwattr $C$DW$547, DW_AT_bit_offset(0x03)
    6574                            .dwattr $C$DW$547, DW_AT_bit_size(0x01)
    6575                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6576                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6577                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6578                            .dwattr $C$DW$547, DW_AT_decl_line(0xef)
    6579                            .dwattr $C$DW$547, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{F5F6C4A2-6C2A-4EB0-9BBB-0856351FDD2C} PAGE  122

    6580                    
    6581                    $C$DW$548       .dwtag  DW_TAG_member
    6582                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    6583                            .dwattr $C$DW$548, DW_AT_name("triggerNo")
    6584                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("triggerNo")
    6585                            .dwattr $C$DW$548, DW_AT_bit_offset(0x01)
    6586                            .dwattr $C$DW$548, DW_AT_bit_size(0x02)
    6587                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6588                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6589                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6590                            .dwattr $C$DW$548, DW_AT_decl_line(0xf1)
    6591                            .dwattr $C$DW$548, DW_AT_decl_column(0x0f)
    6592                    
    6593                    $C$DW$549       .dwtag  DW_TAG_member
    6594                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    6595                            .dwattr $C$DW$549, DW_AT_name("pastTrig")
    6596                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("pastTrig")
    6597                            .dwattr $C$DW$549, DW_AT_bit_offset(0x00)
    6598                            .dwattr $C$DW$549, DW_AT_bit_size(0x01)
    6599                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6600                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6601                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    6602                            .dwattr $C$DW$549, DW_AT_decl_line(0xf2)
    6603                            .dwattr $C$DW$549, DW_AT_decl_column(0x0f)
    6604                    
    6605                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/
    6606                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
    6607                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    6608                            .dwendtag $C$DW$T$56
    6609                    
    6610                    
    6611                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6612                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    6613                    $C$DW$550       .dwtag  DW_TAG_member
    6614                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
