TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:20 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_cfg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                            .global macCfg
      14 00000000                   .sect   ".data:macCfg", RW

    2206                    
    2207                    $C$DW$T$540     .dwtag  DW_TAG_typedef
    2208                            .dwattr $C$DW$T$540, DW_AT_name("tFlashStateCommandsType")
    2209                            .dwattr $C$DW$T$540, DW_AT_type(*$C$DW$T$539)
    2210                            .dwattr $C$DW$T$540, DW_AT_language(DW_LANG_C)
    2211                            .dwattr $C$DW$T$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
    2212                            .dwattr $C$DW$T$540, DW_AT_decl_line(0xb0)
    2213                            .dwattr $C$DW$T$540, DW_AT_decl_column(0x03)
    2214                    
    2215                    
    2216                    $C$DW$T$541     .dwtag  DW_TAG_enumeration_type
    2217                            .dwattr $C$DW$T$541, DW_AT_byte_size(0x01)
    2218                    $C$DW$241       .dwtag  DW_TAG_enumerator
    2219                            .dwattr $C$DW$241, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    2220                            .dwattr $C$DW$241, DW_AT_const_value(0xe0)
    2221                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2222                            .dwattr $C$DW$241, DW_AT_decl_line(0x3de)
    2223                            .dwattr $C$DW$241, DW_AT_decl_column(0x04)
    2224                    
    2225                    $C$DW$242       .dwtag  DW_TAG_enumerator
    2226                            .dwattr $C$DW$242, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    2227                            .dwattr $C$DW$242, DW_AT_const_value(0xe1)
    2228                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2229                            .dwattr $C$DW$242, DW_AT_decl_line(0x3e0)
    2230                            .dwattr $C$DW$242, DW_AT_decl_column(0x04)
    2231                    
    2232                    $C$DW$243       .dwtag  DW_TAG_enumerator
    2233                            .dwattr $C$DW$243, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    2234                            .dwattr $C$DW$243, DW_AT_const_value(0xe2)
    2235                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2236                            .dwattr $C$DW$243, DW_AT_decl_line(0x3e2)
    2237                            .dwattr $C$DW$243, DW_AT_decl_column(0x04)
    2238                    
    2239                    $C$DW$244       .dwtag  DW_TAG_enumerator
    2240                            .dwattr $C$DW$244, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    2241                            .dwattr $C$DW$244, DW_AT_const_value(0xe3)
    2242                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2243                            .dwattr $C$DW$244, DW_AT_decl_line(0x3e4)
    2244                            .dwattr $C$DW$244, DW_AT_decl_column(0x04)
    2245                    
    2246                    $C$DW$245       .dwtag  DW_TAG_enumerator
    2247                            .dwattr $C$DW$245, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    2248                            .dwattr $C$DW$245, DW_AT_const_value(0xe4)
    2249                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2250                            .dwattr $C$DW$245, DW_AT_decl_line(0x3e6)
    2251                            .dwattr $C$DW$245, DW_AT_decl_column(0x04)
    2252                    
    2253                    $C$DW$246       .dwtag  DW_TAG_enumerator
    2254                            .dwattr $C$DW$246, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    2255                            .dwattr $C$DW$246, DW_AT_const_value(0xe5)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   42

    2256                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2257                            .dwattr $C$DW$246, DW_AT_decl_line(0x3e8)
    2258                            .dwattr $C$DW$246, DW_AT_decl_column(0x04)
    2259                    
    2260                            .dwattr $C$DW$T$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2261                            .dwattr $C$DW$T$541, DW_AT_decl_line(0x3dc)
    2262                            .dwattr $C$DW$T$541, DW_AT_decl_column(0x01)
    2263                            .dwendtag $C$DW$T$541
    2264                    
    2265                    $C$DW$T$542     .dwtag  DW_TAG_typedef
    2266                            .dwattr $C$DW$T$542, DW_AT_name("ICall_RemotiCmdEvent_t")
    2267                            .dwattr $C$DW$T$542, DW_AT_type(*$C$DW$T$541)
    2268                            .dwattr $C$DW$T$542, DW_AT_language(DW_LANG_C)
    2269                            .dwattr $C$DW$T$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2270                            .dwattr $C$DW$T$542, DW_AT_decl_line(0x3e9)
    2271                            .dwattr $C$DW$T$542, DW_AT_decl_column(0x02)
    2272                    
    2273                    
    2274                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2275                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    2276                    $C$DW$247       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    2278                            .dwattr $C$DW$247, DW_AT_name("txDataMax")
    2279                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("txDataMax")
    2280                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2282                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2283                            .dwattr $C$DW$247, DW_AT_decl_line(0x53c)
    2284                            .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    2285                    
    2286                    $C$DW$248       .dwtag  DW_TAG_member
    2287                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    2288                            .dwattr $C$DW$248, DW_AT_name("txMax")
    2289                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("txMax")
    2290                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2291                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2292                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2293                            .dwattr $C$DW$248, DW_AT_decl_line(0x53d)
    2294                            .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    2295                    
    2296                    $C$DW$249       .dwtag  DW_TAG_member
    2297                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    2298                            .dwattr $C$DW$249, DW_AT_name("rxMax")
    2299                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("rxMax")
    2300                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2301                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2302                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2303                            .dwattr $C$DW$249, DW_AT_decl_line(0x53e)
    2304                            .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    2305                    
    2306                    $C$DW$250       .dwtag  DW_TAG_member
    2307                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    2308                            .dwattr $C$DW$250, DW_AT_name("dataIndOffset")
    2309                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("dataIndOffset")
    2310                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   43

    2311                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2312                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2313                            .dwattr $C$DW$250, DW_AT_decl_line(0x53f)
    2314                            .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    2315                    
    2316                    $C$DW$251       .dwtag  DW_TAG_member
    2317                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    2318                            .dwattr $C$DW$251, DW_AT_name("maxDeviceTableEntries")
    2319                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("maxDeviceTableEntries")
    2320                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2321                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2322                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2323                            .dwattr $C$DW$251, DW_AT_decl_line(0x541)
    2324                            .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    2325                    
    2326                    $C$DW$252       .dwtag  DW_TAG_member
    2327                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    2328                            .dwattr $C$DW$252, DW_AT_name("maxKeyDeviceTableEntries")
    2329                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("maxKeyDeviceTableEntries")
    2330                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2331                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2332                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2333                            .dwattr $C$DW$252, DW_AT_decl_line(0x542)
    2334                            .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    2335                    
    2336                    $C$DW$253       .dwtag  DW_TAG_member
    2337                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    2338                            .dwattr $C$DW$253, DW_AT_name("maxKeyTableEntries")
    2339                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("maxKeyTableEntries")
    2340                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2341                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2342                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2343                            .dwattr $C$DW$253, DW_AT_decl_line(0x543)
    2344                            .dwattr $C$DW$253, DW_AT_decl_column(0x11)
    2345                    
    2346                    $C$DW$254       .dwtag  DW_TAG_member
    2347                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
    2348                            .dwattr $C$DW$254, DW_AT_name("maxNodeKeyTableEntries")
    2349                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("maxNodeKeyTableEntries")
    2350                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2351                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2352                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2353                            .dwattr $C$DW$254, DW_AT_decl_line(0x544)
    2354                            .dwattr $C$DW$254, DW_AT_decl_column(0x11)
    2355                    
    2356                    $C$DW$255       .dwtag  DW_TAG_member
    2357                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    2358                            .dwattr $C$DW$255, DW_AT_name("maxKeyIdLookUpEntries")
    2359                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("maxKeyIdLookUpEntries")
    2360                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2361                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2362                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2363                            .dwattr $C$DW$255, DW_AT_decl_line(0x545)
    2364                            .dwattr $C$DW$255, DW_AT_decl_column(0x11)
    2365                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   44

    2366                    $C$DW$256       .dwtag  DW_TAG_member
    2367                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$26)
    2368                            .dwattr $C$DW$256, DW_AT_name("appPendingQueue")
    2369                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("appPendingQueue")
    2370                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2371                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2372                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2373                            .dwattr $C$DW$256, DW_AT_decl_line(0x546)
    2374                            .dwattr $C$DW$256, DW_AT_decl_column(0x11)
    2375                    
    2376                    $C$DW$257       .dwtag  DW_TAG_member
    2377                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$23)
    2378                            .dwattr $C$DW$257, DW_AT_name("macMaxFrameSize")
    2379                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("macMaxFrameSize")
    2380                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2381                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2382                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2383                            .dwattr $C$DW$257, DW_AT_decl_line(0x548)
    2384                            .dwattr $C$DW$257, DW_AT_decl_column(0x11)
    2385                    
    2386                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2387                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x53b)
    2388                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    2389                            .dwendtag $C$DW$T$27
    2390                    
    2391                    $C$DW$T$543     .dwtag  DW_TAG_typedef
    2392                            .dwattr $C$DW$T$543, DW_AT_name("macCfg_t")
    2393                            .dwattr $C$DW$T$543, DW_AT_type(*$C$DW$T$27)
    2394                            .dwattr $C$DW$T$543, DW_AT_language(DW_LANG_C)
    2395                            .dwattr $C$DW$T$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2396                            .dwattr $C$DW$T$543, DW_AT_decl_line(0x549)
    2397                            .dwattr $C$DW$T$543, DW_AT_decl_column(0x03)
    2398                    
    2399                    
    2400                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2401                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
    2402                    $C$DW$258       .dwtag  DW_TAG_member
    2403                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$14)
    2404                            .dwattr $C$DW$258, DW_AT_name("__max_align1")
    2405                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("__max_align1")
    2406                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2408                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    2409                            .dwattr $C$DW$258, DW_AT_decl_line(0x70)
    2410                            .dwattr $C$DW$258, DW_AT_decl_column(0x0c)
    2411                    
    2412                    $C$DW$259       .dwtag  DW_TAG_member
    2413                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$18)
    2414                            .dwattr $C$DW$259, DW_AT_name("__max_align2")
    2415                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("__max_align2")
    2416                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2417                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2418                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    2419                            .dwattr $C$DW$259, DW_AT_decl_line(0x71)
    2420                            .dwattr $C$DW$259, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   45

    2421                    
    2422                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    2423                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x6f)
    2424                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2425                            .dwendtag $C$DW$T$28
    2426                    
    2427                    $C$DW$T$544     .dwtag  DW_TAG_typedef
    2428                            .dwattr $C$DW$T$544, DW_AT_name("__max_align_t")
    2429                            .dwattr $C$DW$T$544, DW_AT_type(*$C$DW$T$28)
    2430                            .dwattr $C$DW$T$544, DW_AT_language(DW_LANG_C)
    2431                            .dwattr $C$DW$T$544, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    2432                            .dwattr $C$DW$T$544, DW_AT_decl_line(0x72)
    2433                            .dwattr $C$DW$T$544, DW_AT_decl_column(0x03)
    2434                    
    2435                    
    2436                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2437                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2438                    $C$DW$260       .dwtag  DW_TAG_member
    2439                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$187)
    2440                            .dwattr $C$DW$260, DW_AT_name("addr")
    2441                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("addr")
    2442                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2443                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2444                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sadd
    2445                            .dwattr $C$DW$260, DW_AT_decl_line(0x55)
    2446                            .dwattr $C$DW$260, DW_AT_decl_column(0x05)
    2447                    
    2448                    $C$DW$261       .dwtag  DW_TAG_member
    2449                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$30)
    2450                            .dwattr $C$DW$261, DW_AT_name("addrMode")
    2451                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("addrMode")
    2452                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2453                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2454                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sadd
    2455                            .dwattr $C$DW$261, DW_AT_decl_line(0x56)
    2456                            .dwattr $C$DW$261, DW_AT_decl_column(0x13)
    2457                    
    2458                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sad
    2459                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x50)
    2460                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    2461                            .dwendtag $C$DW$T$31
    2462                    
    2463                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    2464                            .dwattr $C$DW$T$87, DW_AT_name("sAddr_t")
    2465                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
    2466                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2467                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sad
    2468                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x57)
    2469                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2470                    
    2471                    
    2472                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2473                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    2474                    $C$DW$262       .dwtag  DW_TAG_member
    2475                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$32)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   46

    2476                            .dwattr $C$DW$262, DW_AT_name("p")
    2477                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("p")
    2478                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2480                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sdat
    2481                            .dwattr $C$DW$262, DW_AT_decl_line(0x3d)
    2482                            .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    2483                    
    2484                    $C$DW$263       .dwtag  DW_TAG_member
    2485                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    2486                            .dwattr $C$DW$263, DW_AT_name("len")
    2487                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("len")
    2488                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2489                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2490                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sdat
    2491                            .dwattr $C$DW$263, DW_AT_decl_line(0x3e)
    2492                            .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    2493                    
    2494                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sda
    2495                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3c)
    2496                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2497                            .dwendtag $C$DW$T$33
    2498                    
    2499                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    2500                            .dwattr $C$DW$T$90, DW_AT_name("sData_t")
    2501                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$33)
    2502                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2503                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sda
    2504                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3f)
    2505                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    2506                    
    2507                    
    2508                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2509                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    2510                    $C$DW$264       .dwtag  DW_TAG_member
    2511                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$189)
    2512                            .dwattr $C$DW$264, DW_AT_name("addr")
    2513                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("addr")
    2514                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2516                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2517                            .dwattr $C$DW$264, DW_AT_decl_line(0x4db)
    2518                            .dwattr $C$DW$264, DW_AT_decl_column(0x07)
    2519                    
    2520                    $C$DW$265       .dwtag  DW_TAG_member
    2521                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$35)
    2522                            .dwattr $C$DW$265, DW_AT_name("addrMode")
    2523                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("addrMode")
    2524                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2525                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2526                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2527                            .dwattr $C$DW$265, DW_AT_decl_line(0x4de)
    2528                            .dwattr $C$DW$265, DW_AT_decl_column(0x17)
    2529                    
    2530                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   47

    2531                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x4d0)
    2532                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2533                            .dwendtag $C$DW$T$36
    2534                    
    2535                    $C$DW$T$338     .dwtag  DW_TAG_typedef
    2536                            .dwattr $C$DW$T$338, DW_AT_name("ApiMac_sAddr_t")
    2537                            .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$36)
    2538                            .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
    2539                            .dwattr $C$DW$T$338, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2540                            .dwattr $C$DW$T$338, DW_AT_decl_line(0x4df)
    2541                            .dwattr $C$DW$T$338, DW_AT_decl_column(0x03)
    2542                    
    2543                    
    2544                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2545                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    2546                    $C$DW$266       .dwtag  DW_TAG_member
    2547                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$38)
    2548                            .dwattr $C$DW$266, DW_AT_name("frameCounter")
    2549                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("frameCounter")
    2550                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2552                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2553                            .dwattr $C$DW$266, DW_AT_decl_line(0x575)
    2554                            .dwattr $C$DW$266, DW_AT_decl_column(0x1a)
    2555                    
    2556                    $C$DW$267       .dwtag  DW_TAG_member
    2557                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$40)
    2558                            .dwattr $C$DW$267, DW_AT_name("keyIdx")
    2559                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("keyIdx")
    2560                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2561                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2562                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2563                            .dwattr $C$DW$267, DW_AT_decl_line(0x576)
    2564                            .dwattr $C$DW$267, DW_AT_decl_column(0x1a)
    2565                    
    2566                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2567                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x574)
    2568                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2569                            .dwendtag $C$DW$T$41
    2570                    
    2571                    $C$DW$T$400     .dwtag  DW_TAG_typedef
    2572                            .dwattr $C$DW$T$400, DW_AT_name("ApiMac_frameCntr_t")
    2573                            .dwattr $C$DW$T$400, DW_AT_type(*$C$DW$T$41)
    2574                            .dwattr $C$DW$T$400, DW_AT_language(DW_LANG_C)
    2575                            .dwattr $C$DW$T$400, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2576                            .dwattr $C$DW$T$400, DW_AT_decl_line(0x577)
    2577                            .dwattr $C$DW$T$400, DW_AT_decl_column(0x03)
    2578                    
    2579                    $C$DW$T$401     .dwtag  DW_TAG_pointer_type
    2580                            .dwattr $C$DW$T$401, DW_AT_type(*$C$DW$T$400)
    2581                            .dwattr $C$DW$T$401, DW_AT_address_class(0x20)
    2582                    
    2583                    
    2584                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2585                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   48

    2586                    $C$DW$268       .dwtag  DW_TAG_member
    2587                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$43)
    2588                            .dwattr $C$DW$268, DW_AT_name("beaconType")
    2589                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("beaconType")
    2590                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2592                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2593                            .dwattr $C$DW$268, DW_AT_decl_line(0x886)
    2594                            .dwattr $C$DW$268, DW_AT_decl_column(0x19)
    2595                    
    2596                    $C$DW$269       .dwtag  DW_TAG_member
    2597                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$30)
    2598                            .dwattr $C$DW$269, DW_AT_name("bsn")
    2599                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("bsn")
    2600                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2601                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2602                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2603                            .dwattr $C$DW$269, DW_AT_decl_line(0x888)
    2604                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    2605                    
    2606                    $C$DW$270       .dwtag  DW_TAG_member
    2607                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$44)
    2608                            .dwattr $C$DW$270, DW_AT_name("panDesc")
    2609                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("panDesc")
    2610                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2611                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2612                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2613                            .dwattr $C$DW$270, DW_AT_decl_line(0x88a)
    2614                            .dwattr $C$DW$270, DW_AT_decl_column(0x16)
    2615                    
    2616                    $C$DW$271       .dwtag  DW_TAG_member
    2617                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$192)
    2618                            .dwattr $C$DW$271, DW_AT_name("beaconData")
    2619                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("beaconData")
    2620                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2621                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2622                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2623                            .dwattr $C$DW$271, DW_AT_decl_line(0x895)
    2624                            .dwattr $C$DW$271, DW_AT_decl_column(0x07)
    2625                    
    2626                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2627                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x884)
    2628                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    2629                            .dwendtag $C$DW$T$45
    2630                    
    2631                    $C$DW$T$252     .dwtag  DW_TAG_typedef
    2632                            .dwattr $C$DW$T$252, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    2633                            .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$45)
    2634                            .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    2635                            .dwattr $C$DW$T$252, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/api_mac.h")
    2636                            .dwattr $C$DW$T$252, DW_AT_decl_line(0x896)
    2637                            .dwattr $C$DW$T$252, DW_AT_decl_column(0x03)
    2638                    
    2639                    $C$DW$T$253     .dwtag  DW_TAG_pointer_type
    2640                            .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$252)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   49

    2641                            .dwattr $C$DW$T$253, DW_AT_address_class(0x20)
    2642                    
    2643                    
    2644                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2645                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    2646                    $C$DW$272       .dwtag  DW_TAG_member
    2647                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$46)
    2648                            .dwattr $C$DW$272, DW_AT_name("firstChCentrFreq")
    2649                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("firstChCentrFreq")
    2650                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2652                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2653                            .dwattr $C$DW$272, DW_AT_decl_line(0x29b)
    2654                            .dwattr $C$DW$272, DW_AT_decl_column(0x0a)
    2655                    
    2656                    $C$DW$273       .dwtag  DW_TAG_member
    2657                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$46)
    2658                            .dwattr $C$DW$273, DW_AT_name("channelSpacing")
    2659                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("channelSpacing")
    2660                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2661                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2662                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2663                            .dwattr $C$DW$273, DW_AT_decl_line(0x29c)
    2664                            .dwattr $C$DW$273, DW_AT_decl_column(0x0a)
    2665                    
    2666                    $C$DW$274       .dwtag  DW_TAG_member
    2667                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$23)
    2668                            .dwattr $C$DW$274, DW_AT_name("noOfChannels")
    2669                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("noOfChannels")
    2670                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2671                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2672                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2673                            .dwattr $C$DW$274, DW_AT_decl_line(0x29d)
    2674                            .dwattr $C$DW$274, DW_AT_decl_column(0x0a)
    2675                    
    2676                    $C$DW$275       .dwtag  DW_TAG_member
    2677                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$21)
    2678                            .dwattr $C$DW$275, DW_AT_name("fskModScheme")
    2679                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("fskModScheme")
    2680                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2681                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2682                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2683                            .dwattr $C$DW$275, DW_AT_decl_line(0x29f)
    2684                            .dwattr $C$DW$275, DW_AT_decl_column(0x09)
    2685                    
    2686                    $C$DW$276       .dwtag  DW_TAG_member
    2687                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    2688                            .dwattr $C$DW$276, DW_AT_name("symbolRate")
    2689                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("symbolRate")
    2690                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2691                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2692                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2693                            .dwattr $C$DW$276, DW_AT_decl_line(0x2a1)
    2694                            .dwattr $C$DW$276, DW_AT_decl_column(0x0a)
    2695                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   50

    2696                    $C$DW$277       .dwtag  DW_TAG_member
    2697                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    2698                            .dwattr $C$DW$277, DW_AT_name("fskModIndex")
    2699                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("fskModIndex")
    2700                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2701                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2702                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2703                            .dwattr $C$DW$277, DW_AT_decl_line(0x2a2)
    2704                            .dwattr $C$DW$277, DW_AT_decl_column(0x09)
    2705                    
    2706                    $C$DW$278       .dwtag  DW_TAG_member
    2707                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    2708                            .dwattr $C$DW$278, DW_AT_name("ccaType")
    2709                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("ccaType")
    2710                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2711                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2712                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2713                            .dwattr $C$DW$278, DW_AT_decl_line(0x2aa)
    2714                            .dwattr $C$DW$278, DW_AT_decl_column(0x09)
    2715                    
    2716                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2717                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x29a)
    2718                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2719                            .dwendtag $C$DW$T$47
    2720                    
    2721                    $C$DW$T$545     .dwtag  DW_TAG_typedef
    2722                            .dwattr $C$DW$T$545, DW_AT_name("macMRFSKPHYDesc_t")
    2723                            .dwattr $C$DW$T$545, DW_AT_type(*$C$DW$T$47)
    2724                            .dwattr $C$DW$T$545, DW_AT_language(DW_LANG_C)
    2725                            .dwattr $C$DW$T$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2726                            .dwattr $C$DW$T$545, DW_AT_decl_line(0x2ab)
    2727                            .dwattr $C$DW$T$545, DW_AT_decl_column(0x03)
    2728                    
    2729                    $C$DW$T$546     .dwtag  DW_TAG_typedef
    2730                            .dwattr $C$DW$T$546, DW_AT_name("macPHYDesc_t")
    2731                            .dwattr $C$DW$T$546, DW_AT_type(*$C$DW$T$545)
    2732                            .dwattr $C$DW$T$546, DW_AT_language(DW_LANG_C)
    2733                            .dwattr $C$DW$T$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2734                            .dwattr $C$DW$T$546, DW_AT_decl_line(0x2b1)
    2735                            .dwattr $C$DW$T$546, DW_AT_decl_column(0x1b)
    2736                    
    2737                    
    2738                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2739                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2740                    $C$DW$279       .dwtag  DW_TAG_member
    2741                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    2742                            .dwattr $C$DW$279, DW_AT_name("event")
    2743                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("event")
    2744                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2746                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2747                            .dwattr $C$DW$279, DW_AT_decl_line(0x2b6)
    2748                            .dwattr $C$DW$279, DW_AT_decl_column(0x0b)
    2749                    
    2750                    $C$DW$280       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   51

    2751                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    2752                            .dwattr $C$DW$280, DW_AT_name("status")
    2753                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("status")
    2754                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2755                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2756                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2757                            .dwattr $C$DW$280, DW_AT_decl_line(0x2b7)
    2758                            .dwattr $C$DW$280, DW_AT_decl_column(0x0b)
    2759                    
    2760                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2761                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2b5)
    2762                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2763                            .dwendtag $C$DW$T$48
    2764                    
    2765                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    2766                            .dwattr $C$DW$T$89, DW_AT_name("macEventHdr_t")
    2767                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    2768                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2769                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2770                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x2b8)
    2771                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    2772                    
    2773                    
    2774                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2775                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    2776                    $C$DW$281       .dwtag  DW_TAG_member
    2777                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$49)
    2778                            .dwattr $C$DW$281, DW_AT_name("keySource")
    2779                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("keySource")
    2780                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2782                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2783                            .dwattr $C$DW$281, DW_AT_decl_line(0x2bd)
    2784                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    2785                    
    2786                    $C$DW$282       .dwtag  DW_TAG_member
    2787                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    2788                            .dwattr $C$DW$282, DW_AT_name("securityLevel")
    2789                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("securityLevel")
    2790                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2791                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2792                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2793                            .dwattr $C$DW$282, DW_AT_decl_line(0x2be)
    2794                            .dwattr $C$DW$282, DW_AT_decl_column(0x0b)
    2795                    
    2796                    $C$DW$283       .dwtag  DW_TAG_member
    2797                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    2798                            .dwattr $C$DW$283, DW_AT_name("keyIdMode")
    2799                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("keyIdMode")
    2800                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2801                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2802                            .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2803                            .dwattr $C$DW$283, DW_AT_decl_line(0x2bf)
    2804                            .dwattr $C$DW$283, DW_AT_decl_column(0x0b)
    2805                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   52

    2806                    $C$DW$284       .dwtag  DW_TAG_member
    2807                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$23)
    2808                            .dwattr $C$DW$284, DW_AT_name("keyIndex")
    2809                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("keyIndex")
    2810                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2811                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2812                            .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2813                            .dwattr $C$DW$284, DW_AT_decl_line(0x2c0)
    2814                            .dwattr $C$DW$284, DW_AT_decl_column(0x0b)
    2815                    
    2816                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2817                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2bc)
    2818                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2819                            .dwendtag $C$DW$T$50
    2820                    
    2821                    $C$DW$T$547     .dwtag  DW_TAG_typedef
    2822                            .dwattr $C$DW$T$547, DW_AT_name("macSec_t")
    2823                            .dwattr $C$DW$T$547, DW_AT_type(*$C$DW$T$50)
    2824                            .dwattr $C$DW$T$547, DW_AT_language(DW_LANG_C)
    2825                            .dwattr $C$DW$T$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2826                            .dwattr $C$DW$T$547, DW_AT_decl_line(0x2c1)
    2827                            .dwattr $C$DW$T$547, DW_AT_decl_column(0x03)
    2828                    
    2829                    
    2830                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2831                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x0a)
    2832                    $C$DW$285       .dwtag  DW_TAG_member
    2833                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$51)
    2834                            .dwattr $C$DW$285, DW_AT_name("lookupData")
    2835                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("lookupData")
    2836                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2838                            .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2839                            .dwattr $C$DW$285, DW_AT_decl_line(0x2c6)
    2840                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    2841                    
    2842                    $C$DW$286       .dwtag  DW_TAG_member
    2843                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    2844                            .dwattr $C$DW$286, DW_AT_name("lookupDataSize")
    2845                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("lookupDataSize")
    2846                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2847                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2848                            .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2849                            .dwattr $C$DW$286, DW_AT_decl_line(0x2c7)
    2850                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    2851                    
    2852                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2853                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2c5)
    2854                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    2855                            .dwendtag $C$DW$T$52
    2856                    
    2857                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    2858                            .dwattr $C$DW$T$55, DW_AT_name("keyIdLookupDescriptor_t")
    2859                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$52)
    2860                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   53

    2861                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2862                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2c8)
    2863                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    2864                    
    2865                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    2866                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2867                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    2868                    
    2869                    
    2870                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2871                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    2872                    $C$DW$287       .dwtag  DW_TAG_member
    2873                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    2874                            .dwattr $C$DW$287, DW_AT_name("deviceDescriptorHandle")
    2875                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    2876                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2877                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2878                            .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2879                            .dwattr $C$DW$287, DW_AT_decl_line(0x2cd)
    2880                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    2881                    
    2882                    $C$DW$288       .dwtag  DW_TAG_member
    2883                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
    2884                            .dwattr $C$DW$288, DW_AT_name("uniqueDevice")
    2885                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("uniqueDevice")
    2886                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2887                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2888                            .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2889                            .dwattr $C$DW$288, DW_AT_decl_line(0x2ce)
    2890                            .dwattr $C$DW$288, DW_AT_decl_column(0x16)
    2891                    
    2892                    $C$DW$289       .dwtag  DW_TAG_member
    2893                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$25)
    2894                            .dwattr $C$DW$289, DW_AT_name("blackListed")
    2895                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("blackListed")
    2896                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2897                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2898                            .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2899                            .dwattr $C$DW$289, DW_AT_decl_line(0x2cf)
    2900                            .dwattr $C$DW$289, DW_AT_decl_column(0x16)
    2901                    
    2902                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2903                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2cc)
    2904                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    2905                            .dwendtag $C$DW$T$53
    2906                    
    2907                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    2908                            .dwattr $C$DW$T$57, DW_AT_name("keyDeviceDescriptor_t")
    2909                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$53)
    2910                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2911                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2912                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2d0)
    2913                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    2914                    
    2915                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   54

    2916                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2917                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2918                    
    2919                    
    2920                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2921                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2922                    $C$DW$290       .dwtag  DW_TAG_member
    2923                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    2924                            .dwattr $C$DW$290, DW_AT_name("frameType")
    2925                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("frameType")
    2926                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2927                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2928                            .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2929                            .dwattr $C$DW$290, DW_AT_decl_line(0x2d5)
    2930                            .dwattr $C$DW$290, DW_AT_decl_column(0x16)
    2931                    
    2932                    $C$DW$291       .dwtag  DW_TAG_member
    2933                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    2934                            .dwattr $C$DW$291, DW_AT_name("cmdFrameId")
    2935                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("cmdFrameId")
    2936                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2937                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2938                            .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2939                            .dwattr $C$DW$291, DW_AT_decl_line(0x2d6)
    2940                            .dwattr $C$DW$291, DW_AT_decl_column(0x16)
    2941                    
    2942                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2943                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2d4)
    2944                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    2945                            .dwendtag $C$DW$T$54
    2946                    
    2947                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2948                            .dwattr $C$DW$T$59, DW_AT_name("keyUsageDescriptor_t")
    2949                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$54)
    2950                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2951                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    2952                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x2d7)
    2953                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    2954                    
    2955                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2956                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2957                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2958                    
    2959                    
    2960                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    2961                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x2c)
    2962                    $C$DW$292       .dwtag  DW_TAG_member
    2963                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$56)
    2964                            .dwattr $C$DW$292, DW_AT_name("keyIdLookupList")
    2965                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("keyIdLookupList")
    2966                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2967                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2968                            .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2969                            .dwattr $C$DW$292, DW_AT_decl_line(0x2dc)
    2970                            .dwattr $C$DW$292, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   55

    2971                    
    2972                    $C$DW$293       .dwtag  DW_TAG_member
    2973                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    2974                            .dwattr $C$DW$293, DW_AT_name("keyIdLookupEntries")
    2975                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("keyIdLookupEntries")
    2976                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2977                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2978                            .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2979                            .dwattr $C$DW$293, DW_AT_decl_line(0x2dd)
    2980                            .dwattr $C$DW$293, DW_AT_decl_column(0x1c)
    2981                    
    2982                    $C$DW$294       .dwtag  DW_TAG_member
    2983                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$58)
    2984                            .dwattr $C$DW$294, DW_AT_name("keyDeviceList")
    2985                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("keyDeviceList")
    2986                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2987                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2988                            .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2989                            .dwattr $C$DW$294, DW_AT_decl_line(0x2df)
    2990                            .dwattr $C$DW$294, DW_AT_decl_column(0x1d)
    2991                    
    2992                    $C$DW$295       .dwtag  DW_TAG_member
    2993                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
    2994                            .dwattr $C$DW$295, DW_AT_name("keyDeviceListEntries")
    2995                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("keyDeviceListEntries")
    2996                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2997                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2998                            .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2999                            .dwattr $C$DW$295, DW_AT_decl_line(0x2e2)
    3000                            .dwattr $C$DW$295, DW_AT_decl_column(0x1d)
    3001                    
    3002                    $C$DW$296       .dwtag  DW_TAG_member
    3003                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$60)
    3004                            .dwattr $C$DW$296, DW_AT_name("keyUsageList")
    3005                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("keyUsageList")
    3006                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3007                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3008                            .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3009                            .dwattr $C$DW$296, DW_AT_decl_line(0x2e4)
    3010                            .dwattr $C$DW$296, DW_AT_decl_column(0x1d)
    3011                    
    3012                    $C$DW$297       .dwtag  DW_TAG_member
    3013                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    3014                            .dwattr $C$DW$297, DW_AT_name("keyUsageListEntries")
    3015                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("keyUsageListEntries")
    3016                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3017                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3018                            .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3019                            .dwattr $C$DW$297, DW_AT_decl_line(0x2e6)
    3020                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3021                    
    3022                    $C$DW$298       .dwtag  DW_TAG_member
    3023                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$61)
    3024                            .dwattr $C$DW$298, DW_AT_name("key")
    3025                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("key")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   56

    3026                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3027                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3028                            .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3029                            .dwattr $C$DW$298, DW_AT_decl_line(0x2e8)
    3030                            .dwattr $C$DW$298, DW_AT_decl_column(0x1c)
    3031                    
    3032                    $C$DW$299       .dwtag  DW_TAG_member
    3033                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$46)
    3034                            .dwattr $C$DW$299, DW_AT_name("frameCounter")
    3035                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("frameCounter")
    3036                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3037                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3038                            .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3039                            .dwattr $C$DW$299, DW_AT_decl_line(0x2e9)
    3040                            .dwattr $C$DW$299, DW_AT_decl_column(0x1c)
    3041                    
    3042                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3043                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2db)
    3044                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    3045                            .dwendtag $C$DW$T$62
    3046                    
    3047                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    3048                            .dwattr $C$DW$T$79, DW_AT_name("keyDescriptor_t")
    3049                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$62)
    3050                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3051                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3052                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x2ec)
    3053                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3054                    
    3055                    $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    3056                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    3057                            .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    3058                    
    3059                    
    3060                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3061                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    3062                    $C$DW$300       .dwtag  DW_TAG_member
    3063                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$46)
    3064                            .dwattr $C$DW$300, DW_AT_name("frameCounter")
    3065                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("frameCounter")
    3066                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3067                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3068                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3069                            .dwattr $C$DW$300, DW_AT_decl_line(0x2f1)
    3070                            .dwattr $C$DW$300, DW_AT_decl_column(0x18)
    3071                    
    3072                    $C$DW$301       .dwtag  DW_TAG_member
    3073                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$23)
    3074                            .dwattr $C$DW$301, DW_AT_name("frameCntrIdx")
    3075                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("frameCntrIdx")
    3076                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3077                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3078                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3079                            .dwattr $C$DW$301, DW_AT_decl_line(0x2f2)
    3080                            .dwattr $C$DW$301, DW_AT_decl_column(0x18)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   57

    3081                    
    3082                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3083                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x2f0)
    3084                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    3085                            .dwendtag $C$DW$T$63
    3086                    
    3087                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    3088                            .dwattr $C$DW$T$66, DW_AT_name("frameCntr_t")
    3089                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$63)
    3090                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3091                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3092                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x2f3)
    3093                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3094                    
    3095                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    3096                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3097                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    3098                    
    3099                    
    3100                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3101                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x14)
    3102                    $C$DW$302       .dwtag  DW_TAG_member
    3103                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$23)
    3104                            .dwattr $C$DW$302, DW_AT_name("panID")
    3105                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("panID")
    3106                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3107                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3108                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3109                            .dwattr $C$DW$302, DW_AT_decl_line(0x2f8)
    3110                            .dwattr $C$DW$302, DW_AT_decl_column(0x16)
    3111                    
    3112                    $C$DW$303       .dwtag  DW_TAG_member
    3113                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$23)
    3114                            .dwattr $C$DW$303, DW_AT_name("shortAddress")
    3115                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("shortAddress")
    3116                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3117                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3118                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3119                            .dwattr $C$DW$303, DW_AT_decl_line(0x2f9)
    3120                            .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    3121                    
    3122                    $C$DW$304       .dwtag  DW_TAG_member
    3123                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$65)
    3124                            .dwattr $C$DW$304, DW_AT_name("extAddress")
    3125                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("extAddress")
    3126                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3127                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3128                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3129                            .dwattr $C$DW$304, DW_AT_decl_line(0x2fa)
    3130                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3131                    
    3132                    $C$DW$305       .dwtag  DW_TAG_member
    3133                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$67)
    3134                            .dwattr $C$DW$305, DW_AT_name("frameCtr")
    3135                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("frameCtr")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   58

    3136                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3137                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3138                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3139                            .dwattr $C$DW$305, DW_AT_decl_line(0x2fd)
    3140                            .dwattr $C$DW$305, DW_AT_decl_column(0x19)
    3141                    
    3142                    $C$DW$306       .dwtag  DW_TAG_member
    3143                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$25)
    3144                            .dwattr $C$DW$306, DW_AT_name("exempt")
    3145                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("exempt")
    3146                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3147                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3148                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3149                            .dwattr $C$DW$306, DW_AT_decl_line(0x303)
    3150                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3151                    
    3152                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3153                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x2f7)
    3154                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
    3155                            .dwendtag $C$DW$T$68
    3156                    
    3157                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    3158                            .dwattr $C$DW$T$74, DW_AT_name("deviceDescriptor_t")
    3159                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$68)
    3160                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3161                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3162                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x305)
    3163                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3164                    
    3165                    $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    3166                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$74)
    3167                            .dwattr $C$DW$T$184, DW_AT_address_class(0x20)
    3168                    
    3169                    
    3170                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3171                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
    3172                    $C$DW$307       .dwtag  DW_TAG_member
    3173                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    3174                            .dwattr $C$DW$307, DW_AT_name("frameType")
    3175                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("frameType")
    3176                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3177                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3178                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3179                            .dwattr $C$DW$307, DW_AT_decl_line(0x30a)
    3180                            .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    3181                    
    3182                    $C$DW$308       .dwtag  DW_TAG_member
    3183                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    3184                            .dwattr $C$DW$308, DW_AT_name("commandFrameIdentifier")
    3185                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3186                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3187                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3188                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3189                            .dwattr $C$DW$308, DW_AT_decl_line(0x30b)
    3190                            .dwattr $C$DW$308, DW_AT_decl_column(0x16)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   59

    3191                    
    3192                    $C$DW$309       .dwtag  DW_TAG_member
    3193                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    3194                            .dwattr $C$DW$309, DW_AT_name("securityMinimum")
    3195                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("securityMinimum")
    3196                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3197                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3198                            .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3199                            .dwattr $C$DW$309, DW_AT_decl_line(0x30c)
    3200                            .dwattr $C$DW$309, DW_AT_decl_column(0x16)
    3201                    
    3202                    $C$DW$310       .dwtag  DW_TAG_member
    3203                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$25)
    3204                            .dwattr $C$DW$310, DW_AT_name("securityOverrideSecurityMinimum")
    3205                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3206                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3207                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3208                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3209                            .dwattr $C$DW$310, DW_AT_decl_line(0x30e)
    3210                            .dwattr $C$DW$310, DW_AT_decl_column(0x16)
    3211                    
    3212                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3213                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x309)
    3214                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    3215                            .dwendtag $C$DW$T$69
    3216                    
    3217                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    3218                            .dwattr $C$DW$T$76, DW_AT_name("securityLevelDescriptor_t")
    3219                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$69)
    3220                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3221                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3222                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x317)
    3223                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    3224                    
    3225                    
    3226                    $C$DW$T$185     .dwtag  DW_TAG_array_type
    3227                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$76)
    3228                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    3229                            .dwattr $C$DW$T$185, DW_AT_byte_size(0x08)
    3230                    $C$DW$311       .dwtag  DW_TAG_subrange_type
    3231                            .dwattr $C$DW$311, DW_AT_upper_bound(0x01)
    3232                    
    3233                            .dwendtag $C$DW$T$185
    3234                    
    3235                    
    3236                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3237                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0e)
    3238                    $C$DW$312       .dwtag  DW_TAG_member
    3239                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$23)
    3240                            .dwattr $C$DW$312, DW_AT_name("key_index")
    3241                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("key_index")
    3242                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3243                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3244                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3245                            .dwattr $C$DW$312, DW_AT_decl_line(0x31c)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   60

    3246                            .dwattr $C$DW$312, DW_AT_decl_column(0x1b)
    3247                    
    3248                    $C$DW$313       .dwtag  DW_TAG_member
    3249                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    3250                            .dwattr $C$DW$313, DW_AT_name("key_id_lookup_index")
    3251                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("key_id_lookup_index")
    3252                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3253                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3254                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3255                            .dwattr $C$DW$313, DW_AT_decl_line(0x31d)
    3256                            .dwattr $C$DW$313, DW_AT_decl_column(0x1b)
    3257                    
    3258                    $C$DW$314       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$55)
    3260                            .dwattr $C$DW$314, DW_AT_name("macKeyIdLookupEntry")
    3261                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3262                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3263                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3265                            .dwattr $C$DW$314, DW_AT_decl_line(0x31e)
    3266                            .dwattr $C$DW$314, DW_AT_decl_column(0x1b)
    3267                    
    3268                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3269                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x31b)
    3270                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    3271                            .dwendtag $C$DW$T$70
    3272                    
    3273                    $C$DW$T$548     .dwtag  DW_TAG_typedef
    3274                            .dwattr $C$DW$T$548, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3275                            .dwattr $C$DW$T$548, DW_AT_type(*$C$DW$T$70)
    3276                            .dwattr $C$DW$T$548, DW_AT_language(DW_LANG_C)
    3277                            .dwattr $C$DW$T$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    3278                            .dwattr $C$DW$T$548, DW_AT_decl_line(0x31f)
    3279                            .dwattr $C$DW$T$548, DW_AT_decl_column(0x03)
    3280                    
    3281                    
    3282                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3283                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
    3284                    $C$DW$315       .dwtag  DW_TAG_member
    3285                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$23)
    3286                            .dwattr $C$DW$315, DW_AT_name("key_index")
    3287                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("key_index")
    3288                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3289                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3290                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3291                            .dwattr $C$DW$315, DW_AT_decl_line(0x323)
    3292                            .dwattr $C$DW$315, DW_AT_decl_column(0x1b)
    3293                    
    3294                    $C$DW$316       .dwtag  DW_TAG_member
    3295                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$23)
    3296                            .dwattr $C$DW$316, DW_AT_name("key_device_index")
    3297                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("key_device_index")
    3298                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3299                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3300                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   61

    3301                            .dwattr $C$DW$316, DW_AT_decl_line(0x324)
    3302                            .dwattr $C$DW$316, DW_AT_decl_column(0x1b)
    3303                    
    3304                    $C$DW$317       .dwtag  DW_TAG_member
    3305                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$57)
    3306                            .dwattr $C$DW$317, DW_AT_name("macKeyDeviceEntry")
    3307                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3308                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3309                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3310                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3311                            .dwattr $C$DW$317, DW_AT_decl_line(0x325)
    3312                            .dwattr $C$DW$317, DW_AT_decl_column(0x1b)
    3313                    
    3314                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3315                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x322)
    3316                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
    3317                            .dwendtag $C$DW$T$71
    3318                    
    3319                    $C$DW$T$549     .dwtag  DW_TAG_typedef
    3320                            .dwattr $C$DW$T$549, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3321                            .dwattr $C$DW$T$549, DW_AT_type(*$C$DW$T$71)
    3322                            .dwattr $C$DW$T$549, DW_AT_language(DW_LANG_C)
    3323                            .dwattr $C$DW$T$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    3324                            .dwattr $C$DW$T$549, DW_AT_decl_line(0x326)
    3325                            .dwattr $C$DW$T$549, DW_AT_decl_column(0x03)
    3326                    
    3327                    
    3328                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    3329                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    3330                    $C$DW$318       .dwtag  DW_TAG_member
    3331                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$23)
    3332                            .dwattr $C$DW$318, DW_AT_name("key_index")
    3333                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("key_index")
    3334                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3336                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3337                            .dwattr $C$DW$318, DW_AT_decl_line(0x32a)
    3338                            .dwattr $C$DW$318, DW_AT_decl_column(0x1b)
    3339                    
    3340                    $C$DW$319       .dwtag  DW_TAG_member
    3341                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    3342                            .dwattr $C$DW$319, DW_AT_name("key_key_usage_index")
    3343                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("key_key_usage_index")
    3344                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3345                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3346                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3347                            .dwattr $C$DW$319, DW_AT_decl_line(0x32b)
    3348                            .dwattr $C$DW$319, DW_AT_decl_column(0x1b)
    3349                    
    3350                    $C$DW$320       .dwtag  DW_TAG_member
    3351                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$59)
    3352                            .dwattr $C$DW$320, DW_AT_name("macKeyUsageEntry")
    3353                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("macKeyUsageEntry")
    3354                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3355                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{9DA82AD7-7E16-47C6-B70C-164BCF9DBD6A} PAGE   62

    3356                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    3357                            .dwattr $C$DW$320, DW_AT_decl_line(0x32c)
    3358                            .dwattr $C$DW$320, DW_AT_decl_column(0x1b)
    3359                    
    3360                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    3361                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x329)
    3362                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    3363                            .dwendtag $C$DW$T$72
    3364                    
    3365                    $C$DW$T$550     .dwtag  DW_TAG_typedef
    3366                            .dwattr $C$DW$T$550, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3367                            .dwattr $C$DW$T$550, DW_AT_type(*$C$DW$T$72)
    3368                            .dwattr $C$DW$T$550, DW_AT_language(DW_LANG_C)
    3369                            .dwattr $C$DW$T$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    3370                            .dwattr $C$DW$T$550, DW_AT_decl_line(0x32d)
    3371                            .dwattr $C$DW$T$550, DW_AT_decl_column(0x03)
    3372                    
    3373                    
    3374                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3375                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x18)
    3376                    $C$DW$321       .dwtag  DW_TAG_member
    3377                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$23)
    3378                            .dwattr $C$DW$321, DW_AT_name("key_index")
    3379                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("key_index")
    3380                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3381                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3382                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
