TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:24 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    ;*****************************************************************************

    7234                    
    7235                    $C$DW$T$210     .dwtag  DW_TAG_typedef
    7236                            .dwattr $C$DW$T$210, DW_AT_name("tFlashStateCommandsType")
    7237                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    7238                            .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    7239                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
    7240                            .dwattr $C$DW$T$210, DW_AT_decl_line(0xb0)
    7241                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x03)
    7242                    
    7243                    
    7244                    $C$DW$T$211     .dwtag  DW_TAG_enumeration_type
    7245                            .dwattr $C$DW$T$211, DW_AT_byte_size(0x01)
    7246                    $C$DW$465       .dwtag  DW_TAG_enumerator
    7247                            .dwattr $C$DW$465, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    7248                            .dwattr $C$DW$465, DW_AT_const_value(0xe0)
    7249                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7250                            .dwattr $C$DW$465, DW_AT_decl_line(0x3de)
    7251                            .dwattr $C$DW$465, DW_AT_decl_column(0x04)
    7252                    
    7253                    $C$DW$466       .dwtag  DW_TAG_enumerator
    7254                            .dwattr $C$DW$466, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    7255                            .dwattr $C$DW$466, DW_AT_const_value(0xe1)
    7256                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7257                            .dwattr $C$DW$466, DW_AT_decl_line(0x3e0)
    7258                            .dwattr $C$DW$466, DW_AT_decl_column(0x04)
    7259                    
    7260                    $C$DW$467       .dwtag  DW_TAG_enumerator
    7261                            .dwattr $C$DW$467, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    7262                            .dwattr $C$DW$467, DW_AT_const_value(0xe2)
    7263                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7264                            .dwattr $C$DW$467, DW_AT_decl_line(0x3e2)
    7265                            .dwattr $C$DW$467, DW_AT_decl_column(0x04)
    7266                    
    7267                    $C$DW$468       .dwtag  DW_TAG_enumerator
    7268                            .dwattr $C$DW$468, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    7269                            .dwattr $C$DW$468, DW_AT_const_value(0xe3)
    7270                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7271                            .dwattr $C$DW$468, DW_AT_decl_line(0x3e4)
    7272                            .dwattr $C$DW$468, DW_AT_decl_column(0x04)
    7273                    
    7274                    $C$DW$469       .dwtag  DW_TAG_enumerator
    7275                            .dwattr $C$DW$469, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  134

    7276                            .dwattr $C$DW$469, DW_AT_const_value(0xe4)
    7277                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7278                            .dwattr $C$DW$469, DW_AT_decl_line(0x3e6)
    7279                            .dwattr $C$DW$469, DW_AT_decl_column(0x04)
    7280                    
    7281                    $C$DW$470       .dwtag  DW_TAG_enumerator
    7282                            .dwattr $C$DW$470, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    7283                            .dwattr $C$DW$470, DW_AT_const_value(0xe5)
    7284                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7285                            .dwattr $C$DW$470, DW_AT_decl_line(0x3e8)
    7286                            .dwattr $C$DW$470, DW_AT_decl_column(0x04)
    7287                    
    7288                            .dwattr $C$DW$T$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    7289                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x3dc)
    7290                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x01)
    7291                            .dwendtag $C$DW$T$211
    7292                    
    7293                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    7294                            .dwattr $C$DW$T$212, DW_AT_name("ICall_RemotiCmdEvent_t")
    7295                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$211)
    7296                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    7297                            .dwattr $C$DW$T$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    7298                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x3e9)
    7299                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x02)
    7300                    
    7301                    
    7302                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7303                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    7304                    $C$DW$471       .dwtag  DW_TAG_member
    7305                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$21)
    7306                            .dwattr $C$DW$471, DW_AT_name("event")
    7307                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("event")
    7308                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7309                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7310                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7311                            .dwattr $C$DW$471, DW_AT_decl_line(0x79)
    7312                            .dwattr $C$DW$471, DW_AT_decl_column(0x0a)
    7313                    
    7314                    $C$DW$472       .dwtag  DW_TAG_member
    7315                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$21)
    7316                            .dwattr $C$DW$472, DW_AT_name("status")
    7317                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("status")
    7318                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7319                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7320                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7321                            .dwattr $C$DW$472, DW_AT_decl_line(0x7a)
    7322                            .dwattr $C$DW$472, DW_AT_decl_column(0x0a)
    7323                    
    7324                            .dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7325                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x78)
    7326                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    7327                            .dwendtag $C$DW$T$22
    7328                    
    7329                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    7330                            .dwattr $C$DW$T$93, DW_AT_name("osal_event_hdr_t")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  135

    7331                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$22)
    7332                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7333                            .dwattr $C$DW$T$93, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7334                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x7b)
    7335                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    7336                    
    7337                    $C$DW$T$215     .dwtag  DW_TAG_pointer_type
    7338                            .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$93)
    7339                            .dwattr $C$DW$T$215, DW_AT_address_class(0x20)
    7340                    
    7341                    
    7342                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7343                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    7344                    $C$DW$473       .dwtag  DW_TAG_member
    7345                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$14)
    7346                            .dwattr $C$DW$473, DW_AT_name("__max_align1")
    7347                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("__max_align1")
    7348                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7349                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7350                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7351                            .dwattr $C$DW$473, DW_AT_decl_line(0x70)
    7352                            .dwattr $C$DW$473, DW_AT_decl_column(0x0c)
    7353                    
    7354                    $C$DW$474       .dwtag  DW_TAG_member
    7355                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$18)
    7356                            .dwattr $C$DW$474, DW_AT_name("__max_align2")
    7357                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("__max_align2")
    7358                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7359                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7360                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7361                            .dwattr $C$DW$474, DW_AT_decl_line(0x71)
    7362                            .dwattr $C$DW$474, DW_AT_decl_column(0x0e)
    7363                    
    7364                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    7365                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x6f)
    7366                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    7367                            .dwendtag $C$DW$T$23
    7368                    
    7369                    $C$DW$T$217     .dwtag  DW_TAG_typedef
    7370                            .dwattr $C$DW$T$217, DW_AT_name("__max_align_t")
    7371                            .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$23)
    7372                            .dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
    7373                            .dwattr $C$DW$T$217, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    7374                            .dwattr $C$DW$T$217, DW_AT_decl_line(0x72)
    7375                            .dwattr $C$DW$T$217, DW_AT_decl_column(0x03)
    7376                    
    7377                    
    7378                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    7379                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x4c)
    7380                    $C$DW$475       .dwtag  DW_TAG_member
    7381                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$31)
    7382                            .dwattr $C$DW$475, DW_AT_name("Crc32")
    7383                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("Crc32")
    7384                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7385                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  136

    7386                            .dwattr $C$DW$475, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7387                            .dwattr $C$DW$475, DW_AT_decl_line(0x76)
    7388                            .dwattr $C$DW$475, DW_AT_decl_column(0x25)
    7389                    
    7390                    $C$DW$476       .dwtag  DW_TAG_member
    7391                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$34)
    7392                            .dwattr $C$DW$476, DW_AT_name("FlashGetSize")
    7393                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("FlashGetSize")
    7394                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7395                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7396                            .dwattr $C$DW$476, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7397                            .dwattr $C$DW$476, DW_AT_decl_line(0x77)
    7398                            .dwattr $C$DW$476, DW_AT_decl_column(0x25)
    7399                    
    7400                    $C$DW$477       .dwtag  DW_TAG_member
    7401                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$35)
    7402                            .dwattr $C$DW$477, DW_AT_name("GetChipId")
    7403                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("GetChipId")
    7404                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7405                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7406                            .dwattr $C$DW$477, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7407                            .dwattr $C$DW$477, DW_AT_decl_line(0x78)
    7408                            .dwattr $C$DW$477, DW_AT_decl_column(0x25)
    7409                    
    7410                    $C$DW$478       .dwtag  DW_TAG_member
    7411                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$38)
    7412                            .dwattr $C$DW$478, DW_AT_name("ReservedLocation1")
    7413                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("ReservedLocation1")
    7414                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7415                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7416                            .dwattr $C$DW$478, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7417                            .dwattr $C$DW$478, DW_AT_decl_line(0x79)
    7418                            .dwattr $C$DW$478, DW_AT_decl_column(0x25)
    7419                    
    7420                    $C$DW$479       .dwtag  DW_TAG_member
    7421                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$39)
    7422                            .dwattr $C$DW$479, DW_AT_name("ReservedLocation2")
    7423                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("ReservedLocation2")
    7424                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7425                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7426                            .dwattr $C$DW$479, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7427                            .dwattr $C$DW$479, DW_AT_decl_line(0x7a)
    7428                            .dwattr $C$DW$479, DW_AT_decl_column(0x25)
    7429                    
    7430                    $C$DW$480       .dwtag  DW_TAG_member
    7431                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$40)
    7432                            .dwattr $C$DW$480, DW_AT_name("ReservedLocation3")
    7433                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("ReservedLocation3")
    7434                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7435                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7436                            .dwattr $C$DW$480, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7437                            .dwattr $C$DW$480, DW_AT_decl_line(0x7b)
    7438                            .dwattr $C$DW$480, DW_AT_decl_column(0x25)
    7439                    
    7440                    $C$DW$481       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  137

    7441                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$43)
    7442                            .dwattr $C$DW$481, DW_AT_name("ResetDevice")
    7443                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("ResetDevice")
    7444                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7445                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7446                            .dwattr $C$DW$481, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7447                            .dwattr $C$DW$481, DW_AT_decl_line(0x7c)
    7448                            .dwattr $C$DW$481, DW_AT_decl_column(0x25)
    7449                    
    7450                    $C$DW$482       .dwtag  DW_TAG_member
    7451                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$49)
    7452                            .dwattr $C$DW$482, DW_AT_name("Fletcher32")
    7453                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("Fletcher32")
    7454                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7455                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7456                            .dwattr $C$DW$482, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7457                            .dwattr $C$DW$482, DW_AT_decl_line(0x7d)
    7458                            .dwattr $C$DW$482, DW_AT_decl_column(0x25)
    7459                    
    7460                    $C$DW$483       .dwtag  DW_TAG_member
    7461                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$53)
    7462                            .dwattr $C$DW$483, DW_AT_name("MinValue")
    7463                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("MinValue")
    7464                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7465                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7466                            .dwattr $C$DW$483, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7467                            .dwattr $C$DW$483, DW_AT_decl_line(0x7e)
    7468                            .dwattr $C$DW$483, DW_AT_decl_column(0x25)
    7469                    
    7470                    $C$DW$484       .dwtag  DW_TAG_member
    7471                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    7472                            .dwattr $C$DW$484, DW_AT_name("MaxValue")
    7473                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("MaxValue")
    7474                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7475                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7476                            .dwattr $C$DW$484, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7477                            .dwattr $C$DW$484, DW_AT_decl_line(0x7f)
    7478                            .dwattr $C$DW$484, DW_AT_decl_column(0x25)
    7479                    
    7480                    $C$DW$485       .dwtag  DW_TAG_member
    7481                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$55)
    7482                            .dwattr $C$DW$485, DW_AT_name("MeanValue")
    7483                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("MeanValue")
    7484                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7485                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7486                            .dwattr $C$DW$485, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7487                            .dwattr $C$DW$485, DW_AT_decl_line(0x80)
    7488                            .dwattr $C$DW$485, DW_AT_decl_column(0x25)
    7489                    
    7490                    $C$DW$486       .dwtag  DW_TAG_member
    7491                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$56)
    7492                            .dwattr $C$DW$486, DW_AT_name("StandDeviationValue")
    7493                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("StandDeviationValue")
    7494                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7495                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  138

    7496                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7497                            .dwattr $C$DW$486, DW_AT_decl_line(0x81)
    7498                            .dwattr $C$DW$486, DW_AT_decl_column(0x25)
    7499                    
    7500                    $C$DW$487       .dwtag  DW_TAG_member
    7501                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$59)
    7502                            .dwattr $C$DW$487, DW_AT_name("ReservedLocation4")
    7503                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("ReservedLocation4")
    7504                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7505                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7506                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7507                            .dwattr $C$DW$487, DW_AT_decl_line(0x82)
    7508                            .dwattr $C$DW$487, DW_AT_decl_column(0x25)
    7509                    
    7510                    $C$DW$488       .dwtag  DW_TAG_member
    7511                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$60)
    7512                            .dwattr $C$DW$488, DW_AT_name("ReservedLocation5")
    7513                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("ReservedLocation5")
    7514                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7515                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7516                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7517                            .dwattr $C$DW$488, DW_AT_decl_line(0x83)
    7518                            .dwattr $C$DW$488, DW_AT_decl_column(0x25)
    7519                    
    7520                    $C$DW$489       .dwtag  DW_TAG_member
    7521                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$61)
    7522                            .dwattr $C$DW$489, DW_AT_name("HFSourceSafeSwitch")
    7523                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7524                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7525                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7526                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7527                            .dwattr $C$DW$489, DW_AT_decl_line(0x84)
    7528                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    7529                    
    7530                    $C$DW$490       .dwtag  DW_TAG_member
    7531                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$64)
    7532                            .dwattr $C$DW$490, DW_AT_name("SelectCompAInput")
    7533                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("SelectCompAInput")
    7534                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7535                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7536                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7537                            .dwattr $C$DW$490, DW_AT_decl_line(0x85)
    7538                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
    7539                    
    7540                    $C$DW$491       .dwtag  DW_TAG_member
    7541                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$65)
    7542                            .dwattr $C$DW$491, DW_AT_name("SelectCompARef")
    7543                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("SelectCompARef")
    7544                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7545                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7546                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7547                            .dwattr $C$DW$491, DW_AT_decl_line(0x86)
    7548                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    7549                    
    7550                    $C$DW$492       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  139

    7551                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$66)
    7552                            .dwattr $C$DW$492, DW_AT_name("SelectADCCompBInput")
    7553                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7554                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7555                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7556                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7557                            .dwattr $C$DW$492, DW_AT_decl_line(0x87)
    7558                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    7559                    
    7560                    $C$DW$493       .dwtag  DW_TAG_member
    7561                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$67)
    7562                            .dwattr $C$DW$493, DW_AT_name("SelectCompBRef")
    7563                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("SelectCompBRef")
    7564                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7565                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7566                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    7567                            .dwattr $C$DW$493, DW_AT_decl_line(0x88)
    7568                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    7569                    
    7570                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    7571                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x75)
    7572                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
    7573                            .dwendtag $C$DW$T$68
    7574                    
    7575                    $C$DW$T$218     .dwtag  DW_TAG_typedef
    7576                            .dwattr $C$DW$T$218, DW_AT_name("HARD_API_T")
    7577                            .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$68)
    7578                            .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    7579                            .dwattr $C$DW$T$218, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices
    7580                            .dwattr $C$DW$T$218, DW_AT_decl_line(0x89)
    7581                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x03)
    7582                    
    7583                    
    7584                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    7585                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    7586                    $C$DW$494       .dwtag  DW_TAG_member
    7587                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$10)
    7588                            .dwattr $C$DW$494, DW_AT_name("quot")
    7589                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("quot")
    7590                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7591                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7592                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7593                            .dwattr $C$DW$494, DW_AT_decl_line(0x49)
    7594                            .dwattr $C$DW$494, DW_AT_decl_column(0x16)
    7595                    
    7596                    $C$DW$495       .dwtag  DW_TAG_member
    7597                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$10)
    7598                            .dwattr $C$DW$495, DW_AT_name("rem")
    7599                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("rem")
    7600                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7601                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7602                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7603                            .dwattr $C$DW$495, DW_AT_decl_line(0x49)
    7604                            .dwattr $C$DW$495, DW_AT_decl_column(0x1c)
    7605                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  140

    7606                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    7607                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x49)
    7608                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    7609                            .dwendtag $C$DW$T$69
    7610                    
    7611                    $C$DW$T$219     .dwtag  DW_TAG_typedef
    7612                            .dwattr $C$DW$T$219, DW_AT_name("div_t")
    7613                            .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$69)
    7614                            .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    7615                            .dwattr $C$DW$T$219, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    7616                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x49)
    7617                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x23)
    7618                    
    7619                    
    7620                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    7621                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    7622                    $C$DW$496       .dwtag  DW_TAG_member
    7623                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$10)
    7624                            .dwattr $C$DW$496, DW_AT_name("quot")
    7625                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("quot")
    7626                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7627                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7628                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7629                            .dwattr $C$DW$496, DW_AT_decl_line(0x4e)
    7630                            .dwattr $C$DW$496, DW_AT_decl_column(0x16)
    7631                    
    7632                    $C$DW$497       .dwtag  DW_TAG_member
    7633                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$10)
    7634                            .dwattr $C$DW$497, DW_AT_name("rem")
    7635                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("rem")
    7636                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7637                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7638                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7639                            .dwattr $C$DW$497, DW_AT_decl_line(0x4e)
    7640                            .dwattr $C$DW$497, DW_AT_decl_column(0x1c)
    7641                    
    7642                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    7643                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x4e)
    7644                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    7645                            .dwendtag $C$DW$T$70
    7646                    
    7647                    $C$DW$T$220     .dwtag  DW_TAG_typedef
    7648                            .dwattr $C$DW$T$220, DW_AT_name("ldiv_t")
    7649                            .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$70)
    7650                            .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    7651                            .dwattr $C$DW$T$220, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    7652                            .dwattr $C$DW$T$220, DW_AT_decl_line(0x4e)
    7653                            .dwattr $C$DW$T$220, DW_AT_decl_column(0x23)
    7654                    
    7655                    
    7656                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7657                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x10)
    7658                    $C$DW$498       .dwtag  DW_TAG_member
    7659                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$14)
    7660                            .dwattr $C$DW$498, DW_AT_name("quot")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  141

    7661                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("quot")
    7662                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7663                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7664                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7665                            .dwattr $C$DW$498, DW_AT_decl_line(0x56)
    7666                            .dwattr $C$DW$498, DW_AT_decl_column(0x1c)
    7667                    
    7668                    $C$DW$499       .dwtag  DW_TAG_member
    7669                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$14)
    7670                            .dwattr $C$DW$499, DW_AT_name("rem")
    7671                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("rem")
    7672                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7673                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7674                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    7675                            .dwattr $C$DW$499, DW_AT_decl_line(0x56)
    7676                            .dwattr $C$DW$499, DW_AT_decl_column(0x22)
    7677                    
    7678                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    7679                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x56)
    7680                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    7681                            .dwendtag $C$DW$T$71
    7682                    
    7683                    $C$DW$T$221     .dwtag  DW_TAG_typedef
    7684                            .dwattr $C$DW$T$221, DW_AT_name("lldiv_t")
    7685                            .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$71)
    7686                            .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    7687                            .dwattr $C$DW$T$221, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    7688                            .dwattr $C$DW$T$221, DW_AT_decl_line(0x56)
    7689                            .dwattr $C$DW$T$221, DW_AT_decl_column(0x29)
    7690                    
    7691                    
    7692                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    7693                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    7694                    $C$DW$500       .dwtag  DW_TAG_member
    7695                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$74)
    7696                            .dwattr $C$DW$500, DW_AT_name("pointerStack")
    7697                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("pointerStack")
    7698                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7699                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7700                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7701                            .dwattr $C$DW$500, DW_AT_decl_line(0x3f5)
    7702                            .dwattr $C$DW$500, DW_AT_decl_column(0x16)
    7703                    
    7704                    $C$DW$501       .dwtag  DW_TAG_member
    7705                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$75)
    7706                            .dwattr $C$DW$501, DW_AT_name("directAPI")
    7707                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("directAPI")
    7708                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7709                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    7710                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7711                            .dwattr $C$DW$501, DW_AT_decl_line(0x3f6)
    7712                            .dwattr $C$DW$501, DW_AT_decl_column(0x15)
    7713                    
    7714                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7715                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3f4)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  142

    7716                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    7717                            .dwendtag $C$DW$T$76
    7718                    
    7719                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    7720                            .dwattr $C$DW$T$78, DW_AT_name("icall_directAPIMsg_t")
    7721                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    7722                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    7723                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7724                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x3f7)
    7725                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    7726                    
    7727                    
    7728                    $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7729                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x14)
    7730                    $C$DW$502       .dwtag  DW_TAG_member
    7731                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$77)
    7732                            .dwattr $C$DW$502, DW_AT_name("hdr")
    7733                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("hdr")
    7734                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7735                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    7736                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7737                            .dwattr $C$DW$502, DW_AT_decl_line(0x3fb)
    7738                            .dwattr $C$DW$502, DW_AT_decl_column(0x10)
    7739                    
    7740                    $C$DW$503       .dwtag  DW_TAG_member
    7741                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$78)
    7742                            .dwattr $C$DW$503, DW_AT_name("msg")
    7743                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("msg")
    7744                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7745                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    7746                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7747                            .dwattr $C$DW$503, DW_AT_decl_line(0x3fc)
    7748                            .dwattr $C$DW$503, DW_AT_decl_column(0x1a)
    7749                    
    7750                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7751                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3fa)
    7752                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
    7753                            .dwendtag $C$DW$T$79
    7754                    
    7755                    $C$DW$T$222     .dwtag  DW_TAG_typedef
    7756                            .dwattr $C$DW$T$222, DW_AT_name("icallLiteMsg_t")
    7757                            .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$79)
    7758                            .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    7759                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    7760                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x3fd)
    7761                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x03)
    7762                    
    7763                    
    7764                    $C$DW$T$81      .dwtag  DW_TAG_structure_type
    7765                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x02)
    7766                    $C$DW$504       .dwtag  DW_TAG_member
    7767                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$80)
    7768                            .dwattr $C$DW$504, DW_AT_name("pwrmgr_task_state")
    7769                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("pwrmgr_task_state")
    7770                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  143

    7771                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    7772                            .dwattr $C$DW$504, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7773                            .dwattr $C$DW$504, DW_AT_decl_line(0x48)
    7774                            .dwattr $C$DW$504, DW_AT_decl_column(0x0a)
    7775                    
    7776                            .dwattr $C$DW$T$81, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7777                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x47)
    7778                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x01)
    7779                            .dwendtag $C$DW$T$81
    7780                    
    7781                    $C$DW$T$223     .dwtag  DW_TAG_typedef
    7782                            .dwattr $C$DW$T$223, DW_AT_name("pwrmgr_attribute_t")
    7783                            .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$81)
    7784                            .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    7785                            .dwattr $C$DW$T$223, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7786                            .dwattr $C$DW$T$223, DW_AT_decl_line(0x4e)
    7787                            .dwattr $C$DW$T$223, DW_AT_decl_column(0x03)
    7788                    
    7789                    
    7790                    $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7791                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    7792                    $C$DW$505       .dwtag  DW_TAG_member
    7793                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$21)
    7794                            .dwattr $C$DW$505, DW_AT_name("seconds")
    7795                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("seconds")
    7796                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7797                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    7798                            .dwattr $C$DW$505, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7799                            .dwattr $C$DW$505, DW_AT_decl_line(0x50)
    7800                            .dwattr $C$DW$505, DW_AT_decl_column(0x09)
    7801                    
    7802                    $C$DW$506       .dwtag  DW_TAG_member
    7803                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$21)
    7804                            .dwattr $C$DW$506, DW_AT_name("minutes")
    7805                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("minutes")
    7806                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7807                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    7808                            .dwattr $C$DW$506, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7809                            .dwattr $C$DW$506, DW_AT_decl_line(0x51)
    7810                            .dwattr $C$DW$506, DW_AT_decl_column(0x09)
    7811                    
    7812                    $C$DW$507       .dwtag  DW_TAG_member
    7813                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
    7814                            .dwattr $C$DW$507, DW_AT_name("hour")
    7815                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("hour")
    7816                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7817                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    7818                            .dwattr $C$DW$507, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7819                            .dwattr $C$DW$507, DW_AT_decl_line(0x52)
    7820                            .dwattr $C$DW$507, DW_AT_decl_column(0x09)
    7821                    
    7822                    $C$DW$508       .dwtag  DW_TAG_member
    7823                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$21)
    7824                            .dwattr $C$DW$508, DW_AT_name("day")
    7825                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("day")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  144

    7826                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7827                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    7828                            .dwattr $C$DW$508, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7829                            .dwattr $C$DW$508, DW_AT_decl_line(0x53)
    7830                            .dwattr $C$DW$508, DW_AT_decl_column(0x09)
    7831                    
    7832                    $C$DW$509       .dwtag  DW_TAG_member
    7833                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$21)
    7834                            .dwattr $C$DW$509, DW_AT_name("month")
    7835                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("month")
    7836                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7837                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    7838                            .dwattr $C$DW$509, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7839                            .dwattr $C$DW$509, DW_AT_decl_line(0x54)
    7840                            .dwattr $C$DW$509, DW_AT_decl_column(0x09)
    7841                    
    7842                    $C$DW$510       .dwtag  DW_TAG_member
    7843                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$80)
    7844                            .dwattr $C$DW$510, DW_AT_name("year")
    7845                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("year")
    7846                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7847                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    7848                            .dwattr $C$DW$510, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7849                            .dwattr $C$DW$510, DW_AT_decl_line(0x55)
    7850                            .dwattr $C$DW$510, DW_AT_decl_column(0x0a)
    7851                    
    7852                            .dwattr $C$DW$T$82, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7853                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x4f)
    7854                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x01)
    7855                            .dwendtag $C$DW$T$82
    7856                    
    7857                    $C$DW$T$224     .dwtag  DW_TAG_typedef
    7858                            .dwattr $C$DW$T$224, DW_AT_name("UTCTimeStruct")
    7859                            .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$82)
    7860                            .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    7861                            .dwattr $C$DW$T$224, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7862                            .dwattr $C$DW$T$224, DW_AT_decl_line(0x56)
    7863                            .dwattr $C$DW$T$224, DW_AT_decl_column(0x03)
    7864                    
    7865                    
    7866                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7867                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x0c)
    7868                    $C$DW$511       .dwtag  DW_TAG_member
    7869                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$83)
    7870                            .dwattr $C$DW$511, DW_AT_name("bufferHead")
    7871                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("bufferHead")
    7872                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7873                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    7874                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7875                            .dwattr $C$DW$511, DW_AT_decl_line(0x80)
    7876                            .dwattr $C$DW$511, DW_AT_decl_column(0x13)
    7877                    
    7878                    $C$DW$512       .dwtag  DW_TAG_member
    7879                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$83)
    7880                            .dwattr $C$DW$512, DW_AT_name("bufferTail")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  145

    7881                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("bufferTail")
    7882                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7883                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    7884                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7885                            .dwattr $C$DW$512, DW_AT_decl_line(0x81)
    7886                            .dwattr $C$DW$512, DW_AT_decl_column(0x13)
    7887                    
    7888                    $C$DW$513       .dwtag  DW_TAG_member
    7889                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$80)
    7890                            .dwattr $C$DW$513, DW_AT_name("maxBufSize")
    7891                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("maxBufSize")
    7892                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7893                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    7894                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7895                            .dwattr $C$DW$513, DW_AT_decl_line(0x82)
    7896                            .dwattr $C$DW$513, DW_AT_decl_column(0x0a)
    7897                    
    7898                    $C$DW$514       .dwtag  DW_TAG_member
    7899                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$84)
    7900                            .dwattr $C$DW$514, DW_AT_name("pBuffer")
    7901                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("pBuffer")
    7902                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7903                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    7904                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7905                            .dwattr $C$DW$514, DW_AT_decl_line(0x83)
    7906                            .dwattr $C$DW$514, DW_AT_decl_column(0x0a)
    7907                    
    7908                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7909                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7e)
    7910                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    7911                            .dwendtag $C$DW$T$85
    7912                    
    7913                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    7914                            .dwattr $C$DW$T$87, DW_AT_name("halUARTBufControl_t")
    7915                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$85)
    7916                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    7917                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    7918                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x84)
    7919                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    7920                    
    7921                    
    7922                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    7923                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x2c)
    7924                    $C$DW$515       .dwtag  DW_TAG_member
    7925                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$86)
    7926                            .dwattr $C$DW$515, DW_AT_name("configured")
    7927                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("configured")
    7928                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7929                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    7930                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7931                            .dwattr $C$DW$515, DW_AT_decl_line(0x88)
    7932                            .dwattr $C$DW$515, DW_AT_decl_column(0x17)
    7933                    
    7934                    $C$DW$516       .dwtag  DW_TAG_member
    7935                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  146

    7936                            .dwattr $C$DW$516, DW_AT_name("baudRate")
    7937                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("baudRate")
    7938                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7939                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    7940                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7941                            .dwattr $C$DW$516, DW_AT_decl_line(0x89)
    7942                            .dwattr $C$DW$516, DW_AT_decl_column(0x17)
    7943                    
    7944                    $C$DW$517       .dwtag  DW_TAG_member
    7945                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$86)
    7946                            .dwattr $C$DW$517, DW_AT_name("flowControl")
    7947                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("flowControl")
    7948                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7949                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    7950                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7951                            .dwattr $C$DW$517, DW_AT_decl_line(0x8a)
    7952                            .dwattr $C$DW$517, DW_AT_decl_column(0x17)
    7953                    
    7954                    $C$DW$518       .dwtag  DW_TAG_member
    7955                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$80)
    7956                            .dwattr $C$DW$518, DW_AT_name("flowControlThreshold")
    7957                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("flowControlThreshold")
    7958                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7959                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    7960                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7961                            .dwattr $C$DW$518, DW_AT_decl_line(0x8b)
    7962                            .dwattr $C$DW$518, DW_AT_decl_column(0x17)
    7963                    
    7964                    $C$DW$519       .dwtag  DW_TAG_member
    7965                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
    7966                            .dwattr $C$DW$519, DW_AT_name("idleTimeout")
    7967                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("idleTimeout")
    7968                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7969                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    7970                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7971                            .dwattr $C$DW$519, DW_AT_decl_line(0x8c)
    7972                            .dwattr $C$DW$519, DW_AT_decl_column(0x17)
    7973                    
    7974                    $C$DW$520       .dwtag  DW_TAG_member
    7975                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$87)
    7976                            .dwattr $C$DW$520, DW_AT_name("rx")
    7977                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("rx")
    7978                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7979                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    7980                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    7981                            .dwattr $C$DW$520, DW_AT_decl_line(0x8d)
    7982                            .dwattr $C$DW$520, DW_AT_decl_column(0x17)
    7983                    
    7984                    $C$DW$521       .dwtag  DW_TAG_member
    7985                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$87)
    7986                            .dwattr $C$DW$521, DW_AT_name("tx")
    7987                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("tx")
    7988                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7989                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    7990                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  147

    7991                            .dwattr $C$DW$521, DW_AT_decl_line(0x8e)
    7992                            .dwattr $C$DW$521, DW_AT_decl_column(0x17)
    7993                    
    7994                    $C$DW$522       .dwtag  DW_TAG_member
    7995                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$86)
    7996                            .dwattr $C$DW$522, DW_AT_name("intEnable")
    7997                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("intEnable")
    7998                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7999                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    8000                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8001                            .dwattr $C$DW$522, DW_AT_decl_line(0x8f)
    8002                            .dwattr $C$DW$522, DW_AT_decl_column(0x17)
    8003                    
    8004                    $C$DW$523       .dwtag  DW_TAG_member
    8005                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$88)
    8006                            .dwattr $C$DW$523, DW_AT_name("rxChRvdTime")
    8007                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("rxChRvdTime")
    8008                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8009                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8010                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8011                            .dwattr $C$DW$523, DW_AT_decl_line(0x90)
    8012                            .dwattr $C$DW$523, DW_AT_decl_column(0x17)
    8013                    
    8014                    $C$DW$524       .dwtag  DW_TAG_member
    8015                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$91)
    8016                            .dwattr $C$DW$524, DW_AT_name("callBackFunc")
    8017                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("callBackFunc")
    8018                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8019                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8020                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8021                            .dwattr $C$DW$524, DW_AT_decl_line(0x91)
    8022                            .dwattr $C$DW$524, DW_AT_decl_column(0x17)
    8023                    
    8024                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    8025                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x87)
    8026                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    8027                            .dwendtag $C$DW$T$92
    8028                    
    8029                    $C$DW$T$225     .dwtag  DW_TAG_typedef
    8030                            .dwattr $C$DW$T$225, DW_AT_name("halUARTCfg_t")
    8031                            .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$92)
    8032                            .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    8033                            .dwattr $C$DW$T$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    8034                            .dwattr $C$DW$T$225, DW_AT_decl_line(0x92)
    8035                            .dwattr $C$DW$T$225, DW_AT_decl_column(0x02)
    8036                    
    8037                    
    8038                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    8039                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    8040                    $C$DW$525       .dwtag  DW_TAG_member
    8041                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$93)
    8042                            .dwattr $C$DW$525, DW_AT_name("hdr")
    8043                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("hdr")
    8044                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8045                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  148

    8046                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC135
    8047                            .dwattr $C$DW$525, DW_AT_decl_line(0xbc)
    8048                            .dwattr $C$DW$525, DW_AT_decl_column(0x14)
    8049                    
    8050                    $C$DW$526       .dwtag  DW_TAG_member
    8051                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$21)
    8052                            .dwattr $C$DW$526, DW_AT_name("state")
    8053                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("state")
    8054                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8055                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8056                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC135
    8057                            .dwattr $C$DW$526, DW_AT_decl_line(0xbd)
    8058                            .dwattr $C$DW$526, DW_AT_decl_column(0x09)
    8059                    
    8060                    $C$DW$527       .dwtag  DW_TAG_member
    8061                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$21)
    8062                            .dwattr $C$DW$527, DW_AT_name("keys")
    8063                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("keys")
    8064                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8065                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8066                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC135
    8067                            .dwattr $C$DW$527, DW_AT_decl_line(0xbe)
    8068                            .dwattr $C$DW$527, DW_AT_decl_column(0x09)
    8069                    
    8070                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC13
    8071                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xbb)
    8072                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    8073                            .dwendtag $C$DW$T$94
    8074                    
    8075                    $C$DW$T$226     .dwtag  DW_TAG_typedef
    8076                            .dwattr $C$DW$T$226, DW_AT_name("keyChange_t")
    8077                            .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$94)
    8078                            .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    8079                            .dwattr $C$DW$T$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC1
    8080                            .dwattr $C$DW$T$226, DW_AT_decl_line(0xbf)
    8081                            .dwattr $C$DW$T$226, DW_AT_decl_column(0x03)
    8082                    
    8083                    
    8084                    $C$DW$T$101     .dwtag  DW_TAG_union_type
    8085                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x02)
    8086                    $C$DW$528       .dwtag  DW_TAG_member
    8087                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$97)
    8088                            .dwattr $C$DW$528, DW_AT_name("entityId")
    8089                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("entityId")
    8090                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8091                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8092                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8093                            .dwattr $C$DW$528, DW_AT_decl_line(0x1fe)
    8094                            .dwattr $C$DW$528, DW_AT_decl_column(0x14)
    8095                    
    8096                    $C$DW$529       .dwtag  DW_TAG_member
    8097                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$100)
    8098                            .dwattr $C$DW$529, DW_AT_name("servId")
    8099                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("servId")
    8100                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  149

    8101                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8102                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8103                            .dwattr $C$DW$529, DW_AT_decl_line(0x200)
    8104                            .dwattr $C$DW$529, DW_AT_decl_column(0x17)
    8105                    
    8106                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    8107                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x1fc)
    8108                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    8109                            .dwendtag $C$DW$T$101
    8110                    
    8111                    
    8112                    $C$DW$T$102     .dwtag  DW_TAG_union_type
    8113                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    8114                    $C$DW$530       .dwtag  DW_TAG_member
    8115                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$100)
    8116                            .dwattr $C$DW$530, DW_AT_name("servId")
    8117                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("servId")
    8118                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8119                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8120                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8121                            .dwattr $C$DW$530, DW_AT_decl_line(0x211)
    8122                            .dwattr $C$DW$530, DW_AT_decl_column(0x17)
    8123                    
    8124                    $C$DW$531       .dwtag  DW_TAG_member
    8125                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$97)
    8126                            .dwattr $C$DW$531, DW_AT_name("entityId")
    8127                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("entityId")
    8128                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8129                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8130                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8131                            .dwattr $C$DW$531, DW_AT_decl_line(0x213)
    8132                            .dwattr $C$DW$531, DW_AT_decl_column(0x14)
    8133                    
    8134                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    8135                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x20f)
    8136                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    8137                            .dwendtag $C$DW$T$102
    8138                    
    8139                    
    8140                    $C$DW$T$103     .dwtag  DW_TAG_union_type
    8141                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    8142                    $C$DW$532       .dwtag  DW_TAG_member
    8143                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$86)
    8144                            .dwattr $C$DW$532, DW_AT_name("paramCTS")
    8145                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("paramCTS")
    8146                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8147                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8148                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8149                            .dwattr $C$DW$532, DW_AT_decl_line(0x96)
    8150                            .dwattr $C$DW$532, DW_AT_decl_column(0x08)
    8151                    
    8152                    $C$DW$533       .dwtag  DW_TAG_member
    8153                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$86)
    8154                            .dwattr $C$DW$533, DW_AT_name("paramRTS")
    8155                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("paramRTS")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  150

    8156                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8157                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8158                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8159                            .dwattr $C$DW$533, DW_AT_decl_line(0x97)
    8160                            .dwattr $C$DW$533, DW_AT_decl_column(0x08)
    8161                    
    8162                    $C$DW$534       .dwtag  DW_TAG_member
    8163                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$86)
    8164                            .dwattr $C$DW$534, DW_AT_name("paramDSR")
    8165                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("paramDSR")
    8166                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8167                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8168                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8169                            .dwattr $C$DW$534, DW_AT_decl_line(0x98)
    8170                            .dwattr $C$DW$534, DW_AT_decl_column(0x08)
    8171                    
    8172                    $C$DW$535       .dwtag  DW_TAG_member
    8173                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$86)
    8174                            .dwattr $C$DW$535, DW_AT_name("paramDTR")
    8175                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("paramDTR")
    8176                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8177                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8178                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8179                            .dwattr $C$DW$535, DW_AT_decl_line(0x99)
    8180                            .dwattr $C$DW$535, DW_AT_decl_column(0x08)
    8181                    
    8182                    $C$DW$536       .dwtag  DW_TAG_member
    8183                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$86)
    8184                            .dwattr $C$DW$536, DW_AT_name("paramCD")
    8185                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("paramCD")
    8186                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8187                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8188                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8189                            .dwattr $C$DW$536, DW_AT_decl_line(0x9a)
    8190                            .dwattr $C$DW$536, DW_AT_decl_column(0x08)
    8191                    
    8192                    $C$DW$537       .dwtag  DW_TAG_member
    8193                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$86)
    8194                            .dwattr $C$DW$537, DW_AT_name("paramRI")
    8195                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("paramRI")
    8196                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8197                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8198                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8199                            .dwattr $C$DW$537, DW_AT_decl_line(0x9b)
    8200                            .dwattr $C$DW$537, DW_AT_decl_column(0x08)
    8201                    
    8202                    $C$DW$538       .dwtag  DW_TAG_member
    8203                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$80)
    8204                            .dwattr $C$DW$538, DW_AT_name("baudRate")
    8205                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("baudRate")
    8206                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8207                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8208                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8209                            .dwattr $C$DW$538, DW_AT_decl_line(0x9c)
    8210                            .dwattr $C$DW$538, DW_AT_decl_column(0x0a)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  151

    8211                    
    8212                    $C$DW$539       .dwtag  DW_TAG_member
    8213                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$86)
    8214                            .dwattr $C$DW$539, DW_AT_name("flowControl")
    8215                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("flowControl")
    8216                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8217                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8218                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8219                            .dwattr $C$DW$539, DW_AT_decl_line(0x9d)
    8220                            .dwattr $C$DW$539, DW_AT_decl_column(0x08)
    8221                    
    8222                    $C$DW$540       .dwtag  DW_TAG_member
    8223                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$86)
    8224                            .dwattr $C$DW$540, DW_AT_name("flushControl")
    8225                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("flushControl")
    8226                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8227                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8228                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    8229                            .dwattr $C$DW$540, DW_AT_decl_line(0x9e)
    8230                            .dwattr $C$DW$540, DW_AT_decl_column(0x08)
    8231                    
    8232                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    8233                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x95)
    8234                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    8235                            .dwendtag $C$DW$T$103
    8236                    
    8237                    $C$DW$T$227     .dwtag  DW_TAG_typedef
    8238                            .dwattr $C$DW$T$227, DW_AT_name("halUARTIoctl_t")
    8239                            .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$103)
    8240                            .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    8241                            .dwattr $C$DW$T$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    8242                            .dwattr $C$DW$T$227, DW_AT_decl_line(0x9f)
    8243                            .dwattr $C$DW$T$227, DW_AT_decl_column(0x02)
    8244                    
    8245                    
    8246                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    8247                            .dwattr $C$DW$T$108, DW_AT_name(".ggroup1")
    8248                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x2c)
    8249                    $C$DW$541       .dwtag  DW_TAG_member
    8250                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$6)
    8251                            .dwattr $C$DW$541, DW_AT_name("activeTaskID")
    8252                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("activeTaskID")
    8253                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8254                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8255                    
    8256                    $C$DW$542       .dwtag  DW_TAG_member
    8257                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$6)
    8258                            .dwattr $C$DW$542, DW_AT_name("osal_notask_entity")
    8259                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("osal_notask_entity")
    8260                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8261                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8262                    
    8263                    $C$DW$543       .dwtag  DW_TAG_member
    8264                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$104)
    8265                            .dwattr $C$DW$543, DW_AT_name("osal_proxy_tasks")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  152

    8266                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("osal_proxy_tasks")
    8267                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8268                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8269                    
    8270                    $C$DW$544       .dwtag  DW_TAG_member
    8271                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$3)
    8272                            .dwattr $C$DW$544, DW_AT_name("osal_qHead")
    8273                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("osal_qHead")
    8274                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8275                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    8276                    
    8277                    $C$DW$545       .dwtag  DW_TAG_member
    8278                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$42)
    8279                            .dwattr $C$DW$545, DW_AT_name("osal_eventloop_hook")
    8280                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("osal_eventloop_hook")
    8281                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8282                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    8283                    
    8284                    $C$DW$546       .dwtag  DW_TAG_member
    8285                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$106)
    8286                            .dwattr $C$DW$546, DW_AT_name("osal_icallMsg_hook")
    8287                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("osal_icallMsg_hook")
    8288                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8289                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    8290                    
    8291                    $C$DW$547       .dwtag  DW_TAG_member
    8292                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$3)
    8293                            .dwattr $C$DW$547, DW_AT_name("osal_semaphore")
    8294                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("osal_semaphore")
    8295                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8296                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    8297                    
    8298                    $C$DW$548       .dwtag  DW_TAG_member
    8299                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$11)
    8300                            .dwattr $C$DW$548, DW_AT_name("osal_last_timestamp")
    8301                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("osal_last_timestamp")
    8302                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8303                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    8304                    
    8305                    $C$DW$549       .dwtag  DW_TAG_member
    8306                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$11)
    8307                            .dwattr $C$DW$549, DW_AT_name("osal_tickperiod")
    8308                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("osal_tickperiod")
    8309                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8310                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    8311                    
    8312                    $C$DW$550       .dwtag  DW_TAG_member
    8313                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$11)
    8314                            .dwattr $C$DW$550, DW_AT_name("osal_max_msecs")
    8315                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("osal_max_msecs")
    8316                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8317                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    8318                    
    8319                    $C$DW$551       .dwtag  DW_TAG_member
    8320                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  153

    8321                            .dwattr $C$DW$551, DW_AT_name("osal_timerid_msec_timer")
    8322                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("osal_timerid_msec_timer")
    8323                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8324                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    8325                    
    8326                    $C$DW$552       .dwtag  DW_TAG_member
    8327                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$11)
    8328                            .dwattr $C$DW$552, DW_AT_name("osal_msec_timer_seq")
    8329                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("osal_msec_timer_seq")
    8330                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8331                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    8332                    
    8333                    $C$DW$553       .dwtag  DW_TAG_member
    8334                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$107)
    8335                            .dwattr $C$DW$553, DW_AT_name("osal_dispatch_entities")
    8336                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("osal_dispatch_entities")
    8337                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8338                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    8339                    
    8340                            .dwendtag $C$DW$T$108
    8341                    
    8342                    
    8343                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    8344                            .dwattr $C$DW$T$109, DW_AT_name("S3_1")
    8345                            .dwattr $C$DW$T$109, DW_AT_declaration
    8346                            .dwendtag $C$DW$T$109
    8347                    
    8348                    
    8349                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    8350                            .dwattr $C$DW$T$110, DW_AT_name("S3_1")
    8351                            .dwattr $C$DW$T$110, DW_AT_declaration
    8352                            .dwendtag $C$DW$T$110
    8353                    
    8354                    
    8355                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    8356                            .dwattr $C$DW$T$111, DW_AT_name("S3_5")
    8357                            .dwattr $C$DW$T$111, DW_AT_declaration
    8358                            .dwendtag $C$DW$T$111
    8359                    
    8360                    
    8361                    $C$DW$T$112     .dwtag  DW_TAG_structure_type
    8362                            .dwattr $C$DW$T$112, DW_AT_name("S3_7")
    8363                            .dwattr $C$DW$T$112, DW_AT_declaration
    8364                            .dwendtag $C$DW$T$112
    8365                    
    8366                    
    8367                    $C$DW$T$113     .dwtag  DW_TAG_structure_type
    8368                            .dwattr $C$DW$T$113, DW_AT_name("S4_3")
    8369                            .dwattr $C$DW$T$113, DW_AT_declaration
    8370                            .dwendtag $C$DW$T$113
    8371                    
    8372                    
    8373                    $C$DW$T$114     .dwtag  DW_TAG_structure_type
    8374                            .dwattr $C$DW$T$114, DW_AT_name("S4_3")
    8375                            .dwattr $C$DW$T$114, DW_AT_declaration
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  154

    8376                            .dwendtag $C$DW$T$114
    8377                    
    8378                    
    8379                    $C$DW$T$115     .dwtag  DW_TAG_structure_type
    8380                            .dwattr $C$DW$T$115, DW_AT_name("S4_7")
    8381                            .dwattr $C$DW$T$115, DW_AT_declaration
    8382                            .dwendtag $C$DW$T$115
    8383                    
    8384                    
    8385                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    8386                            .dwattr $C$DW$T$116, DW_AT_name("S4_9")
    8387                            .dwattr $C$DW$T$116, DW_AT_declaration
    8388                            .dwendtag $C$DW$T$116
    8389                    
    8390                    
    8391                    $C$DW$T$117     .dwtag  DW_TAG_structure_type
    8392                            .dwattr $C$DW$T$117, DW_AT_name("S5_11")
    8393                            .dwattr $C$DW$T$117, DW_AT_declaration
    8394                            .dwendtag $C$DW$T$117
    8395                    
    8396                    
    8397                    $C$DW$T$118     .dwtag  DW_TAG_structure_type
    8398                            .dwattr $C$DW$T$118, DW_AT_name("S5_5")
    8399                            .dwattr $C$DW$T$118, DW_AT_declaration
    8400                            .dwendtag $C$DW$T$118
    8401                    
    8402                    
    8403                    $C$DW$T$119     .dwtag  DW_TAG_structure_type
    8404                            .dwattr $C$DW$T$119, DW_AT_name("S6_13")
    8405                            .dwattr $C$DW$T$119, DW_AT_declaration
    8406                            .dwendtag $C$DW$T$119
    8407                    
    8408                    
    8409                    $C$DW$T$120     .dwtag  DW_TAG_union_type
    8410                            .dwattr $C$DW$T$120, DW_AT_name("U3_0")
    8411                            .dwattr $C$DW$T$120, DW_AT_declaration
    8412                            .dwendtag $C$DW$T$120
    8413                    
    8414                    
    8415                    $C$DW$T$121     .dwtag  DW_TAG_union_type
    8416                            .dwattr $C$DW$T$121, DW_AT_name("U3_0")
    8417                            .dwattr $C$DW$T$121, DW_AT_declaration
    8418                            .dwendtag $C$DW$T$121
    8419                    
    8420                    
    8421                    $C$DW$T$122     .dwtag  DW_TAG_union_type
    8422                            .dwattr $C$DW$T$122, DW_AT_name("U4_2")
    8423                            .dwattr $C$DW$T$122, DW_AT_declaration
    8424                            .dwendtag $C$DW$T$122
    8425                    
    8426                    
    8427                    $C$DW$T$123     .dwtag  DW_TAG_union_type
    8428                            .dwattr $C$DW$T$123, DW_AT_name("U4_2")
    8429                            .dwattr $C$DW$T$123, DW_AT_declaration
    8430                            .dwendtag $C$DW$T$123
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:24 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{EED13AA0-95D2-4D70-A67D-EB613F06A95F} PAGE  155

    8431                    
    8432                    
    8433                    $C$DW$T$124     .dwtag  DW_TAG_union_type
    8434                            .dwattr $C$DW$T$124, DW_AT_name("U4_6")
    8435                            .dwattr $C$DW$T$124, DW_AT_declaration
    8436                            .dwendtag $C$DW$T$124
    8437                    
    8438                    
    8439                    $C$DW$T$125     .dwtag  DW_TAG_union_type
