TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:32 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4268                            .dwattr $C$DW$433, DW_AT_const_value(0x08)
    4269                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4270                            .dwattr $C$DW$433, DW_AT_decl_line(0xa8)
    4271                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4272                    
    4273                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4274                            .dwattr $C$DW$434, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4275                            .dwattr $C$DW$434, DW_AT_const_value(0x0e)
    4276                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4277                            .dwattr $C$DW$434, DW_AT_decl_line(0xa9)
    4278                            .dwattr $C$DW$434, DW_AT_decl_column(0x05)
    4279                    
    4280                    $C$DW$435       .dwtag  DW_TAG_enumerator
    4281                            .dwattr $C$DW$435, DW_AT_name("FAPI_CLEAR_STATUS")
    4282                            .dwattr $C$DW$435, DW_AT_const_value(0x10)
    4283                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4284                            .dwattr $C$DW$435, DW_AT_decl_line(0xaa)
    4285                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
    4286                    
    4287                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4288                            .dwattr $C$DW$436, DW_AT_name("FAPI_PROGRAM_RESUME")
    4289                            .dwattr $C$DW$436, DW_AT_const_value(0x14)
    4290                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   79

    4291                            .dwattr $C$DW$436, DW_AT_decl_line(0xab)
    4292                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4293                    
    4294                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4295                            .dwattr $C$DW$437, DW_AT_name("FAPI_ERASE_RESUME")
    4296                            .dwattr $C$DW$437, DW_AT_const_value(0x16)
    4297                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4298                            .dwattr $C$DW$437, DW_AT_decl_line(0xac)
    4299                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4300                    
    4301                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4302                            .dwattr $C$DW$438, DW_AT_name("FAPI_CLEAR_MORE")
    4303                            .dwattr $C$DW$438, DW_AT_const_value(0x18)
    4304                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4305                            .dwattr $C$DW$438, DW_AT_decl_line(0xad)
    4306                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4307                    
    4308                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4309                            .dwattr $C$DW$439, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4310                            .dwattr $C$DW$439, DW_AT_const_value(0x20)
    4311                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4312                            .dwattr $C$DW$439, DW_AT_decl_line(0xae)
    4313                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4314                    
    4315                    $C$DW$440       .dwtag  DW_TAG_enumerator
    4316                            .dwattr $C$DW$440, DW_AT_name("FAPI_ERASE_OTP")
    4317                            .dwattr $C$DW$440, DW_AT_const_value(0x30)
    4318                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices/c
    4319                            .dwattr $C$DW$440, DW_AT_decl_line(0xaf)
    4320                            .dwattr $C$DW$440, DW_AT_decl_column(0x05)
    4321                    
    4322                            .dwattr $C$DW$T$1084, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/device
    4323                            .dwattr $C$DW$T$1084, DW_AT_decl_line(0xa5)
    4324                            .dwattr $C$DW$T$1084, DW_AT_decl_column(0x01)
    4325                            .dwendtag $C$DW$T$1084
    4326                    
    4327                    $C$DW$T$1085    .dwtag  DW_TAG_typedef
    4328                            .dwattr $C$DW$T$1085, DW_AT_name("tFlashStateCommandsType")
    4329                            .dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$1084)
    4330                            .dwattr $C$DW$T$1085, DW_AT_language(DW_LANG_C)
    4331                            .dwattr $C$DW$T$1085, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/device
    4332                            .dwattr $C$DW$T$1085, DW_AT_decl_line(0xb0)
    4333                            .dwattr $C$DW$T$1085, DW_AT_decl_column(0x03)
    4334                    
    4335                    
    4336                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4337                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4338                    $C$DW$441       .dwtag  DW_TAG_member
    4339                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    4340                            .dwattr $C$DW$441, DW_AT_name("rfMode")
    4341                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("rfMode")
    4342                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4343                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4344                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4345                            .dwattr $C$DW$441, DW_AT_decl_line(0x41e)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   80

    4346                            .dwattr $C$DW$441, DW_AT_decl_column(0x0d)
    4347                    
    4348                    $C$DW$442       .dwtag  DW_TAG_member
    4349                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    4350                            .dwattr $C$DW$442, DW_AT_name("cpePatchFxn")
    4351                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("cpePatchFxn")
    4352                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4353                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4354                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4355                            .dwattr $C$DW$442, DW_AT_decl_line(0x41f)
    4356                            .dwattr $C$DW$442, DW_AT_decl_column(0x0c)
    4357                    
    4358                    $C$DW$443       .dwtag  DW_TAG_member
    4359                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
    4360                            .dwattr $C$DW$443, DW_AT_name("mcePatchFxn")
    4361                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("mcePatchFxn")
    4362                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4363                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4364                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4365                            .dwattr $C$DW$443, DW_AT_decl_line(0x420)
    4366                            .dwattr $C$DW$443, DW_AT_decl_column(0x0c)
    4367                    
    4368                    $C$DW$444       .dwtag  DW_TAG_member
    4369                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    4370                            .dwattr $C$DW$444, DW_AT_name("rfePatchFxn")
    4371                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("rfePatchFxn")
    4372                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4373                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4374                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4375                            .dwattr $C$DW$444, DW_AT_decl_line(0x421)
    4376                            .dwattr $C$DW$444, DW_AT_decl_column(0x0c)
    4377                    
    4378                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4379                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x41d)
    4380                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4381                            .dwendtag $C$DW$T$25
    4382                    
    4383                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    4384                            .dwattr $C$DW$T$38, DW_AT_name("RF_Mode")
    4385                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$25)
    4386                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4387                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4388                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x422)
    4389                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    4390                    
    4391                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4392                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4393                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    4394                    
    4395                    
    4396                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4397                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4398                    $C$DW$445       .dwtag  DW_TAG_member
    4399                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$27)
    4400                            .dwattr $C$DW$445, DW_AT_name("rawValue")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   81

    4401                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("rawValue")
    4402                            .dwattr $C$DW$445, DW_AT_bit_offset(0x0a)
    4403                            .dwattr $C$DW$445, DW_AT_bit_size(0x16)
    4404                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4405                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4406                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4407                            .dwattr $C$DW$445, DW_AT_decl_line(0x3d3)
    4408                            .dwattr $C$DW$445, DW_AT_decl_column(0x0e)
    4409                    
    4410                    $C$DW$446       .dwtag  DW_TAG_member
    4411                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$27)
    4412                            .dwattr $C$DW$446, DW_AT_name("__dummy")
    4413                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("__dummy")
    4414                            .dwattr $C$DW$446, DW_AT_bit_offset(0x01)
    4415                            .dwattr $C$DW$446, DW_AT_bit_size(0x09)
    4416                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4417                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4418                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4419                            .dwattr $C$DW$446, DW_AT_decl_line(0x3d7)
    4420                            .dwattr $C$DW$446, DW_AT_decl_column(0x0e)
    4421                    
    4422                    $C$DW$447       .dwtag  DW_TAG_member
    4423                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$27)
    4424                            .dwattr $C$DW$447, DW_AT_name("paType")
    4425                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("paType")
    4426                            .dwattr $C$DW$447, DW_AT_bit_offset(0x00)
    4427                            .dwattr $C$DW$447, DW_AT_bit_size(0x01)
    4428                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4429                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4430                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4431                            .dwattr $C$DW$447, DW_AT_decl_line(0x3d8)
    4432                            .dwattr $C$DW$447, DW_AT_decl_column(0x0e)
    4433                    
    4434                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4435                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3d2)
    4436                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4437                            .dwendtag $C$DW$T$28
    4438                    
    4439                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4440                            .dwattr $C$DW$T$31, DW_AT_name("RF_TxPowerTable_Value")
    4441                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4442                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4443                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4444                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3dc)
    4445                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4446                    
    4447                    
    4448                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4449                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    4450                    $C$DW$448       .dwtag  DW_TAG_member
    4451                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$30)
    4452                            .dwattr $C$DW$448, DW_AT_name("power")
    4453                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("power")
    4454                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4455                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   82

    4456                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4457                            .dwattr $C$DW$448, DW_AT_decl_line(0x3f2)
    4458                            .dwattr $C$DW$448, DW_AT_decl_column(0x0c)
    4459                    
    4460                    $C$DW$449       .dwtag  DW_TAG_member
    4461                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
    4462                            .dwattr $C$DW$449, DW_AT_name("value")
    4463                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("value")
    4464                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4465                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4466                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/r
    4467                            .dwattr $C$DW$449, DW_AT_decl_line(0x3f5)
    4468                            .dwattr $C$DW$449, DW_AT_decl_column(0x1b)
    4469                    
    4470                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4471                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f1)
    4472                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4473                            .dwendtag $C$DW$T$32
    4474                    
    4475                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4476                            .dwattr $C$DW$T$33, DW_AT_name("RF_TxPowerTable_Entry")
    4477                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4478                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4479                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/drivers/
    4480                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3f6)
    4481                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1b)
    4482                    
    4483                    $C$DW$T$34      .dwtag  DW_TAG_const_type
    4484                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4485                    
    4486                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    4487                            .dwattr $C$DW$T$35, DW_AT_name("txPwrVal_t")
    4488                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4489                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4490                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_con
    4491                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x140)
    4492                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x25)
    4493                    
    4494                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4495                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4496                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4497                    
    4498                    
    4499                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4500                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    4501                    $C$DW$450       .dwtag  DW_TAG_member
    4502                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$36)
    4503                            .dwattr $C$DW$450, DW_AT_name("pTxPwrVals")
    4504                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("pTxPwrVals")
    4505                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4506                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4507                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4508                            .dwattr $C$DW$450, DW_AT_decl_line(0x144)
    4509                            .dwattr $C$DW$450, DW_AT_decl_column(0x0f)
    4510                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   83

    4511                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_con
    4512                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x143)
    4513                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    4514                            .dwendtag $C$DW$T$37
    4515                    
    4516                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    4517                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    4518                    
    4519                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    4520                            .dwattr $C$DW$T$42, DW_AT_name("txPwrTbl_t")
    4521                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4522                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4523                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_con
    4524                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x145)
    4525                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    4526                    
    4527                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4528                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4529                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4530                    
    4531                    
    4532                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4533                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x30)
    4534                    $C$DW$451       .dwtag  DW_TAG_member
    4535                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$27)
    4536                            .dwattr $C$DW$451, DW_AT_name("getHwRevision")
    4537                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("getHwRevision")
    4538                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4539                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4540                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4541                            .dwattr $C$DW$451, DW_AT_decl_line(0x151)
    4542                            .dwattr $C$DW$451, DW_AT_decl_column(0x1c)
    4543                    
    4544                    $C$DW$452       .dwtag  DW_TAG_member
    4545                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$39)
    4546                            .dwattr $C$DW$452, DW_AT_name("pRfPatchTable")
    4547                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pRfPatchTable")
    4548                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4549                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4550                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4551                            .dwattr $C$DW$452, DW_AT_decl_line(0x152)
    4552                            .dwattr $C$DW$452, DW_AT_decl_column(0x1d)
    4553                    
    4554                    $C$DW$453       .dwtag  DW_TAG_member
    4555                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$40)
    4556                            .dwattr $C$DW$453, DW_AT_name("pRfDrvTblPtr")
    4557                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4558                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4559                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4560                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4561                            .dwattr $C$DW$453, DW_AT_decl_line(0x153)
    4562                            .dwattr $C$DW$453, DW_AT_decl_column(0x1d)
    4563                    
    4564                    $C$DW$454       .dwtag  DW_TAG_member
    4565                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$40)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   84

    4566                            .dwattr $C$DW$454, DW_AT_name("pCryptoDrvTblPtr")
    4567                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4568                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4569                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4570                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4571                            .dwattr $C$DW$454, DW_AT_decl_line(0x154)
    4572                            .dwattr $C$DW$454, DW_AT_decl_column(0x1d)
    4573                    
    4574                    $C$DW$455       .dwtag  DW_TAG_member
    4575                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$43)
    4576                            .dwattr $C$DW$455, DW_AT_name("pTxPwrTbl")
    4577                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("pTxPwrTbl")
    4578                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4579                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4580                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4581                            .dwattr $C$DW$455, DW_AT_decl_line(0x155)
    4582                            .dwattr $C$DW$455, DW_AT_decl_column(0x1d)
    4583                    
    4584                    $C$DW$456       .dwtag  DW_TAG_member
    4585                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$44)
    4586                            .dwattr $C$DW$456, DW_AT_name("pOverrides")
    4587                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("pOverrides")
    4588                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4589                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4590                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4591                            .dwattr $C$DW$456, DW_AT_decl_line(0x156)
    4592                            .dwattr $C$DW$456, DW_AT_decl_column(0x1e)
    4593                    
    4594                    $C$DW$457       .dwtag  DW_TAG_member
    4595                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$45)
    4596                            .dwattr $C$DW$457, DW_AT_name("pLoDivider")
    4597                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("pLoDivider")
    4598                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4599                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4600                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4601                            .dwattr $C$DW$457, DW_AT_decl_line(0x157)
    4602                            .dwattr $C$DW$457, DW_AT_decl_column(0x1d)
    4603                    
    4604                    $C$DW$458       .dwtag  DW_TAG_member
    4605                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$22)
    4606                            .dwattr $C$DW$458, DW_AT_name("rfFeModeBias")
    4607                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("rfFeModeBias")
    4608                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4609                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4610                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4611                            .dwattr $C$DW$458, DW_AT_decl_line(0x158)
    4612                            .dwattr $C$DW$458, DW_AT_decl_column(0x1c)
    4613                    
    4614                    $C$DW$459       .dwtag  DW_TAG_member
    4615                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$22)
    4616                            .dwattr $C$DW$459, DW_AT_name("phyId")
    4617                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("phyId")
    4618                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4619                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4620                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   85

    4621                            .dwattr $C$DW$459, DW_AT_decl_line(0x159)
    4622                            .dwattr $C$DW$459, DW_AT_decl_column(0x1c)
    4623                    
    4624                    $C$DW$460       .dwtag  DW_TAG_member
    4625                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
    4626                            .dwattr $C$DW$460, DW_AT_name("last")
    4627                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("last")
    4628                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4629                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4630                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4631                            .dwattr $C$DW$460, DW_AT_decl_line(0x15a)
    4632                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4633                    
    4634                    $C$DW$461       .dwtag  DW_TAG_member
    4635                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$48)
    4636                            .dwattr $C$DW$461, DW_AT_name("pSetRE")
    4637                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pSetRE")
    4638                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4639                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4640                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4641                            .dwattr $C$DW$461, DW_AT_decl_line(0x15b)
    4642                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4643                    
    4644                    $C$DW$462       .dwtag  DW_TAG_member
    4645                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$49)
    4646                            .dwattr $C$DW$462, DW_AT_name("pAssertFP")
    4647                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("pAssertFP")
    4648                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4649                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4650                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4651                            .dwattr $C$DW$462, DW_AT_decl_line(0x15c)
    4652                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4653                    
    4654                    $C$DW$463       .dwtag  DW_TAG_member
    4655                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$52)
    4656                            .dwattr $C$DW$463, DW_AT_name("pAntSwitchFP")
    4657                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("pAntSwitchFP")
    4658                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4659                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4660                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4661                            .dwattr $C$DW$463, DW_AT_decl_line(0x15d)
    4662                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4663                    
    4664                    $C$DW$464       .dwtag  DW_TAG_member
    4665                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$53)
    4666                            .dwattr $C$DW$464, DW_AT_name("pAntPwrFP")
    4667                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("pAntPwrFP")
    4668                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4669                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4670                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_conf
    4671                            .dwattr $C$DW$464, DW_AT_decl_line(0x15e)
    4672                            .dwattr $C$DW$464, DW_AT_decl_column(0x1c)
    4673                    
    4674                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_con
    4675                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x150)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   86

    4676                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    4677                            .dwendtag $C$DW$T$54
    4678                    
    4679                    $C$DW$T$1087    .dwtag  DW_TAG_typedef
    4680                            .dwattr $C$DW$T$1087, DW_AT_name("macUserCfg_t")
    4681                            .dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$54)
    4682                            .dwattr $C$DW$T$1087, DW_AT_language(DW_LANG_C)
    4683                            .dwattr $C$DW$T$1087, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/mac_user_c
    4684                            .dwattr $C$DW$T$1087, DW_AT_decl_line(0x15f)
    4685                            .dwattr $C$DW$T$1087, DW_AT_decl_column(0x03)
    4686                    
    4687                    $C$DW$T$1088    .dwtag  DW_TAG_pointer_type
    4688                            .dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$1087)
    4689                            .dwattr $C$DW$T$1088, DW_AT_address_class(0x20)
    4690                    
    4691                    
    4692                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4693                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    4694                    $C$DW$465       .dwtag  DW_TAG_member
    4695                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$14)
    4696                            .dwattr $C$DW$465, DW_AT_name("__max_align1")
    4697                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("__max_align1")
    4698                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4699                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4700                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4701                            .dwattr $C$DW$465, DW_AT_decl_line(0x70)
    4702                            .dwattr $C$DW$465, DW_AT_decl_column(0x0c)
    4703                    
    4704                    $C$DW$466       .dwtag  DW_TAG_member
    4705                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$18)
    4706                            .dwattr $C$DW$466, DW_AT_name("__max_align2")
    4707                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("__max_align2")
    4708                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4709                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4710                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4711                            .dwattr $C$DW$466, DW_AT_decl_line(0x71)
    4712                            .dwattr $C$DW$466, DW_AT_decl_column(0x0e)
    4713                    
    4714                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    4715                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x6f)
    4716                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    4717                            .dwendtag $C$DW$T$55
    4718                    
    4719                    $C$DW$T$1089    .dwtag  DW_TAG_typedef
    4720                            .dwattr $C$DW$T$1089, DW_AT_name("__max_align_t")
    4721                            .dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$55)
    4722                            .dwattr $C$DW$T$1089, DW_AT_language(DW_LANG_C)
    4723                            .dwattr $C$DW$T$1089, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/includ
    4724                            .dwattr $C$DW$T$1089, DW_AT_decl_line(0x72)
    4725                            .dwattr $C$DW$T$1089, DW_AT_decl_column(0x03)
    4726                    
    4727                    
    4728                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4729                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4730                    $C$DW$467       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   87

    4731                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$10)
    4732                            .dwattr $C$DW$467, DW_AT_name("quot")
    4733                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("quot")
    4734                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4735                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4736                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4737                            .dwattr $C$DW$467, DW_AT_decl_line(0x49)
    4738                            .dwattr $C$DW$467, DW_AT_decl_column(0x16)
    4739                    
    4740                    $C$DW$468       .dwtag  DW_TAG_member
    4741                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$10)
    4742                            .dwattr $C$DW$468, DW_AT_name("rem")
    4743                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("rem")
    4744                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4745                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4746                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4747                            .dwattr $C$DW$468, DW_AT_decl_line(0x49)
    4748                            .dwattr $C$DW$468, DW_AT_decl_column(0x1c)
    4749                    
    4750                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    4751                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x49)
    4752                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    4753                            .dwendtag $C$DW$T$56
    4754                    
    4755                    $C$DW$T$1090    .dwtag  DW_TAG_typedef
    4756                            .dwattr $C$DW$T$1090, DW_AT_name("div_t")
    4757                            .dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$56)
    4758                            .dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
    4759                            .dwattr $C$DW$T$1090, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/includ
    4760                            .dwattr $C$DW$T$1090, DW_AT_decl_line(0x49)
    4761                            .dwattr $C$DW$T$1090, DW_AT_decl_column(0x23)
    4762                    
    4763                    
    4764                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4765                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    4766                    $C$DW$469       .dwtag  DW_TAG_member
    4767                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$10)
    4768                            .dwattr $C$DW$469, DW_AT_name("quot")
    4769                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("quot")
    4770                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4771                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4772                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4773                            .dwattr $C$DW$469, DW_AT_decl_line(0x4e)
    4774                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    4775                    
    4776                    $C$DW$470       .dwtag  DW_TAG_member
    4777                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$10)
    4778                            .dwattr $C$DW$470, DW_AT_name("rem")
    4779                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("rem")
    4780                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4781                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4782                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4783                            .dwattr $C$DW$470, DW_AT_decl_line(0x4e)
    4784                            .dwattr $C$DW$470, DW_AT_decl_column(0x1c)
    4785                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   88

    4786                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    4787                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4e)
    4788                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    4789                            .dwendtag $C$DW$T$57
    4790                    
    4791                    $C$DW$T$1091    .dwtag  DW_TAG_typedef
    4792                            .dwattr $C$DW$T$1091, DW_AT_name("ldiv_t")
    4793                            .dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$57)
    4794                            .dwattr $C$DW$T$1091, DW_AT_language(DW_LANG_C)
    4795                            .dwattr $C$DW$T$1091, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/includ
    4796                            .dwattr $C$DW$T$1091, DW_AT_decl_line(0x4e)
    4797                            .dwattr $C$DW$T$1091, DW_AT_decl_column(0x23)
    4798                    
    4799                    
    4800                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4801                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4802                    $C$DW$471       .dwtag  DW_TAG_member
    4803                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$14)
    4804                            .dwattr $C$DW$471, DW_AT_name("quot")
    4805                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("quot")
    4806                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4807                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4808                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4809                            .dwattr $C$DW$471, DW_AT_decl_line(0x56)
    4810                            .dwattr $C$DW$471, DW_AT_decl_column(0x1c)
    4811                    
    4812                    $C$DW$472       .dwtag  DW_TAG_member
    4813                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$14)
    4814                            .dwattr $C$DW$472, DW_AT_name("rem")
    4815                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("rem")
    4816                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4817                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4818                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    4819                            .dwattr $C$DW$472, DW_AT_decl_line(0x56)
    4820                            .dwattr $C$DW$472, DW_AT_decl_column(0x22)
    4821                    
    4822                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    4823                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x56)
    4824                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    4825                            .dwendtag $C$DW$T$58
    4826                    
    4827                    $C$DW$T$1092    .dwtag  DW_TAG_typedef
    4828                            .dwattr $C$DW$T$1092, DW_AT_name("lldiv_t")
    4829                            .dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$58)
    4830                            .dwattr $C$DW$T$1092, DW_AT_language(DW_LANG_C)
    4831                            .dwattr $C$DW$T$1092, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/includ
    4832                            .dwattr $C$DW$T$1092, DW_AT_decl_line(0x56)
    4833                            .dwattr $C$DW$T$1092, DW_AT_decl_column(0x29)
    4834                    
    4835                    
    4836                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4837                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    4838                    $C$DW$473       .dwtag  DW_TAG_member
    4839                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$61)
    4840                            .dwattr $C$DW$473, DW_AT_name("pointerStack")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   89

    4841                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("pointerStack")
    4842                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4843                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4844                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4845                            .dwattr $C$DW$473, DW_AT_decl_line(0x3f5)
    4846                            .dwattr $C$DW$473, DW_AT_decl_column(0x16)
    4847                    
    4848                    $C$DW$474       .dwtag  DW_TAG_member
    4849                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$62)
    4850                            .dwattr $C$DW$474, DW_AT_name("directAPI")
    4851                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("directAPI")
    4852                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4853                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4854                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4855                            .dwattr $C$DW$474, DW_AT_decl_line(0x3f6)
    4856                            .dwattr $C$DW$474, DW_AT_decl_column(0x15)
    4857                    
    4858                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    4859                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3f4)
    4860                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4861                            .dwendtag $C$DW$T$63
    4862                    
    4863                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    4864                            .dwattr $C$DW$T$65, DW_AT_name("icall_directAPIMsg_t")
    4865                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    4866                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4867                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    4868                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f7)
    4869                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4870                    
    4871                    
    4872                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4873                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x14)
    4874                    $C$DW$475       .dwtag  DW_TAG_member
    4875                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$64)
    4876                            .dwattr $C$DW$475, DW_AT_name("hdr")
    4877                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("hdr")
    4878                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4879                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4880                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4881                            .dwattr $C$DW$475, DW_AT_decl_line(0x3fb)
    4882                            .dwattr $C$DW$475, DW_AT_decl_column(0x10)
    4883                    
    4884                    $C$DW$476       .dwtag  DW_TAG_member
    4885                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$65)
    4886                            .dwattr $C$DW$476, DW_AT_name("msg")
    4887                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("msg")
    4888                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4889                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4890                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4891                            .dwattr $C$DW$476, DW_AT_decl_line(0x3fc)
    4892                            .dwattr $C$DW$476, DW_AT_decl_column(0x1a)
    4893                    
    4894                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    4895                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x3fa)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   90

    4896                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    4897                            .dwendtag $C$DW$T$66
    4898                    
    4899                    $C$DW$T$1093    .dwtag  DW_TAG_typedef
    4900                            .dwattr $C$DW$T$1093, DW_AT_name("icallLiteMsg_t")
    4901                            .dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$66)
    4902                            .dwattr $C$DW$T$1093, DW_AT_language(DW_LANG_C)
    4903                            .dwattr $C$DW$T$1093, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154s
    4904                            .dwattr $C$DW$T$1093, DW_AT_decl_line(0x3fd)
    4905                            .dwattr $C$DW$T$1093, DW_AT_decl_column(0x03)
    4906                    
    4907                    
    4908                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4909                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x0a)
    4910                    $C$DW$477       .dwtag  DW_TAG_member
    4911                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$494)
    4912                            .dwattr $C$DW$477, DW_AT_name("addr")
    4913                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("addr")
    4914                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4915                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4916                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sadd
    4917                            .dwattr $C$DW$477, DW_AT_decl_line(0x55)
    4918                            .dwattr $C$DW$477, DW_AT_decl_column(0x05)
    4919                    
    4920                    $C$DW$478       .dwtag  DW_TAG_member
    4921                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    4922                            .dwattr $C$DW$478, DW_AT_name("addrMode")
    4923                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("addrMode")
    4924                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4925                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4926                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sadd
    4927                            .dwattr $C$DW$478, DW_AT_decl_line(0x56)
    4928                            .dwattr $C$DW$478, DW_AT_decl_column(0x13)
    4929                    
    4930                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sad
    4931                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
    4932                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    4933                            .dwendtag $C$DW$T$67
    4934                    
    4935                    $C$DW$T$386     .dwtag  DW_TAG_typedef
    4936                            .dwattr $C$DW$T$386, DW_AT_name("sAddr_t")
    4937                            .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$67)
    4938                            .dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
    4939                            .dwattr $C$DW$T$386, DW_AT_decl_file("C:/ti/workspace1/sensor_cc1350lp/Application/Services/sa
    4940                            .dwattr $C$DW$T$386, DW_AT_decl_line(0x57)
    4941                            .dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
    4942                    
    4943                    $C$DW$T$442     .dwtag  DW_TAG_pointer_type
    4944                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$386)
    4945                            .dwattr $C$DW$T$442, DW_AT_address_class(0x20)
    4946                    
    4947                    
    4948                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4949                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4950                    $C$DW$479       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   91

    4951                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$497)
    4952                            .dwattr $C$DW$479, DW_AT_name("addr")
    4953                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("addr")
    4954                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4955                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4956                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4957                            .dwattr $C$DW$479, DW_AT_decl_line(0x139)
    4958                            .dwattr $C$DW$479, DW_AT_decl_column(0x05)
    4959                    
    4960                    $C$DW$480       .dwtag  DW_TAG_member
    4961                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$69)
    4962                            .dwattr $C$DW$480, DW_AT_name("addrMode")
    4963                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("addrMode")
    4964                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4965                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4966                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4967                            .dwattr $C$DW$480, DW_AT_decl_line(0x13a)
    4968                            .dwattr $C$DW$480, DW_AT_decl_column(0x08)
    4969                    
    4970                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    4971                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x134)
    4972                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    4973                            .dwendtag $C$DW$T$70
    4974                    
    4975                    $C$DW$T$1094    .dwtag  DW_TAG_typedef
    4976                            .dwattr $C$DW$T$1094, DW_AT_name("zAddrType_t")
    4977                            .dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$70)
    4978                            .dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
    4979                            .dwattr $C$DW$T$1094, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154s
    4980                            .dwattr $C$DW$T$1094, DW_AT_decl_line(0x13b)
    4981                            .dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)
    4982                    
    4983                    
    4984                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4985                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x0c)
    4986                    $C$DW$481       .dwtag  DW_TAG_member
    4987                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$68)
    4988                            .dwattr $C$DW$481, DW_AT_name("txCounter")
    4989                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("txCounter")
    4990                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4991                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4992                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    4993                            .dwattr $C$DW$481, DW_AT_decl_line(0x198)
    4994                            .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    4995                    
    4996                    $C$DW$482       .dwtag  DW_TAG_member
    4997                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$68)
    4998                            .dwattr $C$DW$482, DW_AT_name("txCost")
    4999                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("txCost")
    5000                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5001                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5002                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5003                            .dwattr $C$DW$482, DW_AT_decl_line(0x199)
    5004                            .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    5005                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   92

    5006                    $C$DW$483       .dwtag  DW_TAG_member
    5007                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$68)
    5008                            .dwattr $C$DW$483, DW_AT_name("rxLqi")
    5009                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("rxLqi")
    5010                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5011                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5012                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5013                            .dwattr $C$DW$483, DW_AT_decl_line(0x19b)
    5014                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5015                    
    5016                    $C$DW$484       .dwtag  DW_TAG_member
    5017                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$68)
    5018                            .dwattr $C$DW$484, DW_AT_name("inKeySeqNum")
    5019                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("inKeySeqNum")
    5020                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5021                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5022                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5023                            .dwattr $C$DW$484, DW_AT_decl_line(0x19d)
    5024                            .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    5025                    
    5026                    $C$DW$485       .dwtag  DW_TAG_member
    5027                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$71)
    5028                            .dwattr $C$DW$485, DW_AT_name("inFrmCntr")
    5029                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("inFrmCntr")
    5030                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5031                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5032                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5033                            .dwattr $C$DW$485, DW_AT_decl_line(0x19e)
    5034                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5035                    
    5036                    $C$DW$486       .dwtag  DW_TAG_member
    5037                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$72)
    5038                            .dwattr $C$DW$486, DW_AT_name("txFailure")
    5039                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("txFailure")
    5040                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5041                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5042                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5043                            .dwattr $C$DW$486, DW_AT_decl_line(0x19f)
    5044                            .dwattr $C$DW$486, DW_AT_decl_column(0x0a)
    5045                    
    5046                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    5047                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x197)
    5048                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    5049                            .dwendtag $C$DW$T$73
    5050                    
    5051                    $C$DW$T$1095    .dwtag  DW_TAG_typedef
    5052                            .dwattr $C$DW$T$1095, DW_AT_name("linkInfo_t")
    5053                            .dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$73)
    5054                            .dwattr $C$DW$T$1095, DW_AT_language(DW_LANG_C)
    5055                            .dwattr $C$DW$T$1095, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154s
    5056                            .dwattr $C$DW$T$1095, DW_AT_decl_line(0x1a0)
    5057                            .dwattr $C$DW$T$1095, DW_AT_decl_column(0x03)
    5058                    
    5059                    
    5060                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   93

    5061                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    5062                    $C$DW$487       .dwtag  DW_TAG_member
    5063                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$68)
    5064                            .dwattr $C$DW$487, DW_AT_name("event")
    5065                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("event")
    5066                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5067                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5068                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5069                            .dwattr $C$DW$487, DW_AT_decl_line(0x79)
    5070                            .dwattr $C$DW$487, DW_AT_decl_column(0x0a)
    5071                    
    5072                    $C$DW$488       .dwtag  DW_TAG_member
    5073                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$68)
    5074                            .dwattr $C$DW$488, DW_AT_name("status")
    5075                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("status")
    5076                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5077                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5078                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    5079                            .dwattr $C$DW$488, DW_AT_decl_line(0x7a)
    5080                            .dwattr $C$DW$488, DW_AT_decl_column(0x0a)
    5081                    
    5082                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    5083                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x78)
    5084                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    5085                            .dwendtag $C$DW$T$74
    5086                    
    5087                    $C$DW$T$1096    .dwtag  DW_TAG_typedef
    5088                            .dwattr $C$DW$T$1096, DW_AT_name("osal_event_hdr_t")
    5089                            .dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$74)
    5090                            .dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
    5091                            .dwattr $C$DW$T$1096, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154s
    5092                            .dwattr $C$DW$T$1096, DW_AT_decl_line(0x7b)
    5093                            .dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)
    5094                    
    5095                    
    5096                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5097                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x4c)
    5098                    $C$DW$489       .dwtag  DW_TAG_member
    5099                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$77)
    5100                            .dwattr $C$DW$489, DW_AT_name("Crc32")
    5101                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("Crc32")
    5102                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5103                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5104                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5105                            .dwattr $C$DW$489, DW_AT_decl_line(0x76)
    5106                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    5107                    
    5108                    $C$DW$490       .dwtag  DW_TAG_member
    5109                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$80)
    5110                            .dwattr $C$DW$490, DW_AT_name("FlashGetSize")
    5111                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("FlashGetSize")
    5112                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5113                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5114                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5115                            .dwattr $C$DW$490, DW_AT_decl_line(0x77)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   94

    5116                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
    5117                    
    5118                    $C$DW$491       .dwtag  DW_TAG_member
    5119                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$81)
    5120                            .dwattr $C$DW$491, DW_AT_name("GetChipId")
    5121                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("GetChipId")
    5122                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5123                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5124                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5125                            .dwattr $C$DW$491, DW_AT_decl_line(0x78)
    5126                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5127                    
    5128                    $C$DW$492       .dwtag  DW_TAG_member
    5129                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$84)
    5130                            .dwattr $C$DW$492, DW_AT_name("ReservedLocation1")
    5131                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("ReservedLocation1")
    5132                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5133                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5134                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5135                            .dwattr $C$DW$492, DW_AT_decl_line(0x79)
    5136                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5137                    
    5138                    $C$DW$493       .dwtag  DW_TAG_member
    5139                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$85)
    5140                            .dwattr $C$DW$493, DW_AT_name("ReservedLocation2")
    5141                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("ReservedLocation2")
    5142                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5143                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5144                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5145                            .dwattr $C$DW$493, DW_AT_decl_line(0x7a)
    5146                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5147                    
    5148                    $C$DW$494       .dwtag  DW_TAG_member
    5149                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$86)
    5150                            .dwattr $C$DW$494, DW_AT_name("ReservedLocation3")
    5151                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("ReservedLocation3")
    5152                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5153                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5154                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5155                            .dwattr $C$DW$494, DW_AT_decl_line(0x7b)
    5156                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5157                    
    5158                    $C$DW$495       .dwtag  DW_TAG_member
    5159                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$87)
    5160                            .dwattr $C$DW$495, DW_AT_name("ResetDevice")
    5161                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("ResetDevice")
    5162                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5163                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5164                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5165                            .dwattr $C$DW$495, DW_AT_decl_line(0x7c)
    5166                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5167                    
    5168                    $C$DW$496       .dwtag  DW_TAG_member
    5169                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$93)
    5170                            .dwattr $C$DW$496, DW_AT_name("Fletcher32")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   95

    5171                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("Fletcher32")
    5172                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5173                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5174                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5175                            .dwattr $C$DW$496, DW_AT_decl_line(0x7d)
    5176                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5177                    
    5178                    $C$DW$497       .dwtag  DW_TAG_member
    5179                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$96)
    5180                            .dwattr $C$DW$497, DW_AT_name("MinValue")
    5181                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("MinValue")
    5182                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5183                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5184                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5185                            .dwattr $C$DW$497, DW_AT_decl_line(0x7e)
    5186                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5187                    
    5188                    $C$DW$498       .dwtag  DW_TAG_member
    5189                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$97)
    5190                            .dwattr $C$DW$498, DW_AT_name("MaxValue")
    5191                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("MaxValue")
    5192                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5193                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5194                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5195                            .dwattr $C$DW$498, DW_AT_decl_line(0x7f)
    5196                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5197                    
    5198                    $C$DW$499       .dwtag  DW_TAG_member
    5199                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$98)
    5200                            .dwattr $C$DW$499, DW_AT_name("MeanValue")
    5201                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("MeanValue")
    5202                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5203                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5204                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5205                            .dwattr $C$DW$499, DW_AT_decl_line(0x80)
    5206                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5207                    
    5208                    $C$DW$500       .dwtag  DW_TAG_member
    5209                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$99)
    5210                            .dwattr $C$DW$500, DW_AT_name("StandDeviationValue")
    5211                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("StandDeviationValue")
    5212                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5213                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5214                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5215                            .dwattr $C$DW$500, DW_AT_decl_line(0x81)
    5216                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5217                    
    5218                    $C$DW$501       .dwtag  DW_TAG_member
    5219                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$100)
    5220                            .dwattr $C$DW$501, DW_AT_name("ReservedLocation4")
    5221                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("ReservedLocation4")
    5222                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5223                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5224                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5225                            .dwattr $C$DW$501, DW_AT_decl_line(0x82)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   96

    5226                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
    5227                    
    5228                    $C$DW$502       .dwtag  DW_TAG_member
    5229                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$101)
    5230                            .dwattr $C$DW$502, DW_AT_name("ReservedLocation5")
    5231                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("ReservedLocation5")
    5232                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5233                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5234                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5235                            .dwattr $C$DW$502, DW_AT_decl_line(0x83)
    5236                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5237                    
    5238                    $C$DW$503       .dwtag  DW_TAG_member
    5239                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$102)
    5240                            .dwattr $C$DW$503, DW_AT_name("HFSourceSafeSwitch")
    5241                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5242                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5243                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5244                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5245                            .dwattr $C$DW$503, DW_AT_decl_line(0x84)
    5246                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5247                    
    5248                    $C$DW$504       .dwtag  DW_TAG_member
    5249                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$103)
    5250                            .dwattr $C$DW$504, DW_AT_name("SelectCompAInput")
    5251                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("SelectCompAInput")
    5252                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5253                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5254                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5255                            .dwattr $C$DW$504, DW_AT_decl_line(0x85)
    5256                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5257                    
    5258                    $C$DW$505       .dwtag  DW_TAG_member
    5259                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$104)
    5260                            .dwattr $C$DW$505, DW_AT_name("SelectCompARef")
    5261                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("SelectCompARef")
    5262                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5263                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5264                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5265                            .dwattr $C$DW$505, DW_AT_decl_line(0x86)
    5266                            .dwattr $C$DW$505, DW_AT_decl_column(0x25)
    5267                    
    5268                    $C$DW$506       .dwtag  DW_TAG_member
    5269                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$105)
    5270                            .dwattr $C$DW$506, DW_AT_name("SelectADCCompBInput")
    5271                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5272                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5273                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5274                            .dwattr $C$DW$506, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5275                            .dwattr $C$DW$506, DW_AT_decl_line(0x87)
    5276                            .dwattr $C$DW$506, DW_AT_decl_column(0x25)
    5277                    
    5278                    $C$DW$507       .dwtag  DW_TAG_member
    5279                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$106)
    5280                            .dwattr $C$DW$507, DW_AT_name("SelectCompBRef")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   97

    5281                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("SelectCompBRef")
    5282                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5283                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5284                            .dwattr $C$DW$507, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\c
    5285                            .dwattr $C$DW$507, DW_AT_decl_line(0x88)
    5286                            .dwattr $C$DW$507, DW_AT_decl_column(0x25)
    5287                    
    5288                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices
    5289                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x75)
    5290                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5291                            .dwendtag $C$DW$T$107
    5292                    
    5293                    $C$DW$T$1097    .dwtag  DW_TAG_typedef
    5294                            .dwattr $C$DW$T$1097, DW_AT_name("HARD_API_T")
    5295                            .dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$107)
    5296                            .dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
    5297                            .dwattr $C$DW$T$1097, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\device
    5298                            .dwattr $C$DW$T$1097, DW_AT_decl_line(0x89)
    5299                            .dwattr $C$DW$T$1097, DW_AT_decl_column(0x03)
    5300                    
    5301                    
    5302                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    5303                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x0a)
    5304                    $C$DW$508       .dwtag  DW_TAG_member
    5305                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$498)
    5306                            .dwattr $C$DW$508, DW_AT_name("addr")
    5307                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("addr")
    5308                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5309                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5310                            .dwattr $C$DW$508, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5311                            .dwattr $C$DW$508, DW_AT_decl_line(0x4db)
    5312                            .dwattr $C$DW$508, DW_AT_decl_column(0x07)
    5313                    
    5314                    $C$DW$509       .dwtag  DW_TAG_member
    5315                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$109)
    5316                            .dwattr $C$DW$509, DW_AT_name("addrMode")
    5317                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("addrMode")
    5318                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5319                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5320                            .dwattr $C$DW$509, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5321                            .dwattr $C$DW$509, DW_AT_decl_line(0x4de)
    5322                            .dwattr $C$DW$509, DW_AT_decl_column(0x17)
    5323                    
    5324                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5325                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x4d0)
    5326                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x01)
    5327                            .dwendtag $C$DW$T$110
    5328                    
    5329                    $C$DW$T$744     .dwtag  DW_TAG_typedef
    5330                            .dwattr $C$DW$T$744, DW_AT_name("ApiMac_sAddr_t")
    5331                            .dwattr $C$DW$T$744, DW_AT_type(*$C$DW$T$110)
    5332                            .dwattr $C$DW$T$744, DW_AT_language(DW_LANG_C)
    5333                            .dwattr $C$DW$T$744, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5334                            .dwattr $C$DW$T$744, DW_AT_decl_line(0x4df)
    5335                            .dwattr $C$DW$T$744, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   98

    5336                    
    5337                    
    5338                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5339                            .dwattr $C$DW$T$111, DW_AT_byte_size(0x08)
    5340                    $C$DW$510       .dwtag  DW_TAG_member
    5341                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    5342                            .dwattr $C$DW$510, DW_AT_name("frameCounter")
    5343                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("frameCounter")
    5344                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5345                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5346                            .dwattr $C$DW$510, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5347                            .dwattr $C$DW$510, DW_AT_decl_line(0x575)
    5348                            .dwattr $C$DW$510, DW_AT_decl_column(0x1a)
    5349                    
    5350                    $C$DW$511       .dwtag  DW_TAG_member
    5351                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$89)
    5352                            .dwattr $C$DW$511, DW_AT_name("keyIdx")
    5353                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("keyIdx")
    5354                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5355                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5356                            .dwattr $C$DW$511, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5357                            .dwattr $C$DW$511, DW_AT_decl_line(0x576)
    5358                            .dwattr $C$DW$511, DW_AT_decl_column(0x1a)
    5359                    
    5360                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5361                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x574)
    5362                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x01)
    5363                            .dwendtag $C$DW$T$111
    5364                    
    5365                    $C$DW$T$804     .dwtag  DW_TAG_typedef
    5366                            .dwattr $C$DW$T$804, DW_AT_name("ApiMac_frameCntr_t")
    5367                            .dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$111)
    5368                            .dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
    5369                            .dwattr $C$DW$T$804, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5370                            .dwattr $C$DW$T$804, DW_AT_decl_line(0x577)
    5371                            .dwattr $C$DW$T$804, DW_AT_decl_column(0x03)
    5372                    
    5373                    $C$DW$T$805     .dwtag  DW_TAG_pointer_type
    5374                            .dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$804)
    5375                            .dwattr $C$DW$T$805, DW_AT_address_class(0x20)
    5376                    
    5377                    
    5378                    $C$DW$T$115     .dwtag  DW_TAG_structure_type
    5379                            .dwattr $C$DW$T$115, DW_AT_byte_size(0x40)
    5380                    $C$DW$512       .dwtag  DW_TAG_member
    5381                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$113)
    5382                            .dwattr $C$DW$512, DW_AT_name("beaconType")
    5383                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("beaconType")
    5384                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5385                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5386                            .dwattr $C$DW$512, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5387                            .dwattr $C$DW$512, DW_AT_decl_line(0x886)
    5388                            .dwattr $C$DW$512, DW_AT_decl_column(0x19)
    5389                    
    5390                    $C$DW$513       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{2878A11B-992D-4B16-AD56-5BDBD91845FC} PAGE   99

    5391                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$22)
    5392                            .dwattr $C$DW$513, DW_AT_name("bsn")
    5393                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("bsn")
    5394                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5395                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5396                            .dwattr $C$DW$513, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5397                            .dwattr $C$DW$513, DW_AT_decl_line(0x888)
    5398                            .dwattr $C$DW$513, DW_AT_decl_column(0x0d)
    5399                    
    5400                    $C$DW$514       .dwtag  DW_TAG_member
    5401                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$114)
    5402                            .dwattr $C$DW$514, DW_AT_name("panDesc")
    5403                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("panDesc")
    5404                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5405                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5406                            .dwattr $C$DW$514, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5407                            .dwattr $C$DW$514, DW_AT_decl_line(0x88a)
    5408                            .dwattr $C$DW$514, DW_AT_decl_column(0x16)
    5409                    
    5410                    $C$DW$515       .dwtag  DW_TAG_member
    5411                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$501)
    5412                            .dwattr $C$DW$515, DW_AT_name("beaconData")
    5413                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("beaconData")
    5414                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5415                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5416                            .dwattr $C$DW$515, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5417                            .dwattr $C$DW$515, DW_AT_decl_line(0x895)
    5418                            .dwattr $C$DW$515, DW_AT_decl_column(0x07)
    5419                    
    5420                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5421                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x884)
    5422                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x01)
    5423                            .dwendtag $C$DW$T$115
    5424                    
    5425                    $C$DW$T$658     .dwtag  DW_TAG_typedef
    5426                            .dwattr $C$DW$T$658, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5427                            .dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$115)
    5428                            .dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
    5429                            .dwattr $C$DW$T$658, DW_AT_decl_file("C:\ti\workspace1\sensor_cc1350lp\Application\api_mac.h")
    5430                            .dwattr $C$DW$T$658, DW_AT_decl_line(0x896)
    5431                            .dwattr $C$DW$T$658, DW_AT_decl_column(0x03)
    5432                    
    5433                    $C$DW$T$659     .dwtag  DW_TAG_pointer_type
    5434                            .dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$658)
    5435                            .dwattr $C$DW$T$659, DW_AT_address_class(0x20)
    5436                    
    5437                    
    5438                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    5439                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    5440                    $C$DW$516       .dwtag  DW_TAG_member
    5441                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$45)
    5442                            .dwattr $C$DW$516, DW_AT_name("pCurrEntry")
    5443                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("pCurrEntry")
    5444                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5445                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
