TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:26 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_clock.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1212                            .dwendtag $C$DW$T$185
    1213                    
    1214                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1215                            .dwattr $C$DW$T$186, DW_AT_name("tFlashStateCommandsType")
    1216                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
    1217                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    1218                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
    1219                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xb0)
    1220                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1221                    
    1222                    
    1223                    $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    1224                            .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    1225                    $C$DW$64        .dwtag  DW_TAG_enumerator
    1226                            .dwattr $C$DW$64, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1227                            .dwattr $C$DW$64, DW_AT_const_value(0xe0)
    1228                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1229                            .dwattr $C$DW$64, DW_AT_decl_line(0x3de)
    1230                            .dwattr $C$DW$64, DW_AT_decl_column(0x04)
    1231                    
    1232                    $C$DW$65        .dwtag  DW_TAG_enumerator
    1233                            .dwattr $C$DW$65, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1234                            .dwattr $C$DW$65, DW_AT_const_value(0xe1)
    1235                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1236                            .dwattr $C$DW$65, DW_AT_decl_line(0x3e0)
    1237                            .dwattr $C$DW$65, DW_AT_decl_column(0x04)
    1238                    
    1239                    $C$DW$66        .dwtag  DW_TAG_enumerator
    1240                            .dwattr $C$DW$66, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1241                            .dwattr $C$DW$66, DW_AT_const_value(0xe2)
    1242                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1243                            .dwattr $C$DW$66, DW_AT_decl_line(0x3e2)
    1244                            .dwattr $C$DW$66, DW_AT_decl_column(0x04)
    1245                    
    1246                    $C$DW$67        .dwtag  DW_TAG_enumerator
    1247                            .dwattr $C$DW$67, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1248                            .dwattr $C$DW$67, DW_AT_const_value(0xe3)
    1249                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1250                            .dwattr $C$DW$67, DW_AT_decl_line(0x3e4)
    1251                            .dwattr $C$DW$67, DW_AT_decl_column(0x04)
    1252                    
    1253                    $C$DW$68        .dwtag  DW_TAG_enumerator
    1254                            .dwattr $C$DW$68, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1255                            .dwattr $C$DW$68, DW_AT_const_value(0xe4)
    1256                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1257                            .dwattr $C$DW$68, DW_AT_decl_line(0x3e6)
    1258                            .dwattr $C$DW$68, DW_AT_decl_column(0x04)
    1259                    
    1260                    $C$DW$69        .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   24

    1261                            .dwattr $C$DW$69, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1262                            .dwattr $C$DW$69, DW_AT_const_value(0xe5)
    1263                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1264                            .dwattr $C$DW$69, DW_AT_decl_line(0x3e8)
    1265                            .dwattr $C$DW$69, DW_AT_decl_column(0x04)
    1266                    
    1267                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1268                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3dc)
    1269                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x01)
    1270                            .dwendtag $C$DW$T$187
    1271                    
    1272                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1273                            .dwattr $C$DW$T$188, DW_AT_name("ICall_RemotiCmdEvent_t")
    1274                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    1275                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1276                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1277                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x3e9)
    1278                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x02)
    1279                    
    1280                    
    1281                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1282                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1283                    $C$DW$70        .dwtag  DW_TAG_member
    1284                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1285                            .dwattr $C$DW$70, DW_AT_name("seconds")
    1286                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("seconds")
    1287                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1289                            .dwattr $C$DW$70, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1290                            .dwattr $C$DW$70, DW_AT_decl_line(0x50)
    1291                            .dwattr $C$DW$70, DW_AT_decl_column(0x09)
    1292                    
    1293                    $C$DW$71        .dwtag  DW_TAG_member
    1294                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
    1295                            .dwattr $C$DW$71, DW_AT_name("minutes")
    1296                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("minutes")
    1297                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1298                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1299                            .dwattr $C$DW$71, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1300                            .dwattr $C$DW$71, DW_AT_decl_line(0x51)
    1301                            .dwattr $C$DW$71, DW_AT_decl_column(0x09)
    1302                    
    1303                    $C$DW$72        .dwtag  DW_TAG_member
    1304                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1305                            .dwattr $C$DW$72, DW_AT_name("hour")
    1306                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("hour")
    1307                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1308                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1309                            .dwattr $C$DW$72, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1310                            .dwattr $C$DW$72, DW_AT_decl_line(0x52)
    1311                            .dwattr $C$DW$72, DW_AT_decl_column(0x09)
    1312                    
    1313                    $C$DW$73        .dwtag  DW_TAG_member
    1314                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1315                            .dwattr $C$DW$73, DW_AT_name("day")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   25

    1316                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("day")
    1317                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1318                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1319                            .dwattr $C$DW$73, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1320                            .dwattr $C$DW$73, DW_AT_decl_line(0x53)
    1321                            .dwattr $C$DW$73, DW_AT_decl_column(0x09)
    1322                    
    1323                    $C$DW$74        .dwtag  DW_TAG_member
    1324                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1325                            .dwattr $C$DW$74, DW_AT_name("month")
    1326                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("month")
    1327                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1328                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1329                            .dwattr $C$DW$74, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1330                            .dwattr $C$DW$74, DW_AT_decl_line(0x54)
    1331                            .dwattr $C$DW$74, DW_AT_decl_column(0x09)
    1332                    
    1333                    $C$DW$75        .dwtag  DW_TAG_member
    1334                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
    1335                            .dwattr $C$DW$75, DW_AT_name("year")
    1336                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("year")
    1337                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1338                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1339                            .dwattr $C$DW$75, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1340                            .dwattr $C$DW$75, DW_AT_decl_line(0x55)
    1341                            .dwattr $C$DW$75, DW_AT_decl_column(0x0a)
    1342                    
    1343                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1344                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4f)
    1345                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    1346                            .dwendtag $C$DW$T$23
    1347                    
    1348                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1349                            .dwattr $C$DW$T$189, DW_AT_name("UTCTimeStruct")
    1350                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$23)
    1351                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1352                            .dwattr $C$DW$T$189, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    1353                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x56)
    1354                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    1355                    
    1356                    $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    1357                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    1358                            .dwattr $C$DW$T$190, DW_AT_address_class(0x20)
    1359                    
    1360                    $C$DW$T$191     .dwtag  DW_TAG_const_type
    1361                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    1362                    
    1363                    
    1364                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1365                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1366                    $C$DW$76        .dwtag  DW_TAG_member
    1367                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$14)
    1368                            .dwattr $C$DW$76, DW_AT_name("__max_align1")
    1369                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("__max_align1")
    1370                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   26

    1371                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1372                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/sy
    1373                            .dwattr $C$DW$76, DW_AT_decl_line(0x70)
    1374                            .dwattr $C$DW$76, DW_AT_decl_column(0x0c)
    1375                    
    1376                    $C$DW$77        .dwtag  DW_TAG_member
    1377                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$18)
    1378                            .dwattr $C$DW$77, DW_AT_name("__max_align2")
    1379                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("__max_align2")
    1380                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1381                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1382                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/sy
    1383                            .dwattr $C$DW$77, DW_AT_decl_line(0x71)
    1384                            .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
    1385                    
    1386                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1387                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x6f)
    1388                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1389                            .dwendtag $C$DW$T$24
    1390                    
    1391                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    1392                            .dwattr $C$DW$T$194, DW_AT_name("__max_align_t")
    1393                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$24)
    1394                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    1395                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1396                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x72)
    1397                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x03)
    1398                    
    1399                    
    1400                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1401                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x4c)
    1402                    $C$DW$78        .dwtag  DW_TAG_member
    1403                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$32)
    1404                            .dwattr $C$DW$78, DW_AT_name("Crc32")
    1405                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("Crc32")
    1406                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1408                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1409                            .dwattr $C$DW$78, DW_AT_decl_line(0x76)
    1410                            .dwattr $C$DW$78, DW_AT_decl_column(0x25)
    1411                    
    1412                    $C$DW$79        .dwtag  DW_TAG_member
    1413                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$35)
    1414                            .dwattr $C$DW$79, DW_AT_name("FlashGetSize")
    1415                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("FlashGetSize")
    1416                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1417                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1418                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1419                            .dwattr $C$DW$79, DW_AT_decl_line(0x77)
    1420                            .dwattr $C$DW$79, DW_AT_decl_column(0x25)
    1421                    
    1422                    $C$DW$80        .dwtag  DW_TAG_member
    1423                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$36)
    1424                            .dwattr $C$DW$80, DW_AT_name("GetChipId")
    1425                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("GetChipId")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   27

    1426                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1427                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1428                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1429                            .dwattr $C$DW$80, DW_AT_decl_line(0x78)
    1430                            .dwattr $C$DW$80, DW_AT_decl_column(0x25)
    1431                    
    1432                    $C$DW$81        .dwtag  DW_TAG_member
    1433                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$39)
    1434                            .dwattr $C$DW$81, DW_AT_name("ReservedLocation1")
    1435                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("ReservedLocation1")
    1436                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1437                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1438                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1439                            .dwattr $C$DW$81, DW_AT_decl_line(0x79)
    1440                            .dwattr $C$DW$81, DW_AT_decl_column(0x25)
    1441                    
    1442                    $C$DW$82        .dwtag  DW_TAG_member
    1443                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$40)
    1444                            .dwattr $C$DW$82, DW_AT_name("ReservedLocation2")
    1445                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("ReservedLocation2")
    1446                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1447                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1448                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1449                            .dwattr $C$DW$82, DW_AT_decl_line(0x7a)
    1450                            .dwattr $C$DW$82, DW_AT_decl_column(0x25)
    1451                    
    1452                    $C$DW$83        .dwtag  DW_TAG_member
    1453                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$41)
    1454                            .dwattr $C$DW$83, DW_AT_name("ReservedLocation3")
    1455                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("ReservedLocation3")
    1456                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1457                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1458                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1459                            .dwattr $C$DW$83, DW_AT_decl_line(0x7b)
    1460                            .dwattr $C$DW$83, DW_AT_decl_column(0x25)
    1461                    
    1462                    $C$DW$84        .dwtag  DW_TAG_member
    1463                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$44)
    1464                            .dwattr $C$DW$84, DW_AT_name("ResetDevice")
    1465                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("ResetDevice")
    1466                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1467                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1468                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1469                            .dwattr $C$DW$84, DW_AT_decl_line(0x7c)
    1470                            .dwattr $C$DW$84, DW_AT_decl_column(0x25)
    1471                    
    1472                    $C$DW$85        .dwtag  DW_TAG_member
    1473                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$50)
    1474                            .dwattr $C$DW$85, DW_AT_name("Fletcher32")
    1475                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("Fletcher32")
    1476                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1477                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1478                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1479                            .dwattr $C$DW$85, DW_AT_decl_line(0x7d)
    1480                            .dwattr $C$DW$85, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   28

    1481                    
    1482                    $C$DW$86        .dwtag  DW_TAG_member
    1483                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$54)
    1484                            .dwattr $C$DW$86, DW_AT_name("MinValue")
    1485                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("MinValue")
    1486                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1487                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1488                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1489                            .dwattr $C$DW$86, DW_AT_decl_line(0x7e)
    1490                            .dwattr $C$DW$86, DW_AT_decl_column(0x25)
    1491                    
    1492                    $C$DW$87        .dwtag  DW_TAG_member
    1493                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$55)
    1494                            .dwattr $C$DW$87, DW_AT_name("MaxValue")
    1495                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("MaxValue")
    1496                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1497                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1498                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1499                            .dwattr $C$DW$87, DW_AT_decl_line(0x7f)
    1500                            .dwattr $C$DW$87, DW_AT_decl_column(0x25)
    1501                    
    1502                    $C$DW$88        .dwtag  DW_TAG_member
    1503                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$56)
    1504                            .dwattr $C$DW$88, DW_AT_name("MeanValue")
    1505                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("MeanValue")
    1506                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1507                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1508                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1509                            .dwattr $C$DW$88, DW_AT_decl_line(0x80)
    1510                            .dwattr $C$DW$88, DW_AT_decl_column(0x25)
    1511                    
    1512                    $C$DW$89        .dwtag  DW_TAG_member
    1513                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$57)
    1514                            .dwattr $C$DW$89, DW_AT_name("StandDeviationValue")
    1515                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("StandDeviationValue")
    1516                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1517                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1519                            .dwattr $C$DW$89, DW_AT_decl_line(0x81)
    1520                            .dwattr $C$DW$89, DW_AT_decl_column(0x25)
    1521                    
    1522                    $C$DW$90        .dwtag  DW_TAG_member
    1523                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$60)
    1524                            .dwattr $C$DW$90, DW_AT_name("ReservedLocation4")
    1525                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ReservedLocation4")
    1526                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1527                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1528                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1529                            .dwattr $C$DW$90, DW_AT_decl_line(0x82)
    1530                            .dwattr $C$DW$90, DW_AT_decl_column(0x25)
    1531                    
    1532                    $C$DW$91        .dwtag  DW_TAG_member
    1533                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$61)
    1534                            .dwattr $C$DW$91, DW_AT_name("ReservedLocation5")
    1535                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ReservedLocation5")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   29

    1536                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1537                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1538                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1539                            .dwattr $C$DW$91, DW_AT_decl_line(0x83)
    1540                            .dwattr $C$DW$91, DW_AT_decl_column(0x25)
    1541                    
    1542                    $C$DW$92        .dwtag  DW_TAG_member
    1543                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$62)
    1544                            .dwattr $C$DW$92, DW_AT_name("HFSourceSafeSwitch")
    1545                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1546                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1547                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1548                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1549                            .dwattr $C$DW$92, DW_AT_decl_line(0x84)
    1550                            .dwattr $C$DW$92, DW_AT_decl_column(0x25)
    1551                    
    1552                    $C$DW$93        .dwtag  DW_TAG_member
    1553                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$65)
    1554                            .dwattr $C$DW$93, DW_AT_name("SelectCompAInput")
    1555                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("SelectCompAInput")
    1556                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1557                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1558                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1559                            .dwattr $C$DW$93, DW_AT_decl_line(0x85)
    1560                            .dwattr $C$DW$93, DW_AT_decl_column(0x25)
    1561                    
    1562                    $C$DW$94        .dwtag  DW_TAG_member
    1563                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$66)
    1564                            .dwattr $C$DW$94, DW_AT_name("SelectCompARef")
    1565                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("SelectCompARef")
    1566                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1567                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1568                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1569                            .dwattr $C$DW$94, DW_AT_decl_line(0x86)
    1570                            .dwattr $C$DW$94, DW_AT_decl_column(0x25)
    1571                    
    1572                    $C$DW$95        .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$67)
    1574                            .dwattr $C$DW$95, DW_AT_name("SelectADCCompBInput")
    1575                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1576                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1577                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1578                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1579                            .dwattr $C$DW$95, DW_AT_decl_line(0x87)
    1580                            .dwattr $C$DW$95, DW_AT_decl_column(0x25)
    1581                    
    1582                    $C$DW$96        .dwtag  DW_TAG_member
    1583                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$68)
    1584                            .dwattr $C$DW$96, DW_AT_name("SelectCompBRef")
    1585                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("SelectCompBRef")
    1586                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1587                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
    1589                            .dwattr $C$DW$96, DW_AT_decl_line(0x88)
    1590                            .dwattr $C$DW$96, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   30

    1591                    
    1592                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1593                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x75)
    1594                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    1595                            .dwendtag $C$DW$T$69
    1596                    
    1597                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    1598                            .dwattr $C$DW$T$195, DW_AT_name("HARD_API_T")
    1599                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$69)
    1600                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    1601                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices
    1602                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x89)
    1603                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    1604                    
    1605                    
    1606                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1607                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1608                    $C$DW$97        .dwtag  DW_TAG_member
    1609                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$10)
    1610                            .dwattr $C$DW$97, DW_AT_name("quot")
    1611                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("quot")
    1612                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1614                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
    1615                            .dwattr $C$DW$97, DW_AT_decl_line(0x49)
    1616                            .dwattr $C$DW$97, DW_AT_decl_column(0x16)
    1617                    
    1618                    $C$DW$98        .dwtag  DW_TAG_member
    1619                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$10)
    1620                            .dwattr $C$DW$98, DW_AT_name("rem")
    1621                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("rem")
    1622                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1623                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1624                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
    1625                            .dwattr $C$DW$98, DW_AT_decl_line(0x49)
    1626                            .dwattr $C$DW$98, DW_AT_decl_column(0x1c)
    1627                    
    1628                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1629                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x49)
    1630                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    1631                            .dwendtag $C$DW$T$70
    1632                    
    1633                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    1634                            .dwattr $C$DW$T$196, DW_AT_name("div_t")
    1635                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$70)
    1636                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    1637                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1638                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x49)
    1639                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x23)
    1640                    
    1641                    
    1642                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    1643                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
    1644                    $C$DW$99        .dwtag  DW_TAG_member
    1645                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   31

    1646                            .dwattr $C$DW$99, DW_AT_name("quot")
    1647                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("quot")
    1648                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1650                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
    1651                            .dwattr $C$DW$99, DW_AT_decl_line(0x4e)
    1652                            .dwattr $C$DW$99, DW_AT_decl_column(0x16)
    1653                    
    1654                    $C$DW$100       .dwtag  DW_TAG_member
    1655                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$10)
    1656                            .dwattr $C$DW$100, DW_AT_name("rem")
    1657                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("rem")
    1658                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1659                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1660                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1661                            .dwattr $C$DW$100, DW_AT_decl_line(0x4e)
    1662                            .dwattr $C$DW$100, DW_AT_decl_column(0x1c)
    1663                    
    1664                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1665                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x4e)
    1666                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    1667                            .dwendtag $C$DW$T$71
    1668                    
    1669                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    1670                            .dwattr $C$DW$T$197, DW_AT_name("ldiv_t")
    1671                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$71)
    1672                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    1673                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1674                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x4e)
    1675                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x23)
    1676                    
    1677                    
    1678                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    1679                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x10)
    1680                    $C$DW$101       .dwtag  DW_TAG_member
    1681                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$14)
    1682                            .dwattr $C$DW$101, DW_AT_name("quot")
    1683                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("quot")
    1684                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1686                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1687                            .dwattr $C$DW$101, DW_AT_decl_line(0x56)
    1688                            .dwattr $C$DW$101, DW_AT_decl_column(0x1c)
    1689                    
    1690                    $C$DW$102       .dwtag  DW_TAG_member
    1691                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$14)
    1692                            .dwattr $C$DW$102, DW_AT_name("rem")
    1693                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("rem")
    1694                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1695                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1696                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/s
    1697                            .dwattr $C$DW$102, DW_AT_decl_line(0x56)
    1698                            .dwattr $C$DW$102, DW_AT_decl_column(0x22)
    1699                    
    1700                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   32

    1701                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x56)
    1702                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
    1703                            .dwendtag $C$DW$T$72
    1704                    
    1705                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    1706                            .dwattr $C$DW$T$198, DW_AT_name("lldiv_t")
    1707                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$72)
    1708                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    1709                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1710                            .dwattr $C$DW$T$198, DW_AT_decl_line(0x56)
    1711                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x29)
    1712                    
    1713                    
    1714                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
    1715                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x08)
    1716                    $C$DW$103       .dwtag  DW_TAG_member
    1717                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$75)
    1718                            .dwattr $C$DW$103, DW_AT_name("pointerStack")
    1719                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("pointerStack")
    1720                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1722                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1723                            .dwattr $C$DW$103, DW_AT_decl_line(0x3f5)
    1724                            .dwattr $C$DW$103, DW_AT_decl_column(0x16)
    1725                    
    1726                    $C$DW$104       .dwtag  DW_TAG_member
    1727                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$76)
    1728                            .dwattr $C$DW$104, DW_AT_name("directAPI")
    1729                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("directAPI")
    1730                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1731                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1732                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1733                            .dwattr $C$DW$104, DW_AT_decl_line(0x3f6)
    1734                            .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1735                    
    1736                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1737                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x3f4)
    1738                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x01)
    1739                            .dwendtag $C$DW$T$77
    1740                    
    1741                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1742                            .dwattr $C$DW$T$79, DW_AT_name("icall_directAPIMsg_t")
    1743                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$77)
    1744                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1745                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1746                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3f7)
    1747                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    1748                    
    1749                    
    1750                    $C$DW$T$80      .dwtag  DW_TAG_structure_type
    1751                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x14)
    1752                    $C$DW$105       .dwtag  DW_TAG_member
    1753                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$78)
    1754                            .dwattr $C$DW$105, DW_AT_name("hdr")
    1755                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("hdr")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   33

    1756                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1758                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1759                            .dwattr $C$DW$105, DW_AT_decl_line(0x3fb)
    1760                            .dwattr $C$DW$105, DW_AT_decl_column(0x10)
    1761                    
    1762                    $C$DW$106       .dwtag  DW_TAG_member
    1763                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$79)
    1764                            .dwattr $C$DW$106, DW_AT_name("msg")
    1765                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("msg")
    1766                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1767                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1768                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1769                            .dwattr $C$DW$106, DW_AT_decl_line(0x3fc)
    1770                            .dwattr $C$DW$106, DW_AT_decl_column(0x1a)
    1771                    
    1772                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1773                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x3fa)
    1774                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x01)
    1775                            .dwendtag $C$DW$T$80
    1776                    
    1777                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    1778                            .dwattr $C$DW$T$199, DW_AT_name("icallLiteMsg_t")
    1779                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$80)
    1780                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    1781                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1782                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x3fd)
    1783                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x03)
    1784                    
    1785                    
    1786                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1787                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x0c)
    1788                    $C$DW$107       .dwtag  DW_TAG_member
    1789                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$81)
    1790                            .dwattr $C$DW$107, DW_AT_name("bufferHead")
    1791                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("bufferHead")
    1792                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1794                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1795                            .dwattr $C$DW$107, DW_AT_decl_line(0x80)
    1796                            .dwattr $C$DW$107, DW_AT_decl_column(0x13)
    1797                    
    1798                    $C$DW$108       .dwtag  DW_TAG_member
    1799                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$81)
    1800                            .dwattr $C$DW$108, DW_AT_name("bufferTail")
    1801                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("bufferTail")
    1802                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1803                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1804                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1805                            .dwattr $C$DW$108, DW_AT_decl_line(0x81)
    1806                            .dwattr $C$DW$108, DW_AT_decl_column(0x13)
    1807                    
    1808                    $C$DW$109       .dwtag  DW_TAG_member
    1809                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$22)
    1810                            .dwattr $C$DW$109, DW_AT_name("maxBufSize")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   34

    1811                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("maxBufSize")
    1812                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1813                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1814                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1815                            .dwattr $C$DW$109, DW_AT_decl_line(0x82)
    1816                            .dwattr $C$DW$109, DW_AT_decl_column(0x0a)
    1817                    
    1818                    $C$DW$110       .dwtag  DW_TAG_member
    1819                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$82)
    1820                            .dwattr $C$DW$110, DW_AT_name("pBuffer")
    1821                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("pBuffer")
    1822                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1823                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1824                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1825                            .dwattr $C$DW$110, DW_AT_decl_line(0x83)
    1826                            .dwattr $C$DW$110, DW_AT_decl_column(0x0a)
    1827                    
    1828                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1829                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x7e)
    1830                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1831                            .dwendtag $C$DW$T$83
    1832                    
    1833                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1834                            .dwattr $C$DW$T$85, DW_AT_name("halUARTBufControl_t")
    1835                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$83)
    1836                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1837                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1838                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x84)
    1839                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1840                    
    1841                    
    1842                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1843                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x2c)
    1844                    $C$DW$111       .dwtag  DW_TAG_member
    1845                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$84)
    1846                            .dwattr $C$DW$111, DW_AT_name("configured")
    1847                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("configured")
    1848                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1850                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1851                            .dwattr $C$DW$111, DW_AT_decl_line(0x88)
    1852                            .dwattr $C$DW$111, DW_AT_decl_column(0x17)
    1853                    
    1854                    $C$DW$112       .dwtag  DW_TAG_member
    1855                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1856                            .dwattr $C$DW$112, DW_AT_name("baudRate")
    1857                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("baudRate")
    1858                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1859                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1860                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1861                            .dwattr $C$DW$112, DW_AT_decl_line(0x89)
    1862                            .dwattr $C$DW$112, DW_AT_decl_column(0x17)
    1863                    
    1864                    $C$DW$113       .dwtag  DW_TAG_member
    1865                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$84)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   35

    1866                            .dwattr $C$DW$113, DW_AT_name("flowControl")
    1867                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("flowControl")
    1868                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1869                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1870                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1871                            .dwattr $C$DW$113, DW_AT_decl_line(0x8a)
    1872                            .dwattr $C$DW$113, DW_AT_decl_column(0x17)
    1873                    
    1874                    $C$DW$114       .dwtag  DW_TAG_member
    1875                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1876                            .dwattr $C$DW$114, DW_AT_name("flowControlThreshold")
    1877                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("flowControlThreshold")
    1878                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1879                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1880                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1881                            .dwattr $C$DW$114, DW_AT_decl_line(0x8b)
    1882                            .dwattr $C$DW$114, DW_AT_decl_column(0x17)
    1883                    
    1884                    $C$DW$115       .dwtag  DW_TAG_member
    1885                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1886                            .dwattr $C$DW$115, DW_AT_name("idleTimeout")
    1887                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("idleTimeout")
    1888                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1889                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1890                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1891                            .dwattr $C$DW$115, DW_AT_decl_line(0x8c)
    1892                            .dwattr $C$DW$115, DW_AT_decl_column(0x17)
    1893                    
    1894                    $C$DW$116       .dwtag  DW_TAG_member
    1895                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$85)
    1896                            .dwattr $C$DW$116, DW_AT_name("rx")
    1897                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("rx")
    1898                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1899                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1900                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1901                            .dwattr $C$DW$116, DW_AT_decl_line(0x8d)
    1902                            .dwattr $C$DW$116, DW_AT_decl_column(0x17)
    1903                    
    1904                    $C$DW$117       .dwtag  DW_TAG_member
    1905                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$85)
    1906                            .dwattr $C$DW$117, DW_AT_name("tx")
    1907                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("tx")
    1908                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1909                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1910                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1911                            .dwattr $C$DW$117, DW_AT_decl_line(0x8e)
    1912                            .dwattr $C$DW$117, DW_AT_decl_column(0x17)
    1913                    
    1914                    $C$DW$118       .dwtag  DW_TAG_member
    1915                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$84)
    1916                            .dwattr $C$DW$118, DW_AT_name("intEnable")
    1917                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("intEnable")
    1918                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1919                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1920                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   36

    1921                            .dwattr $C$DW$118, DW_AT_decl_line(0x8f)
    1922                            .dwattr $C$DW$118, DW_AT_decl_column(0x17)
    1923                    
    1924                    $C$DW$119       .dwtag  DW_TAG_member
    1925                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$86)
    1926                            .dwattr $C$DW$119, DW_AT_name("rxChRvdTime")
    1927                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("rxChRvdTime")
    1928                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1929                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1930                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1931                            .dwattr $C$DW$119, DW_AT_decl_line(0x90)
    1932                            .dwattr $C$DW$119, DW_AT_decl_column(0x17)
    1933                    
    1934                    $C$DW$120       .dwtag  DW_TAG_member
    1935                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$89)
    1936                            .dwattr $C$DW$120, DW_AT_name("callBackFunc")
    1937                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("callBackFunc")
    1938                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1939                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1940                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1941                            .dwattr $C$DW$120, DW_AT_decl_line(0x91)
    1942                            .dwattr $C$DW$120, DW_AT_decl_column(0x17)
    1943                    
    1944                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1945                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x87)
    1946                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1947                            .dwendtag $C$DW$T$90
    1948                    
    1949                    $C$DW$T$200     .dwtag  DW_TAG_typedef
    1950                            .dwattr $C$DW$T$200, DW_AT_name("halUARTCfg_t")
    1951                            .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$90)
    1952                            .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    1953                            .dwattr $C$DW$T$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1954                            .dwattr $C$DW$T$200, DW_AT_decl_line(0x92)
    1955                            .dwattr $C$DW$T$200, DW_AT_decl_column(0x02)
    1956                    
    1957                    
    1958                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1959                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1960                    $C$DW$121       .dwtag  DW_TAG_member
    1961                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1962                            .dwattr $C$DW$121, DW_AT_name("event")
    1963                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("event")
    1964                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1966                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1967                            .dwattr $C$DW$121, DW_AT_decl_line(0x79)
    1968                            .dwattr $C$DW$121, DW_AT_decl_column(0x0a)
    1969                    
    1970                    $C$DW$122       .dwtag  DW_TAG_member
    1971                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1972                            .dwattr $C$DW$122, DW_AT_name("status")
    1973                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("status")
    1974                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1975                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   37

    1976                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1977                            .dwattr $C$DW$122, DW_AT_decl_line(0x7a)
    1978                            .dwattr $C$DW$122, DW_AT_decl_column(0x0a)
    1979                    
    1980                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1981                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x78)
    1982                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    1983                            .dwendtag $C$DW$T$91
    1984                    
    1985                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    1986                            .dwattr $C$DW$T$92, DW_AT_name("osal_event_hdr_t")
    1987                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1988                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1989                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1990                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x7b)
    1991                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1992                    
    1993                    
    1994                    $C$DW$T$93      .dwtag  DW_TAG_structure_type
    1995                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x04)
    1996                    $C$DW$123       .dwtag  DW_TAG_member
    1997                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$92)
    1998                            .dwattr $C$DW$123, DW_AT_name("hdr")
    1999                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("hdr")
    2000                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2002                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC135
    2003                            .dwattr $C$DW$123, DW_AT_decl_line(0xbc)
    2004                            .dwattr $C$DW$123, DW_AT_decl_column(0x14)
    2005                    
    2006                    $C$DW$124       .dwtag  DW_TAG_member
    2007                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    2008                            .dwattr $C$DW$124, DW_AT_name("state")
    2009                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("state")
    2010                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2011                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2012                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC135
    2013                            .dwattr $C$DW$124, DW_AT_decl_line(0xbd)
    2014                            .dwattr $C$DW$124, DW_AT_decl_column(0x09)
    2015                    
    2016                    $C$DW$125       .dwtag  DW_TAG_member
    2017                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    2018                            .dwattr $C$DW$125, DW_AT_name("keys")
    2019                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("keys")
    2020                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2021                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2022                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC135
    2023                            .dwattr $C$DW$125, DW_AT_decl_line(0xbe)
    2024                            .dwattr $C$DW$125, DW_AT_decl_column(0x09)
    2025                    
    2026                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC13
    2027                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xbb)
    2028                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2029                            .dwendtag $C$DW$T$93
    2030                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   38

    2031                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    2032                            .dwattr $C$DW$T$201, DW_AT_name("keyChange_t")
    2033                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$93)
    2034                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    2035                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC1
    2036                            .dwattr $C$DW$T$201, DW_AT_decl_line(0xbf)
    2037                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    2038                    
    2039                    
    2040                    $C$DW$T$100     .dwtag  DW_TAG_union_type
    2041                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x02)
    2042                    $C$DW$126       .dwtag  DW_TAG_member
    2043                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$96)
    2044                            .dwattr $C$DW$126, DW_AT_name("entityId")
    2045                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("entityId")
    2046                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2048                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2049                            .dwattr $C$DW$126, DW_AT_decl_line(0x1fe)
    2050                            .dwattr $C$DW$126, DW_AT_decl_column(0x14)
    2051                    
    2052                    $C$DW$127       .dwtag  DW_TAG_member
    2053                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$99)
    2054                            .dwattr $C$DW$127, DW_AT_name("servId")
    2055                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("servId")
    2056                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2058                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2059                            .dwattr $C$DW$127, DW_AT_decl_line(0x200)
    2060                            .dwattr $C$DW$127, DW_AT_decl_column(0x17)
    2061                    
    2062                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2063                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x1fc)
    2064                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    2065                            .dwendtag $C$DW$T$100
    2066                    
    2067                    
    2068                    $C$DW$T$101     .dwtag  DW_TAG_union_type
    2069                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x02)
    2070                    $C$DW$128       .dwtag  DW_TAG_member
    2071                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$99)
    2072                            .dwattr $C$DW$128, DW_AT_name("servId")
    2073                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("servId")
    2074                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2076                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2077                            .dwattr $C$DW$128, DW_AT_decl_line(0x211)
    2078                            .dwattr $C$DW$128, DW_AT_decl_column(0x17)
    2079                    
    2080                    $C$DW$129       .dwtag  DW_TAG_member
    2081                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$96)
    2082                            .dwattr $C$DW$129, DW_AT_name("entityId")
    2083                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
    2084                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   39

    2086                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2087                            .dwattr $C$DW$129, DW_AT_decl_line(0x213)
    2088                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    2089                    
    2090                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2091                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x20f)
    2092                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    2093                            .dwendtag $C$DW$T$101
    2094                    
    2095                    
    2096                    $C$DW$T$102     .dwtag  DW_TAG_union_type
    2097                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
    2098                    $C$DW$130       .dwtag  DW_TAG_member
    2099                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$84)
    2100                            .dwattr $C$DW$130, DW_AT_name("paramCTS")
    2101                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("paramCTS")
    2102                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2104                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2105                            .dwattr $C$DW$130, DW_AT_decl_line(0x96)
    2106                            .dwattr $C$DW$130, DW_AT_decl_column(0x08)
    2107                    
    2108                    $C$DW$131       .dwtag  DW_TAG_member
    2109                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$84)
    2110                            .dwattr $C$DW$131, DW_AT_name("paramRTS")
    2111                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("paramRTS")
    2112                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2114                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2115                            .dwattr $C$DW$131, DW_AT_decl_line(0x97)
    2116                            .dwattr $C$DW$131, DW_AT_decl_column(0x08)
    2117                    
    2118                    $C$DW$132       .dwtag  DW_TAG_member
    2119                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$84)
    2120                            .dwattr $C$DW$132, DW_AT_name("paramDSR")
    2121                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("paramDSR")
    2122                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2124                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2125                            .dwattr $C$DW$132, DW_AT_decl_line(0x98)
    2126                            .dwattr $C$DW$132, DW_AT_decl_column(0x08)
    2127                    
    2128                    $C$DW$133       .dwtag  DW_TAG_member
    2129                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$84)
    2130                            .dwattr $C$DW$133, DW_AT_name("paramDTR")
    2131                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("paramDTR")
    2132                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2134                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2135                            .dwattr $C$DW$133, DW_AT_decl_line(0x99)
    2136                            .dwattr $C$DW$133, DW_AT_decl_column(0x08)
    2137                    
    2138                    $C$DW$134       .dwtag  DW_TAG_member
    2139                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$84)
    2140                            .dwattr $C$DW$134, DW_AT_name("paramCD")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   40

    2141                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("paramCD")
    2142                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2143                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2144                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2145                            .dwattr $C$DW$134, DW_AT_decl_line(0x9a)
    2146                            .dwattr $C$DW$134, DW_AT_decl_column(0x08)
    2147                    
    2148                    $C$DW$135       .dwtag  DW_TAG_member
    2149                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$84)
    2150                            .dwattr $C$DW$135, DW_AT_name("paramRI")
    2151                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("paramRI")
    2152                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2154                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2155                            .dwattr $C$DW$135, DW_AT_decl_line(0x9b)
    2156                            .dwattr $C$DW$135, DW_AT_decl_column(0x08)
    2157                    
    2158                    $C$DW$136       .dwtag  DW_TAG_member
    2159                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2160                            .dwattr $C$DW$136, DW_AT_name("baudRate")
    2161                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("baudRate")
    2162                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2163                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2164                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2165                            .dwattr $C$DW$136, DW_AT_decl_line(0x9c)
    2166                            .dwattr $C$DW$136, DW_AT_decl_column(0x0a)
    2167                    
    2168                    $C$DW$137       .dwtag  DW_TAG_member
    2169                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$84)
    2170                            .dwattr $C$DW$137, DW_AT_name("flowControl")
    2171                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("flowControl")
    2172                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2174                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2175                            .dwattr $C$DW$137, DW_AT_decl_line(0x9d)
    2176                            .dwattr $C$DW$137, DW_AT_decl_column(0x08)
    2177                    
    2178                    $C$DW$138       .dwtag  DW_TAG_member
    2179                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$84)
    2180                            .dwattr $C$DW$138, DW_AT_name("flushControl")
    2181                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("flushControl")
    2182                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2184                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2185                            .dwattr $C$DW$138, DW_AT_decl_line(0x9e)
    2186                            .dwattr $C$DW$138, DW_AT_decl_column(0x08)
    2187                    
    2188                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2189                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x95)
    2190                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    2191                            .dwendtag $C$DW$T$102
    2192                    
    2193                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    2194                            .dwattr $C$DW$T$202, DW_AT_name("halUARTIoctl_t")
    2195                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$102)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   41

    2196                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    2197                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2198                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x9f)
    2199                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x02)
    2200                    
    2201                    
    2202                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    2203                            .dwattr $C$DW$T$103, DW_AT_name(".ggroup1")
    2204                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x08)
    2205                    $C$DW$139       .dwtag  DW_TAG_member
    2206                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2207                            .dwattr $C$DW$139, DW_AT_name("timeMSec")
    2208                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("timeMSec")
    2209                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2211                    
    2212                    $C$DW$140       .dwtag  DW_TAG_member
    2213                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2214                            .dwattr $C$DW$140, DW_AT_name("OSAL_timeSeconds")
    2215                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("OSAL_timeSeconds")
    2216                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2217                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2218                    
    2219                            .dwendtag $C$DW$T$103
    2220                    
    2221                    
    2222                    $C$DW$T$104     .dwtag  DW_TAG_structure_type
    2223                            .dwattr $C$DW$T$104, DW_AT_name("_ICall_LiteCmdStatus_")
    2224                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    2225                    $C$DW$141       .dwtag  DW_TAG_member
    2226                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$95)
    2227                            .dwattr $C$DW$141, DW_AT_name("cmdId")
    2228                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("cmdId")
    2229                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2231                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    2232                            .dwattr $C$DW$141, DW_AT_decl_line(0x3f0)
    2233                            .dwattr $C$DW$141, DW_AT_decl_column(0x11)
    2234                    
    2235                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2236                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3ee)
    2237                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    2238                            .dwendtag $C$DW$T$104
    2239                    
    2240                    $C$DW$T$204     .dwtag  DW_TAG_typedef
    2241                            .dwattr $C$DW$T$204, DW_AT_name("ICall_LiteCmdStatus")
    2242                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$104)
    2243                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    2244                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2245                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x3f1)
    2246                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x03)
    2247                    
    2248                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2249                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2250                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   42

    2251                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2252                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2253                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2254                    
    2255                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    2256                            .dwattr $C$DW$T$205, DW_AT_name("ICall_Semaphore")
    2257                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$3)
    2258                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    2259                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2260                            .dwattr $C$DW$T$205, DW_AT_decl_line(0x1ac)
    2261                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x0f)
    2262                    
    2263                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    2264                            .dwattr $C$DW$T$120, DW_AT_name("ICall_SyncHandle")
    2265                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$3)
    2266                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    2267                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2268                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x1aa)
    2269                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x0f)
    2270                    
    2271                    $C$DW$T$167     .dwtag  DW_TAG_typedef
    2272                            .dwattr $C$DW$T$167, DW_AT_name("ICall_TimerID")
    2273                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$3)
    2274                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    2275                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2276                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1b7)
    2277                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0f)
    2278                    
    2279                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    2280                            .dwattr $C$DW$T$206, DW_AT_name("osal_msg_q_t")
    2281                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$3)
    2282                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    2283                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2284                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x7d)
    2285                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x10)
    2286                    
    2287                    
    2288                    $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    2289                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2290                            .dwendtag $C$DW$T$42
    2291                    
    2292                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2293                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2294                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    2295                    
    2296                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    2297                            .dwattr $C$DW$T$183, DW_AT_name("APPASRTINTF_callAssrtHndler")
    2298                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$43)
    2299                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    2300                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    2301                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x43)
    2302                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x10)
    2303                    
    2304                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2305                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   43

    2306                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$43)
    2307                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2308                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    2309                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x5f)
    2310                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x19)
    2311                    
    2312                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    2313                            .dwattr $C$DW$T$44, DW_AT_name("FPTR_RESETDEV_T")
    2314                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2315                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2316                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    2317                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4d)
    2318                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x19)
    2319                    
    2320                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    2321                            .dwattr $C$DW$T$207, DW_AT_name("FPTR_VOID_VOID_T")
    2322                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$43)
    2323                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    2324                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
    2325                            .dwattr $C$DW$T$207, DW_AT_decl_line(0x33)
    2326                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x11)
    2327                    
    2328                    $C$DW$T$208     .dwtag  DW_TAG_typedef
    2329                            .dwattr $C$DW$T$208, DW_AT_name("__TI_atexit_fn")
    2330                            .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$43)
    2331                            .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    2332                            .dwattr $C$DW$T$208, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    2333                            .dwattr $C$DW$T$208, DW_AT_decl_line(0xb2)
    2334                            .dwattr $C$DW$T$208, DW_AT_decl_column(0x14)
    2335                    
    2336                    
    2337                    $C$DW$T$58      .dwtag  DW_TAG_subroutine_type
    2338                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2339                    $C$DW$142       .dwtag  DW_TAG_formal_parameter
    2340                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$26)
    2341                    
    2342                            .dwendtag $C$DW$T$58
    2343                    
    2344                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    2345                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2346                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    2347                    
    2348                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    2349                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_RESERVED4_T")
    2350                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2351                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2352                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    2353                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x61)
    2354                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    2355                    
    2356                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2357                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_RESERVED5_T")
    2358                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$59)
    2359                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2360                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{8BDEC958-2A2B-4483-826E-4A716E3B02F5} PAGE   44

    2361                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x63)
    2362                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    2363                    
    2364                    
    2365                    $C$DW$T$63      .dwtag  DW_TAG_subroutine_type
    2366                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2367                    $C$DW$143       .dwtag  DW_TAG_formal_parameter
    2368                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
    2369                    
    2370                            .dwendtag $C$DW$T$63
    2371                    
    2372                    $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2373                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2374                            .dwattr $C$DW$T$64, DW_AT_address_class(0x20)
    2375                    
    2376                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    2377                            .dwattr $C$DW$T$67, DW_AT_name("FPTR_ADCCOMPBIN_T")
    2378                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$64)
    2379                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2380                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    2381                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x69)
    2382                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x19)
    2383                    
    2384                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    2385                            .dwattr $C$DW$T$65, DW_AT_name("FPTR_COMPAIN_T")
    2386                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2387                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2388                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    2389                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x65)
    2390                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x19)
    2391                    
    2392                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    2393                            .dwattr $C$DW$T$66, DW_AT_name("FPTR_COMPAREF_T")
    2394                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$64)
    2395                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2396                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    2397                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x67)
    2398                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x19)
    2399                    
    2400                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    2401                            .dwattr $C$DW$T$68, DW_AT_name("FPTR_COMPBREF_T")
    2402                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    2403                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
