TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.1.LTS *
       3                    ;* Date/Time created: Wed Apr 25 09:49:27 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_pwrmgr.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.1.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\workspace1\sensor_cc1350lp\sensor_cc1350lp")
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("ICall_dispatcher")

TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   12

     602                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
     603                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
     604                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
     605                            .dwattr $C$DW$T$186, DW_AT_decl_line(0xb0)
     606                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
     607                    
     608                    
     609                    $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
     610                            .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
     611                    $C$DW$39        .dwtag  DW_TAG_enumerator
     612                            .dwattr $C$DW$39, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
     613                            .dwattr $C$DW$39, DW_AT_const_value(0xe0)
     614                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
     615                            .dwattr $C$DW$39, DW_AT_decl_line(0x3de)
     616                            .dwattr $C$DW$39, DW_AT_decl_column(0x04)
     617                    
     618                    $C$DW$40        .dwtag  DW_TAG_enumerator
     619                            .dwattr $C$DW$40, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
     620                            .dwattr $C$DW$40, DW_AT_const_value(0xe1)
     621                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
     622                            .dwattr $C$DW$40, DW_AT_decl_line(0x3e0)
     623                            .dwattr $C$DW$40, DW_AT_decl_column(0x04)
     624                    
     625                    $C$DW$41        .dwtag  DW_TAG_enumerator
     626                            .dwattr $C$DW$41, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
     627                            .dwattr $C$DW$41, DW_AT_const_value(0xe2)
     628                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
     629                            .dwattr $C$DW$41, DW_AT_decl_line(0x3e2)
     630                            .dwattr $C$DW$41, DW_AT_decl_column(0x04)
     631                    
     632                    $C$DW$42        .dwtag  DW_TAG_enumerator
     633                            .dwattr $C$DW$42, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
     634                            .dwattr $C$DW$42, DW_AT_const_value(0xe3)
     635                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
     636                            .dwattr $C$DW$42, DW_AT_decl_line(0x3e4)
     637                            .dwattr $C$DW$42, DW_AT_decl_column(0x04)
     638                    
     639                    $C$DW$43        .dwtag  DW_TAG_enumerator
     640                            .dwattr $C$DW$43, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
     641                            .dwattr $C$DW$43, DW_AT_const_value(0xe4)
     642                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
     643                            .dwattr $C$DW$43, DW_AT_decl_line(0x3e6)
     644                            .dwattr $C$DW$43, DW_AT_decl_column(0x04)
     645                    
     646                    $C$DW$44        .dwtag  DW_TAG_enumerator
     647                            .dwattr $C$DW$44, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
     648                            .dwattr $C$DW$44, DW_AT_const_value(0xe5)
     649                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
     650                            .dwattr $C$DW$44, DW_AT_decl_line(0x3e8)
     651                            .dwattr $C$DW$44, DW_AT_decl_column(0x04)
     652                    
     653                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
     654                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3dc)
     655                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x01)
     656                            .dwendtag $C$DW$T$187
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   13

     657                    
     658                    $C$DW$T$188     .dwtag  DW_TAG_typedef
     659                            .dwattr $C$DW$T$188, DW_AT_name("ICall_RemotiCmdEvent_t")
     660                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
     661                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
     662                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
     663                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x3e9)
     664                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x02)
     665                    
     666                    
     667                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     668                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     669                    $C$DW$45        .dwtag  DW_TAG_member
     670                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     671                            .dwattr $C$DW$45, DW_AT_name("pwrmgr_task_state")
     672                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("pwrmgr_task_state")
     673                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     675                            .dwattr $C$DW$45, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     676                            .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     677                            .dwattr $C$DW$45, DW_AT_decl_column(0x0a)
     678                    
     679                            .dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     680                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x47)
     681                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
     682                            .dwendtag $C$DW$T$22
     683                    
     684                    $C$DW$T$190     .dwtag  DW_TAG_typedef
     685                            .dwattr $C$DW$T$190, DW_AT_name("pwrmgr_attribute_t")
     686                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$22)
     687                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
     688                            .dwattr $C$DW$T$190, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     689                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x4e)
     690                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x03)
     691                    
     692                    
     693                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
     694                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
     695                    $C$DW$46        .dwtag  DW_TAG_member
     696                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$14)
     697                            .dwattr $C$DW$46, DW_AT_name("__max_align1")
     698                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("__max_align1")
     699                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     701                            .dwattr $C$DW$46, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/sy
     702                            .dwattr $C$DW$46, DW_AT_decl_line(0x70)
     703                            .dwattr $C$DW$46, DW_AT_decl_column(0x0c)
     704                    
     705                    $C$DW$47        .dwtag  DW_TAG_member
     706                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$18)
     707                            .dwattr $C$DW$47, DW_AT_name("__max_align2")
     708                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("__max_align2")
     709                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     710                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     711                            .dwattr $C$DW$47, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/sy
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   14

     712                            .dwattr $C$DW$47, DW_AT_decl_line(0x71)
     713                            .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
     714                    
     715                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
     716                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x6f)
     717                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
     718                            .dwendtag $C$DW$T$23
     719                    
     720                    $C$DW$T$191     .dwtag  DW_TAG_typedef
     721                            .dwattr $C$DW$T$191, DW_AT_name("__max_align_t")
     722                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$23)
     723                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
     724                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
     725                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x72)
     726                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
     727                    
     728                    
     729                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
     730                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x4c)
     731                    $C$DW$48        .dwtag  DW_TAG_member
     732                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$31)
     733                            .dwattr $C$DW$48, DW_AT_name("Crc32")
     734                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("Crc32")
     735                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     737                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     738                            .dwattr $C$DW$48, DW_AT_decl_line(0x76)
     739                            .dwattr $C$DW$48, DW_AT_decl_column(0x25)
     740                    
     741                    $C$DW$49        .dwtag  DW_TAG_member
     742                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$34)
     743                            .dwattr $C$DW$49, DW_AT_name("FlashGetSize")
     744                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("FlashGetSize")
     745                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     746                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     747                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     748                            .dwattr $C$DW$49, DW_AT_decl_line(0x77)
     749                            .dwattr $C$DW$49, DW_AT_decl_column(0x25)
     750                    
     751                    $C$DW$50        .dwtag  DW_TAG_member
     752                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$35)
     753                            .dwattr $C$DW$50, DW_AT_name("GetChipId")
     754                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("GetChipId")
     755                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     756                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     757                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     758                            .dwattr $C$DW$50, DW_AT_decl_line(0x78)
     759                            .dwattr $C$DW$50, DW_AT_decl_column(0x25)
     760                    
     761                    $C$DW$51        .dwtag  DW_TAG_member
     762                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$38)
     763                            .dwattr $C$DW$51, DW_AT_name("ReservedLocation1")
     764                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ReservedLocation1")
     765                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     766                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   15

     767                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     768                            .dwattr $C$DW$51, DW_AT_decl_line(0x79)
     769                            .dwattr $C$DW$51, DW_AT_decl_column(0x25)
     770                    
     771                    $C$DW$52        .dwtag  DW_TAG_member
     772                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$39)
     773                            .dwattr $C$DW$52, DW_AT_name("ReservedLocation2")
     774                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ReservedLocation2")
     775                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     776                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     777                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     778                            .dwattr $C$DW$52, DW_AT_decl_line(0x7a)
     779                            .dwattr $C$DW$52, DW_AT_decl_column(0x25)
     780                    
     781                    $C$DW$53        .dwtag  DW_TAG_member
     782                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$40)
     783                            .dwattr $C$DW$53, DW_AT_name("ReservedLocation3")
     784                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("ReservedLocation3")
     785                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     786                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     787                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     788                            .dwattr $C$DW$53, DW_AT_decl_line(0x7b)
     789                            .dwattr $C$DW$53, DW_AT_decl_column(0x25)
     790                    
     791                    $C$DW$54        .dwtag  DW_TAG_member
     792                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$43)
     793                            .dwattr $C$DW$54, DW_AT_name("ResetDevice")
     794                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("ResetDevice")
     795                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     796                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     797                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     798                            .dwattr $C$DW$54, DW_AT_decl_line(0x7c)
     799                            .dwattr $C$DW$54, DW_AT_decl_column(0x25)
     800                    
     801                    $C$DW$55        .dwtag  DW_TAG_member
     802                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$49)
     803                            .dwattr $C$DW$55, DW_AT_name("Fletcher32")
     804                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("Fletcher32")
     805                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     806                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     807                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     808                            .dwattr $C$DW$55, DW_AT_decl_line(0x7d)
     809                            .dwattr $C$DW$55, DW_AT_decl_column(0x25)
     810                    
     811                    $C$DW$56        .dwtag  DW_TAG_member
     812                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$53)
     813                            .dwattr $C$DW$56, DW_AT_name("MinValue")
     814                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("MinValue")
     815                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     816                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     817                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     818                            .dwattr $C$DW$56, DW_AT_decl_line(0x7e)
     819                            .dwattr $C$DW$56, DW_AT_decl_column(0x25)
     820                    
     821                    $C$DW$57        .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   16

     822                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$54)
     823                            .dwattr $C$DW$57, DW_AT_name("MaxValue")
     824                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("MaxValue")
     825                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     826                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     827                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     828                            .dwattr $C$DW$57, DW_AT_decl_line(0x7f)
     829                            .dwattr $C$DW$57, DW_AT_decl_column(0x25)
     830                    
     831                    $C$DW$58        .dwtag  DW_TAG_member
     832                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$55)
     833                            .dwattr $C$DW$58, DW_AT_name("MeanValue")
     834                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("MeanValue")
     835                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     836                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     837                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     838                            .dwattr $C$DW$58, DW_AT_decl_line(0x80)
     839                            .dwattr $C$DW$58, DW_AT_decl_column(0x25)
     840                    
     841                    $C$DW$59        .dwtag  DW_TAG_member
     842                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$56)
     843                            .dwattr $C$DW$59, DW_AT_name("StandDeviationValue")
     844                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("StandDeviationValue")
     845                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     846                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     847                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     848                            .dwattr $C$DW$59, DW_AT_decl_line(0x81)
     849                            .dwattr $C$DW$59, DW_AT_decl_column(0x25)
     850                    
     851                    $C$DW$60        .dwtag  DW_TAG_member
     852                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$59)
     853                            .dwattr $C$DW$60, DW_AT_name("ReservedLocation4")
     854                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("ReservedLocation4")
     855                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     856                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     857                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     858                            .dwattr $C$DW$60, DW_AT_decl_line(0x82)
     859                            .dwattr $C$DW$60, DW_AT_decl_column(0x25)
     860                    
     861                    $C$DW$61        .dwtag  DW_TAG_member
     862                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$60)
     863                            .dwattr $C$DW$61, DW_AT_name("ReservedLocation5")
     864                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("ReservedLocation5")
     865                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     866                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     867                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     868                            .dwattr $C$DW$61, DW_AT_decl_line(0x83)
     869                            .dwattr $C$DW$61, DW_AT_decl_column(0x25)
     870                    
     871                    $C$DW$62        .dwtag  DW_TAG_member
     872                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$61)
     873                            .dwattr $C$DW$62, DW_AT_name("HFSourceSafeSwitch")
     874                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     875                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     876                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   17

     877                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     878                            .dwattr $C$DW$62, DW_AT_decl_line(0x84)
     879                            .dwattr $C$DW$62, DW_AT_decl_column(0x25)
     880                    
     881                    $C$DW$63        .dwtag  DW_TAG_member
     882                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$64)
     883                            .dwattr $C$DW$63, DW_AT_name("SelectCompAInput")
     884                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SelectCompAInput")
     885                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     886                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     887                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     888                            .dwattr $C$DW$63, DW_AT_decl_line(0x85)
     889                            .dwattr $C$DW$63, DW_AT_decl_column(0x25)
     890                    
     891                    $C$DW$64        .dwtag  DW_TAG_member
     892                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$65)
     893                            .dwattr $C$DW$64, DW_AT_name("SelectCompARef")
     894                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("SelectCompARef")
     895                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     896                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     897                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     898                            .dwattr $C$DW$64, DW_AT_decl_line(0x86)
     899                            .dwattr $C$DW$64, DW_AT_decl_column(0x25)
     900                    
     901                    $C$DW$65        .dwtag  DW_TAG_member
     902                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$66)
     903                            .dwattr $C$DW$65, DW_AT_name("SelectADCCompBInput")
     904                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("SelectADCCompBInput")
     905                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     906                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     907                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     908                            .dwattr $C$DW$65, DW_AT_decl_line(0x87)
     909                            .dwattr $C$DW$65, DW_AT_decl_column(0x25)
     910                    
     911                    $C$DW$66        .dwtag  DW_TAG_member
     912                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$67)
     913                            .dwattr $C$DW$66, DW_AT_name("SelectCompBRef")
     914                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("SelectCompBRef")
     915                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     916                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     917                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\cc
     918                            .dwattr $C$DW$66, DW_AT_decl_line(0x88)
     919                            .dwattr $C$DW$66, DW_AT_decl_column(0x25)
     920                    
     921                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
     922                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x75)
     923                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
     924                            .dwendtag $C$DW$T$68
     925                    
     926                    $C$DW$T$192     .dwtag  DW_TAG_typedef
     927                            .dwattr $C$DW$T$192, DW_AT_name("HARD_API_T")
     928                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$68)
     929                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
     930                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices
     931                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x89)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   18

     932                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x03)
     933                    
     934                    
     935                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
     936                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
     937                    $C$DW$67        .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
     939                            .dwattr $C$DW$67, DW_AT_name("quot")
     940                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("quot")
     941                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
     944                            .dwattr $C$DW$67, DW_AT_decl_line(0x49)
     945                            .dwattr $C$DW$67, DW_AT_decl_column(0x16)
     946                    
     947                    $C$DW$68        .dwtag  DW_TAG_member
     948                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
     949                            .dwattr $C$DW$68, DW_AT_name("rem")
     950                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rem")
     951                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     952                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     953                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
     954                            .dwattr $C$DW$68, DW_AT_decl_line(0x49)
     955                            .dwattr $C$DW$68, DW_AT_decl_column(0x1c)
     956                    
     957                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
     958                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x49)
     959                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
     960                            .dwendtag $C$DW$T$69
     961                    
     962                    $C$DW$T$193     .dwtag  DW_TAG_typedef
     963                            .dwattr $C$DW$T$193, DW_AT_name("div_t")
     964                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$69)
     965                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
     966                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
     967                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x49)
     968                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x23)
     969                    
     970                    
     971                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
     972                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
     973                    $C$DW$69        .dwtag  DW_TAG_member
     974                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$10)
     975                            .dwattr $C$DW$69, DW_AT_name("quot")
     976                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("quot")
     977                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     979                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
     980                            .dwattr $C$DW$69, DW_AT_decl_line(0x4e)
     981                            .dwattr $C$DW$69, DW_AT_decl_column(0x16)
     982                    
     983                    $C$DW$70        .dwtag  DW_TAG_member
     984                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$10)
     985                            .dwattr $C$DW$70, DW_AT_name("rem")
     986                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rem")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   19

     987                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     988                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     989                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
     990                            .dwattr $C$DW$70, DW_AT_decl_line(0x4e)
     991                            .dwattr $C$DW$70, DW_AT_decl_column(0x1c)
     992                    
     993                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
     994                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x4e)
     995                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
     996                            .dwendtag $C$DW$T$70
     997                    
     998                    $C$DW$T$194     .dwtag  DW_TAG_typedef
     999                            .dwattr $C$DW$T$194, DW_AT_name("ldiv_t")
    1000                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$70)
    1001                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    1002                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1003                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x4e)
    1004                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x23)
    1005                    
    1006                    
    1007                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    1008                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x10)
    1009                    $C$DW$71        .dwtag  DW_TAG_member
    1010                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$14)
    1011                            .dwattr $C$DW$71, DW_AT_name("quot")
    1012                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("quot")
    1013                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1015                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
    1016                            .dwattr $C$DW$71, DW_AT_decl_line(0x56)
    1017                            .dwattr $C$DW$71, DW_AT_decl_column(0x1c)
    1018                    
    1019                    $C$DW$72        .dwtag  DW_TAG_member
    1020                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$14)
    1021                            .dwattr $C$DW$72, DW_AT_name("rem")
    1022                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("rem")
    1023                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1024                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1025                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/st
    1026                            .dwattr $C$DW$72, DW_AT_decl_line(0x56)
    1027                            .dwattr $C$DW$72, DW_AT_decl_column(0x22)
    1028                    
    1029                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include/
    1030                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x56)
    1031                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    1032                            .dwendtag $C$DW$T$71
    1033                    
    1034                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    1035                            .dwattr $C$DW$T$195, DW_AT_name("lldiv_t")
    1036                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$71)
    1037                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    1038                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1039                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x56)
    1040                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x29)
    1041                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   20

    1042                    
    1043                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1044                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    1045                    $C$DW$73        .dwtag  DW_TAG_member
    1046                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$74)
    1047                            .dwattr $C$DW$73, DW_AT_name("pointerStack")
    1048                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("pointerStack")
    1049                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1051                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1052                            .dwattr $C$DW$73, DW_AT_decl_line(0x3f5)
    1053                            .dwattr $C$DW$73, DW_AT_decl_column(0x16)
    1054                    
    1055                    $C$DW$74        .dwtag  DW_TAG_member
    1056                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$75)
    1057                            .dwattr $C$DW$74, DW_AT_name("directAPI")
    1058                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("directAPI")
    1059                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1060                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1061                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1062                            .dwattr $C$DW$74, DW_AT_decl_line(0x3f6)
    1063                            .dwattr $C$DW$74, DW_AT_decl_column(0x15)
    1064                    
    1065                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1066                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3f4)
    1067                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1068                            .dwendtag $C$DW$T$76
    1069                    
    1070                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1071                            .dwattr $C$DW$T$78, DW_AT_name("icall_directAPIMsg_t")
    1072                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1073                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1074                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1075                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x3f7)
    1076                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1077                    
    1078                    
    1079                    $C$DW$T$79      .dwtag  DW_TAG_structure_type
    1080                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x14)
    1081                    $C$DW$75        .dwtag  DW_TAG_member
    1082                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$77)
    1083                            .dwattr $C$DW$75, DW_AT_name("hdr")
    1084                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("hdr")
    1085                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1087                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1088                            .dwattr $C$DW$75, DW_AT_decl_line(0x3fb)
    1089                            .dwattr $C$DW$75, DW_AT_decl_column(0x10)
    1090                    
    1091                    $C$DW$76        .dwtag  DW_TAG_member
    1092                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$78)
    1093                            .dwattr $C$DW$76, DW_AT_name("msg")
    1094                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("msg")
    1095                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1096                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   21

    1097                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1098                            .dwattr $C$DW$76, DW_AT_decl_line(0x3fc)
    1099                            .dwattr $C$DW$76, DW_AT_decl_column(0x1a)
    1100                    
    1101                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1102                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3fa)
    1103                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x01)
    1104                            .dwendtag $C$DW$T$79
    1105                    
    1106                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    1107                            .dwattr $C$DW$T$196, DW_AT_name("icallLiteMsg_t")
    1108                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$79)
    1109                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    1110                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1111                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x3fd)
    1112                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x03)
    1113                    
    1114                    
    1115                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1116                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x0c)
    1117                    $C$DW$77        .dwtag  DW_TAG_member
    1118                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$80)
    1119                            .dwattr $C$DW$77, DW_AT_name("bufferHead")
    1120                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("bufferHead")
    1121                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1123                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1124                            .dwattr $C$DW$77, DW_AT_decl_line(0x80)
    1125                            .dwattr $C$DW$77, DW_AT_decl_column(0x13)
    1126                    
    1127                    $C$DW$78        .dwtag  DW_TAG_member
    1128                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$80)
    1129                            .dwattr $C$DW$78, DW_AT_name("bufferTail")
    1130                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("bufferTail")
    1131                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1132                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1133                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1134                            .dwattr $C$DW$78, DW_AT_decl_line(0x81)
    1135                            .dwattr $C$DW$78, DW_AT_decl_column(0x13)
    1136                    
    1137                    $C$DW$79        .dwtag  DW_TAG_member
    1138                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1139                            .dwattr $C$DW$79, DW_AT_name("maxBufSize")
    1140                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("maxBufSize")
    1141                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1142                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1143                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1144                            .dwattr $C$DW$79, DW_AT_decl_line(0x82)
    1145                            .dwattr $C$DW$79, DW_AT_decl_column(0x0a)
    1146                    
    1147                    $C$DW$80        .dwtag  DW_TAG_member
    1148                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$82)
    1149                            .dwattr $C$DW$80, DW_AT_name("pBuffer")
    1150                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("pBuffer")
    1151                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   22

    1152                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1153                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1154                            .dwattr $C$DW$80, DW_AT_decl_line(0x83)
    1155                            .dwattr $C$DW$80, DW_AT_decl_column(0x0a)
    1156                    
    1157                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1158                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x7e)
    1159                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1160                            .dwendtag $C$DW$T$83
    1161                    
    1162                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1163                            .dwattr $C$DW$T$85, DW_AT_name("halUARTBufControl_t")
    1164                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$83)
    1165                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1166                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1167                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x84)
    1168                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1169                    
    1170                    
    1171                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    1172                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x2c)
    1173                    $C$DW$81        .dwtag  DW_TAG_member
    1174                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$84)
    1175                            .dwattr $C$DW$81, DW_AT_name("configured")
    1176                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("configured")
    1177                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1179                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1180                            .dwattr $C$DW$81, DW_AT_decl_line(0x88)
    1181                            .dwattr $C$DW$81, DW_AT_decl_column(0x17)
    1182                    
    1183                    $C$DW$82        .dwtag  DW_TAG_member
    1184                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$81)
    1185                            .dwattr $C$DW$82, DW_AT_name("baudRate")
    1186                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("baudRate")
    1187                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1188                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1189                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1190                            .dwattr $C$DW$82, DW_AT_decl_line(0x89)
    1191                            .dwattr $C$DW$82, DW_AT_decl_column(0x17)
    1192                    
    1193                    $C$DW$83        .dwtag  DW_TAG_member
    1194                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$84)
    1195                            .dwattr $C$DW$83, DW_AT_name("flowControl")
    1196                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("flowControl")
    1197                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1198                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1199                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1200                            .dwattr $C$DW$83, DW_AT_decl_line(0x8a)
    1201                            .dwattr $C$DW$83, DW_AT_decl_column(0x17)
    1202                    
    1203                    $C$DW$84        .dwtag  DW_TAG_member
    1204                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1205                            .dwattr $C$DW$84, DW_AT_name("flowControlThreshold")
    1206                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("flowControlThreshold")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   23

    1207                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1208                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1209                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1210                            .dwattr $C$DW$84, DW_AT_decl_line(0x8b)
    1211                            .dwattr $C$DW$84, DW_AT_decl_column(0x17)
    1212                    
    1213                    $C$DW$85        .dwtag  DW_TAG_member
    1214                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$81)
    1215                            .dwattr $C$DW$85, DW_AT_name("idleTimeout")
    1216                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("idleTimeout")
    1217                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1218                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1219                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1220                            .dwattr $C$DW$85, DW_AT_decl_line(0x8c)
    1221                            .dwattr $C$DW$85, DW_AT_decl_column(0x17)
    1222                    
    1223                    $C$DW$86        .dwtag  DW_TAG_member
    1224                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$85)
    1225                            .dwattr $C$DW$86, DW_AT_name("rx")
    1226                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("rx")
    1227                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1228                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1229                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1230                            .dwattr $C$DW$86, DW_AT_decl_line(0x8d)
    1231                            .dwattr $C$DW$86, DW_AT_decl_column(0x17)
    1232                    
    1233                    $C$DW$87        .dwtag  DW_TAG_member
    1234                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$85)
    1235                            .dwattr $C$DW$87, DW_AT_name("tx")
    1236                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("tx")
    1237                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1238                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1239                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1240                            .dwattr $C$DW$87, DW_AT_decl_line(0x8e)
    1241                            .dwattr $C$DW$87, DW_AT_decl_column(0x17)
    1242                    
    1243                    $C$DW$88        .dwtag  DW_TAG_member
    1244                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$84)
    1245                            .dwattr $C$DW$88, DW_AT_name("intEnable")
    1246                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("intEnable")
    1247                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1248                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1249                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1250                            .dwattr $C$DW$88, DW_AT_decl_line(0x8f)
    1251                            .dwattr $C$DW$88, DW_AT_decl_column(0x17)
    1252                    
    1253                    $C$DW$89        .dwtag  DW_TAG_member
    1254                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$86)
    1255                            .dwattr $C$DW$89, DW_AT_name("rxChRvdTime")
    1256                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("rxChRvdTime")
    1257                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1258                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1259                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1260                            .dwattr $C$DW$89, DW_AT_decl_line(0x90)
    1261                            .dwattr $C$DW$89, DW_AT_decl_column(0x17)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   24

    1262                    
    1263                    $C$DW$90        .dwtag  DW_TAG_member
    1264                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$89)
    1265                            .dwattr $C$DW$90, DW_AT_name("callBackFunc")
    1266                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("callBackFunc")
    1267                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1268                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1269                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1270                            .dwattr $C$DW$90, DW_AT_decl_line(0x91)
    1271                            .dwattr $C$DW$90, DW_AT_decl_column(0x17)
    1272                    
    1273                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1274                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x87)
    1275                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    1276                            .dwendtag $C$DW$T$90
    1277                    
    1278                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    1279                            .dwattr $C$DW$T$197, DW_AT_name("halUARTCfg_t")
    1280                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$90)
    1281                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    1282                            .dwattr $C$DW$T$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1283                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x92)
    1284                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x02)
    1285                    
    1286                    
    1287                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    1288                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1289                    $C$DW$91        .dwtag  DW_TAG_member
    1290                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$81)
    1291                            .dwattr $C$DW$91, DW_AT_name("event")
    1292                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("event")
    1293                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1295                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1296                            .dwattr $C$DW$91, DW_AT_decl_line(0x79)
    1297                            .dwattr $C$DW$91, DW_AT_decl_column(0x0a)
    1298                    
    1299                    $C$DW$92        .dwtag  DW_TAG_member
    1300                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$81)
    1301                            .dwattr $C$DW$92, DW_AT_name("status")
    1302                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("status")
    1303                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1304                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1305                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1306                            .dwattr $C$DW$92, DW_AT_decl_line(0x7a)
    1307                            .dwattr $C$DW$92, DW_AT_decl_column(0x0a)
    1308                    
    1309                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1310                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x78)
    1311                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    1312                            .dwendtag $C$DW$T$91
    1313                    
    1314                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    1315                            .dwattr $C$DW$T$92, DW_AT_name("osal_event_hdr_t")
    1316                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   25

    1317                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1318                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1319                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x7b)
    1320                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1321                    
    1322                    
    1323                    $C$DW$T$93      .dwtag  DW_TAG_structure_type
    1324                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x04)
    1325                    $C$DW$93        .dwtag  DW_TAG_member
    1326                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$92)
    1327                            .dwattr $C$DW$93, DW_AT_name("hdr")
    1328                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("hdr")
    1329                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1331                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC1350
    1332                            .dwattr $C$DW$93, DW_AT_decl_line(0xbc)
    1333                            .dwattr $C$DW$93, DW_AT_decl_column(0x14)
    1334                    
    1335                    $C$DW$94        .dwtag  DW_TAG_member
    1336                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$81)
    1337                            .dwattr $C$DW$94, DW_AT_name("state")
    1338                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("state")
    1339                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1340                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1341                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC1350
    1342                            .dwattr $C$DW$94, DW_AT_decl_line(0xbd)
    1343                            .dwattr $C$DW$94, DW_AT_decl_column(0x09)
    1344                    
    1345                    $C$DW$95        .dwtag  DW_TAG_member
    1346                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$81)
    1347                            .dwattr $C$DW$95, DW_AT_name("keys")
    1348                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("keys")
    1349                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1350                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1351                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC1350
    1352                            .dwattr $C$DW$95, DW_AT_decl_line(0xbe)
    1353                            .dwattr $C$DW$95, DW_AT_decl_column(0x09)
    1354                    
    1355                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC13
    1356                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xbb)
    1357                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    1358                            .dwendtag $C$DW$T$93
    1359                    
    1360                    $C$DW$T$198     .dwtag  DW_TAG_typedef
    1361                            .dwattr $C$DW$T$198, DW_AT_name("keyChange_t")
    1362                            .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$93)
    1363                            .dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
    1364                            .dwattr $C$DW$T$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/examples/rtos/CC1
    1365                            .dwattr $C$DW$T$198, DW_AT_decl_line(0xbf)
    1366                            .dwattr $C$DW$T$198, DW_AT_decl_column(0x03)
    1367                    
    1368                    
    1369                    $C$DW$T$100     .dwtag  DW_TAG_union_type
    1370                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x02)
    1371                    $C$DW$96        .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   26

    1372                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$96)
    1373                            .dwattr $C$DW$96, DW_AT_name("entityId")
    1374                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("entityId")
    1375                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1377                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1378                            .dwattr $C$DW$96, DW_AT_decl_line(0x1fe)
    1379                            .dwattr $C$DW$96, DW_AT_decl_column(0x14)
    1380                    
    1381                    $C$DW$97        .dwtag  DW_TAG_member
    1382                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$99)
    1383                            .dwattr $C$DW$97, DW_AT_name("servId")
    1384                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("servId")
    1385                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1387                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1388                            .dwattr $C$DW$97, DW_AT_decl_line(0x200)
    1389                            .dwattr $C$DW$97, DW_AT_decl_column(0x17)
    1390                    
    1391                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1392                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x1fc)
    1393                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    1394                            .dwendtag $C$DW$T$100
    1395                    
    1396                    
    1397                    $C$DW$T$101     .dwtag  DW_TAG_union_type
    1398                            .dwattr $C$DW$T$101, DW_AT_byte_size(0x02)
    1399                    $C$DW$98        .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$99)
    1401                            .dwattr $C$DW$98, DW_AT_name("servId")
    1402                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("servId")
    1403                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1406                            .dwattr $C$DW$98, DW_AT_decl_line(0x211)
    1407                            .dwattr $C$DW$98, DW_AT_decl_column(0x17)
    1408                    
    1409                    $C$DW$99        .dwtag  DW_TAG_member
    1410                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$96)
    1411                            .dwattr $C$DW$99, DW_AT_name("entityId")
    1412                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("entityId")
    1413                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1415                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stack
    1416                            .dwattr $C$DW$99, DW_AT_decl_line(0x213)
    1417                            .dwattr $C$DW$99, DW_AT_decl_column(0x14)
    1418                    
    1419                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1420                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x20f)
    1421                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    1422                            .dwendtag $C$DW$T$101
    1423                    
    1424                    
    1425                    $C$DW$T$102     .dwtag  DW_TAG_union_type
    1426                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x02)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   27

    1427                    $C$DW$100       .dwtag  DW_TAG_member
    1428                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$84)
    1429                            .dwattr $C$DW$100, DW_AT_name("paramCTS")
    1430                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("paramCTS")
    1431                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1433                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1434                            .dwattr $C$DW$100, DW_AT_decl_line(0x96)
    1435                            .dwattr $C$DW$100, DW_AT_decl_column(0x08)
    1436                    
    1437                    $C$DW$101       .dwtag  DW_TAG_member
    1438                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$84)
    1439                            .dwattr $C$DW$101, DW_AT_name("paramRTS")
    1440                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("paramRTS")
    1441                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1443                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1444                            .dwattr $C$DW$101, DW_AT_decl_line(0x97)
    1445                            .dwattr $C$DW$101, DW_AT_decl_column(0x08)
    1446                    
    1447                    $C$DW$102       .dwtag  DW_TAG_member
    1448                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$84)
    1449                            .dwattr $C$DW$102, DW_AT_name("paramDSR")
    1450                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("paramDSR")
    1451                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1454                            .dwattr $C$DW$102, DW_AT_decl_line(0x98)
    1455                            .dwattr $C$DW$102, DW_AT_decl_column(0x08)
    1456                    
    1457                    $C$DW$103       .dwtag  DW_TAG_member
    1458                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$84)
    1459                            .dwattr $C$DW$103, DW_AT_name("paramDTR")
    1460                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("paramDTR")
    1461                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1463                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1464                            .dwattr $C$DW$103, DW_AT_decl_line(0x99)
    1465                            .dwattr $C$DW$103, DW_AT_decl_column(0x08)
    1466                    
    1467                    $C$DW$104       .dwtag  DW_TAG_member
    1468                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$84)
    1469                            .dwattr $C$DW$104, DW_AT_name("paramCD")
    1470                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("paramCD")
    1471                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1474                            .dwattr $C$DW$104, DW_AT_decl_line(0x9a)
    1475                            .dwattr $C$DW$104, DW_AT_decl_column(0x08)
    1476                    
    1477                    $C$DW$105       .dwtag  DW_TAG_member
    1478                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$84)
    1479                            .dwattr $C$DW$105, DW_AT_name("paramRI")
    1480                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("paramRI")
    1481                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   28

    1482                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1483                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1484                            .dwattr $C$DW$105, DW_AT_decl_line(0x9b)
    1485                            .dwattr $C$DW$105, DW_AT_decl_column(0x08)
    1486                    
    1487                    $C$DW$106       .dwtag  DW_TAG_member
    1488                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1489                            .dwattr $C$DW$106, DW_AT_name("baudRate")
    1490                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("baudRate")
    1491                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1493                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1494                            .dwattr $C$DW$106, DW_AT_decl_line(0x9c)
    1495                            .dwattr $C$DW$106, DW_AT_decl_column(0x0a)
    1496                    
    1497                    $C$DW$107       .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$84)
    1499                            .dwattr $C$DW$107, DW_AT_name("flowControl")
    1500                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("flowControl")
    1501                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1503                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1504                            .dwattr $C$DW$107, DW_AT_decl_line(0x9d)
    1505                            .dwattr $C$DW$107, DW_AT_decl_column(0x08)
    1506                    
    1507                    $C$DW$108       .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$84)
    1509                            .dwattr $C$DW$108, DW_AT_name("flushControl")
    1510                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("flushControl")
    1511                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1514                            .dwattr $C$DW$108, DW_AT_decl_line(0x9e)
    1515                            .dwattr $C$DW$108, DW_AT_decl_column(0x08)
    1516                    
    1517                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1518                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x95)
    1519                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    1520                            .dwendtag $C$DW$T$102
    1521                    
    1522                    $C$DW$T$199     .dwtag  DW_TAG_typedef
    1523                            .dwattr $C$DW$T$199, DW_AT_name("halUARTIoctl_t")
    1524                            .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$102)
    1525                            .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    1526                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1527                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x9f)
    1528                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x02)
    1529                    
    1530                    
    1531                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    1532                            .dwattr $C$DW$T$103, DW_AT_name(".ggroup1")
    1533                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x04)
    1534                    $C$DW$109       .dwtag  DW_TAG_member
    1535                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$6)
    1536                            .dwattr $C$DW$109, DW_AT_name("pwrmgr_initialized")
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   29

    1537                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("pwrmgr_initialized")
    1538                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1540                    
    1541                    $C$DW$110       .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1543                            .dwattr $C$DW$110, DW_AT_name("pwrmgr_attribute")
    1544                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("pwrmgr_attribute")
    1545                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1546                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1547                    
    1548                            .dwendtag $C$DW$T$103
    1549                    
    1550                    
    1551                    $C$DW$T$104     .dwtag  DW_TAG_structure_type
    1552                            .dwattr $C$DW$T$104, DW_AT_name("_ICall_LiteCmdStatus_")
    1553                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    1554                    $C$DW$111       .dwtag  DW_TAG_member
    1555                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$95)
    1556                            .dwattr $C$DW$111, DW_AT_name("cmdId")
    1557                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("cmdId")
    1558                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1560                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154stac
    1561                            .dwattr $C$DW$111, DW_AT_decl_line(0x3f0)
    1562                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1563                    
    1564                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1565                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3ee)
    1566                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    1567                            .dwendtag $C$DW$T$104
    1568                    
    1569                    $C$DW$T$201     .dwtag  DW_TAG_typedef
    1570                            .dwattr $C$DW$T$201, DW_AT_name("ICall_LiteCmdStatus")
    1571                            .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$104)
    1572                            .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    1573                            .dwattr $C$DW$T$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1574                            .dwattr $C$DW$T$201, DW_AT_decl_line(0x3f1)
    1575                            .dwattr $C$DW$T$201, DW_AT_decl_column(0x03)
    1576                    
    1577                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1578                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1579                    
    1580                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1581                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1582                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1583                    
    1584                    $C$DW$T$202     .dwtag  DW_TAG_typedef
    1585                            .dwattr $C$DW$T$202, DW_AT_name("ICall_Semaphore")
    1586                            .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$3)
    1587                            .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    1588                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1589                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x1ac)
    1590                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x0f)
    1591                    
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   30

    1592                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    1593                            .dwattr $C$DW$T$120, DW_AT_name("ICall_SyncHandle")
    1594                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$3)
    1595                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    1596                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1597                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x1aa)
    1598                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x0f)
    1599                    
    1600                    $C$DW$T$167     .dwtag  DW_TAG_typedef
    1601                            .dwattr $C$DW$T$167, DW_AT_name("ICall_TimerID")
    1602                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$3)
    1603                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    1604                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1605                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1b7)
    1606                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0f)
    1607                    
    1608                    $C$DW$T$203     .dwtag  DW_TAG_typedef
    1609                            .dwattr $C$DW$T$203, DW_AT_name("osal_msg_q_t")
    1610                            .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$3)
    1611                            .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    1612                            .dwattr $C$DW$T$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1613                            .dwattr $C$DW$T$203, DW_AT_decl_line(0x7d)
    1614                            .dwattr $C$DW$T$203, DW_AT_decl_column(0x10)
    1615                    
    1616                    
    1617                    $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
    1618                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1619                            .dwendtag $C$DW$T$41
    1620                    
    1621                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1622                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1623                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1624                    
    1625                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1626                            .dwattr $C$DW$T$183, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1627                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$42)
    1628                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1629                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1630                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x43)
    1631                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x10)
    1632                    
    1633                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    1634                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1635                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$42)
    1636                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1637                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1638                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x5f)
    1639                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    1640                    
    1641                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    1642                            .dwattr $C$DW$T$43, DW_AT_name("FPTR_RESETDEV_T")
    1643                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    1644                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1645                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1646                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x4d)
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   31

    1647                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x19)
    1648                    
    1649                    $C$DW$T$204     .dwtag  DW_TAG_typedef
    1650                            .dwattr $C$DW$T$204, DW_AT_name("FPTR_VOID_VOID_T")
    1651                            .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$42)
    1652                            .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    1653                            .dwattr $C$DW$T$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
    1654                            .dwattr $C$DW$T$204, DW_AT_decl_line(0x33)
    1655                            .dwattr $C$DW$T$204, DW_AT_decl_column(0x11)
    1656                    
    1657                    $C$DW$T$205     .dwtag  DW_TAG_typedef
    1658                            .dwattr $C$DW$T$205, DW_AT_name("__TI_atexit_fn")
    1659                            .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$42)
    1660                            .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    1661                            .dwattr $C$DW$T$205, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.1.LTS/include
    1662                            .dwattr $C$DW$T$205, DW_AT_decl_line(0xb2)
    1663                            .dwattr $C$DW$T$205, DW_AT_decl_column(0x14)
    1664                    
    1665                    
    1666                    $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    1667                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1668                    $C$DW$112       .dwtag  DW_TAG_formal_parameter
    1669                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$25)
    1670                    
    1671                            .dwendtag $C$DW$T$57
    1672                    
    1673                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1674                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1675                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    1676                    
    1677                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    1678                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_RESERVED4_T")
    1679                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1680                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1681                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1682                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x61)
    1683                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    1684                    
    1685                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    1686                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_RESERVED5_T")
    1687                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    1688                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1689                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1690                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x63)
    1691                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    1692                    
    1693                    
    1694                    $C$DW$T$62      .dwtag  DW_TAG_subroutine_type
    1695                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1696                    $C$DW$113       .dwtag  DW_TAG_formal_parameter
    1697                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    1698                    
    1699                            .dwendtag $C$DW$T$62
    1700                    
    1701                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   32

    1702                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1703                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    1704                    
    1705                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    1706                            .dwattr $C$DW$T$66, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1707                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$63)
    1708                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1709                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1710                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x69)
    1711                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x19)
    1712                    
    1713                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    1714                            .dwattr $C$DW$T$64, DW_AT_name("FPTR_COMPAIN_T")
    1715                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1716                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1717                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1718                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x65)
    1719                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x19)
    1720                    
    1721                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    1722                            .dwattr $C$DW$T$65, DW_AT_name("FPTR_COMPAREF_T")
    1723                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    1724                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1725                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1726                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x67)
    1727                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x19)
    1728                    
    1729                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    1730                            .dwattr $C$DW$T$67, DW_AT_name("FPTR_COMPBREF_T")
    1731                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$63)
    1732                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1733                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_10_00_36\source\ti\devices\
    1734                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x6b)
    1735                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x19)
    1736                    
    1737                    $C$DW$T$206     .dwtag  DW_TAG_typedef
    1738                            .dwattr $C$DW$T$206, DW_AT_name("FPTR_VOID_UINT8_T")
    1739                            .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$63)
    1740                            .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    1741                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/devices
    1742                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x34)
    1743                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x11)
    1744                    
    1745                    
    1746                    $C$DW$T$87      .dwtag  DW_TAG_subroutine_type
    1747                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1748                    $C$DW$114       .dwtag  DW_TAG_formal_parameter
    1749                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$81)
    1750                    
    1751                    $C$DW$115       .dwtag  DW_TAG_formal_parameter
    1752                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$81)
    1753                    
    1754                            .dwendtag $C$DW$T$87
    1755                    
    1756                    $C$DW$T$88      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v18.1.1 Wed Apr 25 09:49:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\devops\AppData\Local\Temp\2\{CC200B77-201D-497C-B7A3-9F36AC46E2A4} PAGE   33

    1757                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1758                            .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    1759                    
    1760                    $C$DW$T$207     .dwtag  DW_TAG_typedef
    1761                            .dwattr $C$DW$T$207, DW_AT_name("assertCback_t")
    1762                            .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$88)
    1763                            .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    1764                            .dwattr $C$DW$T$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154st
    1765                            .dwattr $C$DW$T$207, DW_AT_decl_line(0xd3)
    1766                            .dwattr $C$DW$T$207, DW_AT_decl_column(0x10)
    1767                    
    1768                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    1769                            .dwattr $C$DW$T$89, DW_AT_name("halUARTCBack_t")
    1770                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1771                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1772                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_10_00_36/source/ti/ti154sta
    1773                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x7b)
    1774                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
    1775                    
    1776                    
    1777                    $C$DW$T$109     .dwtag  DW_TAG_subroutine_type
    1778                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1779                    $C$DW$116       .dwtag  DW_TAG_formal_parameter
    1780                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$107)
    1781                    
    1782                            .dwendtag $C$DW$T$109
    1783                    
    1784                    $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    1785                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    1786                            .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    1787                    
    1788                    
    1789                    $C$DW$T$145     .dwtag  DW_TAG_subroutine_type
    1790                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    1791                    $C$DW$117       .dwtag  DW_TAG_formal_parameter
    1792                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$143)
    1793                    
    1794                    $C$DW$118       .dwtag  DW_TAG_formal_parameter
    1795                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$144)
    1796                    
    1797                            .dwendtag $C$DW$T$145
    1798                    
    1799                    $C$DW$T$146     .dwtag  DW_TAG_pointer_type
